{"collection":"riyadussalihin","bookNumber":"6","chapterId":"144.00","hadithNumber":"896","hadith":[{"lang":"en","chapterNumber":"144","chapterTitle":"Visiting the Sick","urn":1608420,"body":"<p>Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"Verily, Allah, the Exalted, and Glorious will say on the Day of Resurrection: 'O son of Adam, I was ill but you did not visit Me.' He would say: 'O my Rubb, how could I visit you and You are the Rubb of the worlds?' Thereupon He would say: 'Did you not know that such and such a slave of Mine was ill but you did not visit him? Did you not realize that if you had visited him (you would have known that I was aware of your visit to him, for which I would reward you) you would have found Me with him? O son of Adam, I asked food from you but you did not feed Me.' He would submit: 'My Rubb, how could I feed You and You are the Rubb of the worlds?' He would say: 'Did you not know that such and such a slave of Mine asked you for food but you did not feed him? Did you not realize that if you had fed him, you would certainly have found (its reward) with Me? O son of Adam, I asked water from you but you did not give it to Me.' He would say: 'My Rubb, how could I give You (water) and You are the Rubb of the worlds?' Thereupon He would say: 'Such and such a slave of Mine asked you for water to drink but you did not give it to him. Did you not realize that if you had given him to drink you would have found (its reward) with Me?\"'<br/><br/><b>[Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"144","chapterTitle":"- باب عيادة المريض","urn":1708890,"body":"<p>- وعنه قالك قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏عن الله عزو جل يقول يوم القيامة‏:‏ ‏\"‏يا ابن آدم مرضت فلم تعدني‏!‏ قال‏:‏ يا رب كيف أعودك وأنت رب العالمين‏؟‏‏!‏ قال‏:‏ أما علمت أن عبدي فلاناً مرض فلم تعده‏؟‏ أما علمت أنك لو عدته لوجدتني عنده‏؟‏ يا ابن آدم استطعمتك فلم تطعمني‏!‏ قال‏:‏ يا رب كيف أطعمك وأنت رب العالمين‏؟‏‏!‏ قال‏:‏ أما علمت أنه استطعمك عبدي فلان فلم تطعمه، أما علمت أنك لو أطعمته لوجدت ذلك عندي‏؟‏ يا ابن آدم استسقيتك فلم تسقني‏!‏ قال‏:‏ يارب كيف أسقيك وأنت رب العالمين‏؟‏‏!‏ قال‏:‏ استسقاك عبدي فلان فلم تسقه‏!‏ أما علمت أنك لو سقيته لوجدت ذلك عندي‏؟‏‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏</p>","grades":[]}]}
