{
    "collection": "riyadussalihin",
    "bookNumber": "17",
    "chapterId": "271.00",
    "hadithNumber": "1570",
    "hadith": [
        {
            "lang": "en",
            "chapterNumber": "271",
            "chapterTitle": "Prohibition of Spying on Muslims and to be Inquisitive about Others",
            "urn": 1623710,
            "body": "<p>Abu Hurairah (May Allah be pleased with him) said: The Messenger of Allah (ﷺ) said, \"Beware of suspicion, for suspicion is the worst of false tales. Do not look for other's faults. Do not spy one another, and do not practise Najsh (means to offer a high price for something in order to allure another customer who is interested in the thing). Do not be jealous of one another and do not nurse enmity against one another. Do not sever ties with one another. Become the slaves of Allah, and be brothers to one another as He commanded. A Muslim is the brother of a Muslim. He should neither oppress him nor humiliate him. The piety is here! The piety is here!\" While saying so he pointed towards his chest. \"It is enough evil for a Muslim to look down upon his Muslim brother. All things of a Muslim are inviolable for his brother in Faith: his blood, his wealth and his honour. Verily, Allah does not look to your bodies nor to your faces but He looks to your hearts and your deeds.\"<br/><br/>Another narration is: \"Do not feel envy against one another; do not nurse enmity; do not spy on one another and do not cheat one another. Be Allah's slaves, brethren to one another.\"<br/><br/>Another narration is: \"Do not have estranged relations with one another. Do not nurse enmity and do not feel envy against one another. O Allah's worshippers! Be brothers!\"<br/><br/>Another narration is: \"Do not estrange mutual relations and do not intervene into the transaction which is likely to be settled with another person.\"<br/><br/><b>[Muslim]</b>.<br/><br/></p>",
            "grades": []
        },
        {
            "lang": "ar",
            "chapterNumber": "271",
            "chapterTitle": "- باب النهي عن التجسس والتسمع لكلام من يكره استماعه",
            "urn": 1715600,
            "body": "<p>- وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏إياكم والظن، فإن الظن أكذب الحديث، ولا تحسسوا، ولا تجسسوا ولا تنافسوا، ولا تحاسدوا، ولا تباغضوا، ولا تدابروا، وكونوا عباد الله إخوانًا كما أمركم‏.‏ المسلم أخو المسلم، لا يظلمه، ولا يخذله ولا يحقره‏.‏ التقوى ههنا، ‏\"‏ ويشير إلى صدره ‏\"‏بحسب امرئ من الشر أن يحقر أخاه المسلم، كل المسلم على المسلم حرام‏:‏ دمه، وعرضه، وماله، إن الله لا ينظر إلى أجسادكم، ولا إلى صوركم، ولكن ينظر إلى قلوبكم وأعمالكم‏\"‏‏.‏ وفي رواية‏:‏ ‏\"‏لا تحاسدوا، ولا تباغضوا، ولا تجسسوا، ولا تحسسوا ولا تناجشوا وكونوا عباد الله إخوانًا‏\"‏‏.‏ \nوفي رواية‏:‏ ‏\"‏لا تقاطعوا، ولا تدابروا، ولا تباغضوا ولا تحاسدوا، وكونوا عباد الله إخوانًا‏\"‏‏.‏ وفي رواية‏:‏ ‏\"‏لا تهاجروا ولا يبع بعضكم على بيع بعض‏\"‏‏.‏\n‏(‏‏(‏رواه مسلم بكل هذه الروايات، وروى البخاري أكثرها‏)‏‏)‏‏.‏</p>",
            "grades": []
        }
    ]
}