{"collection":"riyadussalihin","bookNumber":"15","chapterId":"244.00","hadithNumber":"1417","hadith":[{"lang":"en","chapterNumber":"244","chapterTitle":"The Excellence of the Remembrance of Allah","urn":1612840,"body":"<p>It has been reported that 'Abdullah bin Zubair (May Allah be pleased with them) used to recite after Taslim at the conclusion of every Salat (prayer): \"La ilaha illallahu wahdahu la sharika lahu, lahul- mulku, wa lahul-hamdu, wa Huwa 'ala kulli shai'in Qadir. La hawla wa la quwwata illa billah. La ilaha illallahu, wa la na'budu illa iyyahu, Lahun-ni'matu, wa lahul-fadlu, wa lahuth-thana'ul-hasan. La ilaha ilallahu, mukhlisina, lahud-dina, wa lau karihal-kafirun (there is no true god except Allah; He is One. To Him belongs the dominion and to Him is all praise, and He is Powerful over all things. There is no power and might except with (the help of) Allah. There is no God but Allah and we worship none except Him, to Him belongs the bounty and to Him belongs the grace, and to Him belongs all excellent praise; there is no deity but Allah. We reserve our devotion exclusively for Him though the disbelievers may detest it).\" Ibn Az-Zubair said: The Messenger of Allah (ﷺ) used to celebrate Allah's Greatness in those terms after every Salat (prayer).<br/><br/><b>[Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"244","chapterTitle":"- باب فضل الذكر والحث عليه","urn":1714070,"body":"<p>- وعن عبد الله ابن الزبير رضي الله عنهما أنه كان يقول دبر كل صلاة، حين يسلم‏:‏ لا إله إلا الله وحده لا شريك له ، له الملك وله الحمد ، وهو على كل شيء قدير ‏.‏ لا حول ولا قوة إلا بالله ،لا إله إلا الله، ولا نعبد إلا إياه، له النعمة، وله الفضل وله الثناء الحسن‏.‏ لا إله إلا الله مخلصين له الدين ولو كره الكافرون ‏.‏ قال ابن الزبير‏:‏ وكان رسول الله صلى الله عليه وسلم، يهلل بهن دبر كل صلاة‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏</p>","grades":[]}]}
