{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"75.00","hadithNumber":"642","hadith":[{"lang":"en","chapterNumber":"75","chapterTitle":"Forgiveness of the Ignorant","urn":1606360,"body":"<p>'Aishah (May Allah be pleased with her) reported: I asked the Prophet (ﷺ) \"Have you ever experienced a day harder than the day of the battle of Uhud?\" He replied, \"Indeed, I experienced them (dangers) at the hands of your people (i.e., the disbelievers from amongst the Quraish tribe). The hardest treatment I met from them was on the Day of 'Aqabah when I went to Ibn 'Abd Yalil bin 'Abd Kulal (who was one of the chiefs of Ta'if) with the purpose of inviting him to Islam, but he made no response (to my call). So I departed with deep distress. I did not recover until I arrived at Qarn ath-Tha'alib. There, I raised my head and saw a cloud which had cast its shadow on me. I saw in it Jibril (Gabriel) (ﷺ) who called me and said: 'Indeed, Allah, the Exalted, heard what your people said to you and the response they made to you. And He has sent you the angel in charge of the mountains to order him to do to them what you wish.' Then the angel of the mountains called me, greeted me and said: 'O Muhammad, Allah listened to what your people had said to you. I am the angel of the mountains, and my Rubb has sent me to you so that you may give me your orders. (I will carry out your orders). If you wish I will bring together the two mountains that stand opposite to each other at the extremities of Makkah to crush them in between.\"' But Messenger of Allah (ﷺ) said, \"I rather hope that Allah will raise from among their descendants people as will worship Allah the One, and will not ascribe partners to Him (in worship).\"<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"75","chapterTitle":"- باب العفو والإعراض عن الجاهلين","urn":1706380,"body":"<p>- وعن عائشة رضي الله عنها أنها قالت للنبى صلى الله عليه وسلم‏:‏ هل أتى عليك يوم كان أشد من يوم أحد‏؟‏ قال‏:‏ “لقد لقيت من قومك، وكان أشد ما لقيته منهم يوم العقبة، إذ عرضت نفسي على ابن عبد ياليل بن عبد كلال فلم يجبنى إلى ما أردت، فانطلقت وأنا مهموم على وجهى، فلم أستفق إلا وأنا بقرن الثعالب، فرفعت رأسى، فإذا أنا بسحابة قد أظلتنى، فنظرت فإذا فيها جبريل عليه السلام، فنادانى فقال‏:‏ إن الله تعالى قد سمع قول قومك لك، وما ردوا عليك، وقد بعث إليك ملك الجبال لتأمره بما شئت فيهم فنادانى ملك الجبال، فسلم على ثم قال‏:‏ يا محمد إن الله قد سمع قول قومك لك، وأنا ملك الجبال، وقد بعثنى ربى إليك لتأمرنى بأمرك،فما شئت‏:‏ إن شئت أطبقت عليهم الأخشبين” فقال النبى صلى الله عليه وسلم‏:‏ ‏\"‏بل أرجو أن يخرج من أصلابهم من يعبد الله وحده لا يشرك به شيئاً‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏</p>","grades":[]}]}
