{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"11.00","hadithNumber":"111","hadith":[{"lang":"en","chapterNumber":"11","chapterTitle":"The Struggle (in the Cause of Allah)","urn":1601100,"body":"<p>Abu Dharr (May Allah be pleased with him) said: The Prophet (ﷺ) said, \"Allah, the Exalted, and Glorious, said; 'O My slaves, I have prohibited Myself injustice; and have made oppression unlawful for you, so do not oppress one another. O My slaves, all of you are liable to err except the one whom I guide on the Right Path, so seek guidance from Me so that I will guide you to the Right Path. O My slaves, all of you are hungry except the one whom I feed, so ask food from Me, I will feed you. O My slaves, all of you are naked except those whom I clothe, so ask clothing of Me and I shall clothe you. O My slaves, you commit sins night and day and I forgive all sins, so seek My forgiveness and I shall forgive you. O My slaves, you can neither do Me any harm nor can you do Me any good. O My slaves, were the first of you and the last of you, the human of you and jinn of you to be as pious as the most pious heart of any man of you, that would not increase My domain a thing. O My slaves, were the first of you, and the last of you, the human of you and the jinn of you to be as wicked as the most wicked heart of any man of you, that would not decrease My domain in a thing. O My slaves, were the first of you and the last of you, the human of you and the jinn of you to stand in one place and make a request of Me, and were I to give everyone what he requested, that would not decrease what I have, any more than a needle decrease the sea if put into it. O My slaves, it is but your deeds that I reckon for you and then recompense you for, so let him who finds good (i.e., in the Hereafter) praise Allah and let him who finds other than that blame no one but himself.\"'.<br/><br/><b>[Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"11","chapterTitle":"- باب المجاهدة","urn":1701100,"body":"<p>- السابع عشر‏:‏ عن سعيد بن عبد العزيز، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي ذر جندب بن جنادة، رضي الله عنه، عن النبي صلى الله عليه وسلم فيما يروى عن الله تبارك وتعالى أنه قال‏:‏ ‏\"‏ ياعبادي إني حرمت الظلم على نفسي وجعلته بينكم محرماً فلا تظالموا، يا عبادي كلكم ضال إلا من هديته؛ فاستهدوني أهدكم، يا عبادي كلكم جائع إلا من أطعمته؛ فاستطعموني أطعمكم،يا عبادي كلكم عارٍ إلا من كسوته، فاستكسوني أكسكم، يا عبادي إنكم تخطئون بالليل والنهار وأنا أغفر الذنوب جميعا، فاستغفروني أغفرلكم، ياعبادي إنكم لن تبلغوا ضري فتضروني، ولن تبلغوا نفعي فتنفعوني، يَا عِبَادي ، لَوْ أنَّ أوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجنَّكُمْ كَانُوا عَلَى أتْقَى قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ مَا زَادَ ذلِكَ في مُلكي شيئاً . يَا عِبَادي ، لَوْ أنَّ أوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجنَّكُمْ كَانُوا عَلَى أفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ مَا نَقَصَ ذلِكَ من مُلكي شيئاً، يا عبادي لو أن أولكم وآخركم، وإنسكم وجنكم قاموا في صعيد واحد، فسألوني فأعطيت كل إنسان مسألته، ما نقص ذلك مما عندي إلا كما ينقص المخيط إذا أدخل البحر، يا عبادي إنما هي أعمالكم أحصيها لكم، ثم أوفيكم إياها، فمن وجد خيراً فليحمد الله، ومن وجد غير ذلك فلا يلومن إلا نفسه‏\"‏‏.‏ قال سعيد‏:‏ كان أبو إدريس إذا حدث بهذا الحديث جثا على ركبتيه‏.‏ رواه مسلم‏.‏ <a href=\"javascript:opencomment('‏وروينا عن الإمام أحمد بن حنبل رحمه الله قال‏:‏ ليس لأهل الشام حديث أشرف من هذا الحديث ‏')\">(20)</a>‏.‏</p>","grades":[]}]}
