{
    "collection": "riyadussalihin",
    "bookNumber": "18",
    "chapterId": "370.00",
    "hadithNumber": "1866",
    "hadith": [
        {
            "lang": "en",
            "chapterNumber": "370",
            "chapterTitle": "Ahadith about Dajjal and Portents of the Hour",
            "urn": 1616560,
            "body": "<p>Abu Huraira reported: Meat was one day brought to the Messenger of Allah (ﷺ) and a foreleg was offered to him, a part which he liked. He sliced with his teeth a piece out of it and said: I shall be the leader of mankind on the Day of Resurrection. Do you know why? Allah would gather in one plain the earlier and the later (of the human race) on the Day of Resurrection. Then the voice of the proclaimer would be heard by all of them and the eyesight would penetrate through all of them and the sun would come near. People would then experience a degree of anguish, anxiety and agony which they shall not be able to bear and they shall not be able to stand. Some people would say to the others: Don you see in which trouble you are? Don't you see what (misfortune) has overtaken you? Why don't you find one who should intercede for you with your Lord? Some would say to the others: Go to Adam. And they would go to Adam and say: O Adam, thou art the father of mankind. Allah created thee by His own Hand and breathed in thee of His spirit and ordered the angels to prostrate before thee. Intercede for us with thy Lord Don't you see in what (trouble) we are? Don't you see what (misfortune) has overtaken us? Adam would say: Verily, my Lord is angry, to an extent to which He had never been angry before nor would He be angry afterward. Verily, He forbade me (to go near) that tree and I disobeyed Him. I am concerned with my own self. Go to someone else; go to Noah. They would come to Noah and would say: O Noah, thou art the first of the Messengers (sent) on the earth (after Adam), and Allah named thee as a\" Grateful Servant,\" intercede for us with thy Lord. Don't you see in what (trouble) we are? Don't you see what (misfortune) has overtaken us? He would say: Verily, my Lord is angry today as He had never been angry before, and would never be angry afterwards. There had emanated a curse from me with which I cursed my people. I am concerned with only myself, I am concerned only with myself; you better go to Ibrahim (peace be upon him). They would go to Ibrahim and say: Thou art the apostle of Allah and His Friend amongst the inhabitants of the earth; intercede for us with thy Lord. Don't you see in which (trouble) we are? Don't you see what (misfortune) has overtaken us? Ibrahim would say to them: Verily, my Lord is today angry as He had never been angry before and would never be angry afterwards. and (Ibrahim) would mention his lies (and then say): I am concerned only with myself, I am concerned only with myself. You better go to someone else: go to Moses. They would come to Moses (peace be upon him) and say: O Moses, thou art Allah's messenger, Allah blessed thee with His messengership and His conversation amongst people. Intercede for us with thy Lord. Don't you see in what (trouble) we are? Don't you see what (misfortune) has overtaken us? Moses (peace be upon him) would say to them: Verily. my Lord is angry as He had never been angry before and would never be angry afterwards. I, in fact, killed a person whom I had not been ordered to kill. I am concerned with myself, I am concerned with myself. You better go to Jesus (peace be upon him). They would come to Jesus and would say: O Jesus, thou art the messenger of Allah and thou conversed with people in the cradle, (thou art) His Word which I-Ie sent down upon Mary. and (thou art) the Spirit from Him; so intercede for us with thy Lord. Don't you see (the trouble) in which we are? Don't you see (the misfortune) that has overtaken us? Jesus (peace be upon him) would say: Verily, my Lord is angry today as He had never been angry before or would ever be angry afterwards. He mentioned no sin of his. (He simply said: ) I am concerned with myself, I am concerned with myself; you go to someone else: better go to Muhammad (ﷺ). They would come to me and say: O Mahammad, thou art the messenger of Allah and the last of the apostles. Allah has pardoned thee all thy previous and later sins. Intercede for us with thy Lord; don't you see in which (trouble) we are? Don't you see what (misfortune) has overtaken us? I shall then set off and come below the Throne and fall down prostrate before my Lord; then Allah would reveal to me and inspire me with some of His Praises and Glorifications which He had not revealed to anyone before me. He would then say: Muhammad, raise thy head; ask and it would be granted; intercede and intercession would be accepted I would then raise my head and say: O my Lord, my people, my people. It would be said: O Muhammad, bring in by the right gate of Paradise those of your people who would have no account to render. They would share with the people some other door besides this door. The Prophet (ﷺ) then said: By Him in Whose Hand is the life of Muhammad, verify the distance between two door leaves of the Paradise is as great as between Mecca and Hajar, or as between Mecca and Busra. \n<b>\n[Al-Bukhari and Muslim] </b></p>",
            "grades": []
        },
        {
            "lang": "ar",
            "chapterNumber": "370",
            "chapterTitle": "باب أحاديث الدجال وأشراط الساعة وغيرها",
            "urn": 1718540,
            "body": "<p>- وعنه قال‏:‏ كنا مع رسول الله صلى الله عليه وسلم في دعوة، فرفع إليه الذراع، وكانت تعجبه، فنهس منها نهسة وقال‏:‏ أنا سيد الناس يوم القيامة، هل تدرون مم ذاك‏؟‏ يجمع الله الأولين والآخرين في صعيد واحد، فيبصرهم الناظر، ويسمعهم الداعي، وتدنوا منهم الشمس، فيبلغ الناس من الغم والكرب ما لا يطيقون ولا يحتملون ، فيقول الناس‏:‏ ألا ترون إلى ما أنتم فيه إلى ما بلغكم، ألا تنظرون من يشفع لكم إلى ربكم‏؟‏ فيقول بعض الناس لبعض‏:‏ أبوكم آدم، ويأتونه فيقولون‏:‏ يا آدم أنت أبو البشر، خلقك الله بيده، ونفخ فيك من روحه، وأمر الملائكة، فسجدوا لك وأسكنك الجنة، ألا تشفع لنا إلى ربك‏؟‏ ألا ترى ما نحن فيه، وما بلغنا‏؟‏ فقال‏:‏ إن ربي غضب غضباً لم يغضب قبله مثله، ولا يغضب بعده مثله، وإنه نهاني عن الشجرة، فعصيت، نفسي نفسي نفسي، اذهبوا إلى غيري، إذهبوا إلى نوح، فيأتون نوحا فيقولون‏:‏ يا نوح ، أنت أول الرسل إلى أهل الأرض، وقد سماك الله عبداً شكوراً، ألا ترى ما نحن فيه، ألا ترى ما بلغنا ألا تشفع لنا إلى ربك‏؟‏ فيقول‏:‏ إن ربي غضب اليوم غضباً لم يغضب قبله مثله، ولن يغضب بعده مثله، وإنه قد كانت لي دعوة دعوت بها على قومي، نفسي نفسي نفسي، اذهبوا إلى غيري، اذهبوا إلى إبراهيم فيأتون إبراهيم فيقولون‏:‏ يا إبراهيم أنت نبي الله وخليله من أهل الأرض اشفع لنا إلى ربك، ألا ترى ما نحن فيه‏؟‏ فيقول لهم‏:‏ إن ربي غضب اليوم غضباً لم يغضب قبله مثله، ولن يغضب بعده مثله، وإني كنت كذبت ثلاث كذبات، نفسي نفسي نفسي، اذهبوا إلى غيري، اذهبوا إلى موسى، فيأتون موسى، فيقولون‏:‏ يا موسى أنت رسول الله فضلك الله برسالاته وبكلامه على الناس، اشفع لنا إلى ربك ألا ترى ما نحن فيه‏؟‏ فيقول‏:‏ إن ربي قد غضب اليوم غضباً لم يغضب قبله مثله، ولن يغضب بعده مثله، وإني قد قتلت نفساً لم أومر بقتلها، نفسي نفسي نفسي، اذهبوا إلى غيري، اذهبوا إلى عيسى، فيأتون عيسى، فيقولون‏:‏ يا عيسى أنت رسول الله وكلمته ألقاها إلى مريم وروح منه ، وكلمت الناس في المهد ‎، اشفع لنا إلى ربك، ألا ترى ما نحن فيه‏؟‏ فيقول عيسى‏:‏ إن ربي غضب اليوم غضباً لم يغضب قبله مثله، ولن يغضب بعده مثله ولم يذكر ذنباً، نفسي نفسي نفسي، اذهبوا إلى غيري، اذهبوا إلى محمد صلى الله عليه وسلم ‏\"‏‏.‏ وفي رواية‏:‏ ‏\"‏فيأتوني فيقولون‏:‏ يا محمد أنت رسول الله وخاتم الأنبياء، وقد غفر لك ما تقدم من ذنبك وما تأخر، اشفع لنا إلى ربك، ألا ترى ما نحن فيه‏؟‏ فأنطلق، فأتي تحت العرش، فأقع ساجداً لربي، ثم يفتح الله علي من محامده، وحسن الثناء عليه شيئاً لم يفتح على أحد قبلي ثم يقال‏:‏ يا محمد ارفع رأسك، سل تعطه، واشفع تشفع، فأرفع رأسي، فأقول أمتي يارب، أمتي يا رب، فيقال‏:‏ يا محمد أدخل من أمتك من لا حساب عليهم من الباب الأيمن من أبواب الجنة وهم شركاء الناس فيما سوى ذلك من الأبواب‏\"‏ ثم قال‏:‏‏\"‏ والذي نفسي بيده إن ما بين المصراعين من مصاريع الجنة كما بين مكة وهجر، أو كما بين مكة وبصرى‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏</p>",
            "grades": []
        }
    ]
}