{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"32.00","hadithNumber":"259","hadith":[{"lang":"en","chapterNumber":"32","chapterTitle":"Superiority of Poor, Weak and unrenowned Muslims","urn":1602560,"body":"<p>Abu Hurairah (May Allah be pleased with him) reported: The Prophet (ﷺ) said, \"None spoke in the cradle but only three (persons), Isa (Jesus) son of Maryam (Mary), the second one was the companion of Juraij who was a pious person. Juraij took a secluded monastery for worship and confined himself in it. His mother came to him as he was busy in prayer and she called: 'Juraij.' He said: 'My Rubb, my mother (is calling me while I am engaged in) my prayer.' He continued with the prayer. She returned and she came on the next day and he was (still) busy in prayer. She called: 'Juraij.' And he said: 'My Rubb, my mother (is calling me while I am engaged) in prayer, and he continued with the prayer,' and she returned. Then on the next day she again came while he was busy in prayer and called: 'Juraij.' And he said: 'My Rubb, my mother (is calling me while I am engaged) in my prayer.' And he continued with the prayer. She said: 'My Rubb, don't let him die until he has seen the faces of the prostitutes.' The story of Juraij and that of his meditation and prayer spread amongst Banu Israel. There was a prostitute who had been a beauty personified. She said (to the people): 'If you like, I can lure him to evil.' She presented herself to him but he paid no heed (to her). She came to a shepherd who lived near the temple and she offered herself to him. He (the shepherd) had sexual intercourse with her and so she became pregnant. When she gave birth to a baby she said: 'This is from Juraij.' So they came and asked Juraij to get down and demolished the temple and began to beat him. He asked them what the matter was. They said: 'You have committed fornication with this prostitute and she has given birth to a baby from you.' He said: 'Where is the baby?' They brought him (the baby) and then he said: 'Just leave me so that I should perform prayer.' He performed prayer and when he finished, he lifted the baby in his stomach and asked him: 'O boy, who is your father?' The baby answered: 'He is such and such a shepherd.' So, the people turned towards Juraij, kissed him and touched him (for seeking blessing) and said: 'We are prepared to construct your temple with gold.' He said, 'No just, rebuild it with mud as it had been,' and so they did\". (The Prophet (ﷺ) continued:) \"Then there was a baby who was sucking at his mother's breast when a person dressed in fine garment came on a priceless riding animal's back. His mother said: 'O Allah, make my child like this one.' He (the babe) left sucking and looked at him, and said: 'O Allah, don't make me like him.' He then returned to the breast and resumed sucking.\" He (Abu Hurairah (May Allah be pleased with him) said: As though I can see Messenger of Allah (ﷺ) as he is illustrating the scene of his sucking milk with his forefinger in his mouth and sucking that. He (Abu Hurairah (May Allah be pleased with him)) further reported Messenger of Allah (ﷺ) as saying, \"There happened to pass by them a slave girl who was being beaten and they were saying: 'You have committed fornication and theft.' She was saying: 'Allah is enough for me and He is my Good Protector, and his mother said: 'O Allah, don't make my child like her.' He left sucking looked at her and said: 'O Allah! Make me like her.' It was followed by a conversation between the mother and the child. She said: 'A good looking man happened to pass by and I said: O Allah, make my child like him, and you said: O Allah, don't make me like him, and there passed a girl while they were beating her and saying: You committed fornication and theft, and I said: O Allah, don't make my child like her, and you said: O Allah, make me like her.' The child said: 'That man was a tyrant, and I said: O Allah don't make me like him; and they were saying about the girl: You committed fornication, whereas in fact she had not committed that and they were saying: You have committed theft, whereas she had not committed theft, so I said: O Allah, make me like her\".<br/><br/><b>[Al- Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"32","chapterTitle":"- باب فضل ضعفة المسلمين والفقراء الخاملين","urn":1702580,"body":"<p>- وعن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ “ لم يتكلم في المهد إلا ثلاثة‏:‏ عيسى ابن مريم، وصاحب جريج، وكان جريج رجلا عابدًا، فاتخذ صومعة فكان فيها، فأتته أمه وهو يصلي فقالت‏:‏ يا جريج، فأتته أمه وهو يصلي فقالت‏:‏ يا جريج، فقال‏:‏ يا رب أمي وصلاتي فأقبل على صلاته فانصرفت‏.‏ فلما كان من الغد أتته وهو يصلي، فقالت‏:‏ يا جريج، فقال‏:‏ أي رب أمي وصلاتي، فأقبل على صلاته، فقالت‏:‏ اللهم لاتمته حتى ينظر إلى وجوه المومسات‏.‏ فتذاكر بنو إسرائيل جريجًا وعبادته، وكانت امرأة بغي يتمثل بحسنها، فقالت‏:‏ إن شئتم لأفتننه، فتعرضت له، فلم يلتفت إليها، فأتت راعيًا كان يأوي إلى صومعته، فأمكنته من نفسها فوقع عليها‏.‏ فحملت، وجعلوا يضربونه، فقال‏:‏ ما شأنكم‏؟‏ قالوا‏:‏ زنيت بهذه البغي فولدت منك‏.‏ قال‏:‏ أين الصبي‏؟‏ فجاءوا به فقال‏:‏ دعوني حتى أصلي، فصلى، فلما انصرف أتى الصبي فطعن في بطنه وقال‏:‏ ياغلام من أبوك‏؟‏ قال‏:‏ فلان الراعي، فأقبلوا على جريج يقبلونه ويتمسحون به وقالوا‏:‏ نبني لك صومعتك من ذهب، قال‏:‏ لا، أعيدوها من طين كما كانت، ففعلوا‏.‏ وبينا صبي يرضع من أمه، فمر رجل راكب على دابة فارهة وشارة حسنة، فقالت‏:‏ “ اللهم اجعل ابني مثل هذا، فترك الثدي وأقبل إليه فنظر إليه فقال‏:‏ اللهم لا تجعلني مثله، ثم أقبل على ثديه فجعل يرتضع‏\"‏ فكأني أنظر إلى رسول الله صلى الله عليه وسلم وهو يحكي ارتضاعه بأصبعه السبابة في فيه، فجعل يمصها، قال‏:‏ ‏\"‏ومروا بجارية وهم يضربونها، ويقولون‏:‏ زنيت سرقت، وهي تقول‏:‏ حسبي الله ونعم الوكيل‏.‏ فقالت أمه‏:‏ اللهم لا تجعل ابني مثلها، فترك الرضاع ونظر إليها فقال‏:‏ اللهم اجعلني مثلها، فهناك تراجعا الحديث فقالت‏:‏ مر رجل حسن الهيئة فقلت‏:‏ اللهم اجعل ابني مثله فقلت‏:‏ اللهم لا تجعلني مثله، ومروا بهذه الأمة وهم يضربونها ويقولون‏:‏ زنيت سرقت، فقلت‏:‏ اللهم لا تجعل ابني مثلها فقلت‏:‏ اللهم اجعلني مثلها‏؟‏‏!‏ قال‏:‏ إن ذلك الرجل كان جبارًا فقلت‏:‏ اللهم لا تجعلني مثله، وإن هذه يقولون لها زنيت، ولم تزن وسرقت، ولم تسرق، فقلت‏:‏ اللهم اجعلني مثلها‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ <a href=\"javascript:opencomment('‏‏‏ ‏والمُومِسات‏ ‏ بضم الميم الأولى، وإسكان الواو وكسر الميم الثانية وبالسين المهملة؛ وهن الزواني‏.‏ والمُومِسة‏:‏ الزانية‏.‏ وقوله‏:‏ ‏ ‏دابة فارهة‏ ‏ بالفاءٍ‏:‏ أي حاذقة نفيسة‏.‏ ‏ ‏والشارة‏ ‏ بالشين المعجمة وتخفيف الراء‏:‏ وهي الجمال الظاهر في الهيئة والملبس‏.‏ ومعنى ‏ ‏ تراجعا الحديث‏ ‏ أي‏:‏ حدثت الصبي وحدثها، والله أعلم‏ ‏')\">(25)</a></p>","grades":[]}]}
