{"collection":"riyadussalihin","bookNumber":"19","chapterId":"371.00","hadithNumber":"1875","hadith":[{"lang":"en","chapterNumber":"371","chapterTitle":"Seeking Forgiveness","urn":1616650,"body":"<p>Shaddad bin Aus (May Allah be pleased with him) said: The Prophet (ﷺ) said, \"The best supplication for seeking forgiveness (Syed-ul- Istighfar) is to say: 'Allahumma Anta Rabbi, la ilaha illa Anta, khalaqtani wa ana 'abduka, wa ana 'ala 'ahdika wa wa'dika mastata'tu, a'udhu bika min sharri ma sana'tu, abu'u laka bini'matika 'alayya, wa abu'u bidhanbi faghfir li, fa innahu la yaghfirudh-dhunuba illa Anta. (O Allah! You are my Rubb. There is no true god except You. You have created me, and I am Your slave, and I hold to Your Covenant as far as I can. I seek refuge in You from the evil of what I have done. I acknowledge the favours that You have bestowed upon me, and I confess my sins. Pardon me, for none but You has the power to pardon).' He who supplicates in these terms during the day with firm belief in it and dies on the same day (before the evening), he will be one of the dwellers of Jannah; and if anyone supplicates in these terms during the night with firm belief in it and dies before the morning, he will be one of the dwellers of Jannah.\"<br/><br/><b>[Al-Bukhari]</b>.</p>","grades":[]},{"lang":"ar","chapterNumber":"371","chapterTitle":"- باب الأمر بالاستغفار وفضله","urn":1718630,"body":"<p>- وعن شداد بن أوس رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏سيد الإستغفار أن يقول العبد ‏:‏ اللهم أنت ربي، لا إله إلا أنت ، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت أبوء لك بنعمتك علي، وأبوء بذنبي، فاغفر لي فإنه لا يغفر الذنوب إلا أنت، من قالها من النهار موقنا بها، فمات من يومه قبل أن يمسي، فهو من أهل الجنة، ومن قالها من الليل وهو موقن بها فمات قبل أن يصبح، فهو من أهل الجنة” ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏ <a href=\"javascript:opencomment('‏‏‏ ‏أبوء‏ ‏ بباء مضمومة ثم واو وهمزة ممدودة، ومعناه‏:‏ أقر وأعترف‏ ‏')\">(1)</a></p>","grades":[]}]}
