{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"16.00","hadithNumber":"160","hadith":[{"lang":"en","chapterNumber":"16","chapterTitle":"Observing the Sunnah and the manners of its obedience","urn":1601590,"body":"<p>Nu'man bin Bashir (May Allah be pleased with them) reported: Messenger of Allah (ﷺ) said, \"Straighten your rows (during Salat) or Allah would create dissension amongst you\".<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/>In another narration reported by Muslim, Nu'man bin Bashir (May Allah be pleased with them) narrated: Messenger of Allah (ﷺ) used to straighten our rows (in Salat), as if he was straightening an arrow with their help until he saw that we had learnt it from him. One day he came out, stood up (for Salat) and was about to say: Allahu Akbar (Allah is the Greatest), (marking the beginning of the prayer) when he saw a man, whose chest was bulging out from the row. He said, \"Slaves of Allah, you must straighten your rows or Allah would create dissension amongst you.\"<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"16","chapterTitle":"- باب الأمر بالمحافظة على السنة وآدابهـا","urn":1701590,"body":"<p>- الخامس‏:‏ عن أبي عبد الله النعمان بن بشير رضي الله عنهما، قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏لتسون صفوفكم أو ليخالفن الله بين وجوهكم ‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏ \nوفي رواية لمسلم‏:‏ كان رسول الله صلى الله عليه وسلم يسوي صفوفنا حتى كأنما يسوي بها القداح ،حتى إذا رأى أنا قد عقلنا عنه ثم خرج يوما، فقام حتى كاد أن يكبر، فرأى رجلاً بادياً صدره فقال‏:‏ ‏\"‏ عباد الله لتسون صفوفكم أو ليخالفن الله بين وجوهكم‏\"‏‏.‏</p>","grades":[]}]}
