{"collection":"riyadussalihin","bookNumber":"8","chapterId":"216.00","hadithNumber":"1210","hadith":[{"lang":"en","chapterNumber":"216","chapterTitle":"The Excellence and Obligation of the Payment of Zakat","urn":1622540,"body":"<p>Abu Hurairah (May Allah be pleased with him) reported: When the Messenger of Allah (ﷺ) passed away, Abu Bakr (May Allah be pleased with him) was appointed as his successor (caliph). Amongst the Arabs some men apostatised. Abu Bakr (May Allah be pleased with him) resolved to fight them. 'Umar bin Al-Khattab (May Allah be pleased with him) said to Abu Bakr: \"How can you fight them when the Messenger of Allah (ﷺ) has declared: 'I have been commanded to fight people till they testify La ilaha illallah (there is no true god except Allah); and if they do it, their blood (life) and property are secured except when justified by law, and it is for Allah to call them to account.\" Upon this Abu Bakr (May Allah be pleased with him) said: \"By Allah, I would definitely fight him who makes distinction between Salat and the Zakat, because it is an obligation upon the rich to pay Zakat. By Allah I will fight them even to secure the piece of rope which they used to give to the Messenger of Allah (ﷺ).\" 'Umar (May Allah be pleased with him) said: \"I realized that Allah opened the heart of Abu Bakr (May Allah be pleased with him) for fighting those who refused to pay Zakat, and I fully recognized that Abu Bakr</p>","grades":[]},{"lang":"ar","chapterNumber":"216","chapterTitle":"- باب تاكيد وجوب الزكاة وبيان فضلها وما يتعلق بها‏:‏","urn":1712000,"body":"<p>- عن أبي هريرة رضي الله عنه، قال‏:‏ لما توفي رسول الله، وكان أبو بكر، رضي الله عنه، وكفر من كفر من العرب، فقال عمر رضي الله عنه‏:‏ كيف يقاتل الناس وقد قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله، فمن قالها، فقد عصم مني ماله ونفسه إلا بحقه وحسابه على الله‏\"‏ ‏؟‏‏!‏ فقال أبو بكر‏:‏ والله لأقاتلن من فرق بين الصلاة والزكاة، فإن الزكاة حق المال‏.‏ والله لو منعوني عقال كانوا يؤدونه إلى رسول الله صلى الله عليه وسلم، لقاتلتهم على منعه، قال‏:‏ عمر رضي الله عنه‏:‏ فوالله ما هو إلا أن رأيت الله قد شرح صدر أبي بكر للقتال، فعرفت أنه الحق‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏</p>","grades":[]}]}
