{"collection":"riyadussalihin","bookNumber":"8","chapterId":"191.00","hadithNumber":"1065","hadith":[{"lang":"en","chapterNumber":"191","chapterTitle":"The Excellence of Performing Salat (Prayers) in Congregation","urn":1621080,"body":"<p>Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"A man's Salat in congregation is twenty-five times more rewarding than his Salat at home or in his shop, and that is because when he performs his Wudu' properly and proceeds towards the mosque with the purpose of performing Salat in congregation, he does not take a step without being raised a degree (in rank) for it and having a sin remitted for it, till he enters the mosque. When he is performing Salat, the angels continue to invoke Blessings of Allah on him as long as he is in his place of worship in a state of Wudu'. They say: 'O Allah! Have mercy on him! O Allah! Forgive him.' He is deemed to be engaged in Salat as long as he waits for it.\"<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"191","chapterTitle":"- باب فضل صلاة الجماعة","urn":1710550,"body":"<p>- وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏صلاة الرجل في جماعة تُضعَّف على صلاته في بيته وفي سوقه خمسًا وعشرين ضعفًا، وذلك أنه إذا توضأ فأحسن الوضوء، ثم خرج إلى المسجد، لا يخرجه إلا الصلاة، لم يخطُ خطوة إلا رفعت له بها درجة، وحطت عنه بها خطيئة، فإذا صلى لم تزل الملائكة تصلي عليه ما دام في مصلاه، ما لم يحدث، تقول اللهم صلِّ عليه، اللهم ارحمه‏.‏ ولا يزال في صلاة ما انتظر الصلاة‏\"‏ ‏(‏‏(‏متفق عليه‏.‏ وهذا لفظ البخاري‏)‏‏)‏</p>","grades":[]}]}
