{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"5.00","hadithNumber":"65","hadith":[{"lang":"en","chapterNumber":"5","chapterTitle":"Watchfulness","urn":1600650,"body":"<p>Abu Hurairah (May Allah be pleased with him) said that: He heard the Prophet (ﷺ) said: \"There were three men among the Banu Israel, one leper, one bald and one blind. Allah wanted to test them. He therefore, sent to them an angel who came to the leper and asked him what he would like best. He replied: \"A good colour, a good skin and to be rid of what makes me loathsome to people\". He (the angel) rubbed him and his loathsomeness vanished and he was given a good colour and a good skin. He then asked him what type of property he would like best. The leper replied that he would like camels - <b>[or perhaps he said cattle, for Ishaq (one of the subnarrator of the Hadith) was uncertain, either said: 'Camels,' or: 'Cattle']</b>. He was given a pregnant she-camel. The angel invoked for Allah's Blessing on it. The angel then went to the bald man and asked him what he would like best and he replied: \"Good hair and to be rid of what makes me loathsome to people\". The angel ran his hand over him and he was given good hair. He then asked him what property he would like best. He replied that he would like cattle, so he was given a pregnant cow. The angel invoked Allah's Blessing on it. The angel then went to the blind man and asked him what he would like best, and he replied: \"I wish that Allah restore my sight to me so that I may see people.\" Thereupon the angel ran his hand over him and Allah restored his sight. The angel then asked what property he would like best. He replied that he would like sheep, so he was given a pregnant ewe. Flocks and herds were produced for the three men, the first having a valley full of camels, the second one, a valley full of cows and the third one full of sheep. Then the angel came in the form of a leper, to the one who had been a leper, and said: \"I am a poor man and my resources have been exhausted in my journey, and my only means of reaching my destination are dependent on Allah and then on you, so I ask you by Him Who gave you the good colour, the good skin and the property, for a camel by which I may get to my destination\". He replied: \"I have many dues to pay.\" The angel then said: \"I think I recognize you. Were you not a leper whom people found loathsome and a poor man to whom Allah gave property?\" He replied: \"I inherited this property through generations\". The angel said: \"If you are telling a lie, may Allah return you to your former condition\". The angel went in the form of a bald man to the one who had been bald, and said the same as he had said to the former and received a similar reply. So he said: \"If you are telling a lie, may Allah return you to your former condition\". The angel then went to the one who had been blind and said: \"I am a poor traveller and my resources have been exhausted in my journey. My only means of reaching my destination are dependant on Allah and then on you, so I ask you by Him Who restored your eyesight for a sheep by which I may get to the end of my journey\". He replied: \"Yes, I was blind. Allah restored my eyesight, so take what you wish and leave what you wish. I swear by Allah that I shall not argue with you today to return anything you take, as I give it for Allah's sake\". The angel said: \"Keep your property. You have all simply been put to a test, and Allah is pleased with you and displeased with both of your companions\".<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"5","chapterTitle":"- باب المراقبة","urn":1700650,"body":"<p>- السادس ‏:‏ عن أبي هريرة رضي الله عنه أنه سمع النبي صلى الله عليه وسلم يقول‏:‏ ‏\"‏ إن ثلاثة من بنى إسرائيل ‏:‏ أبرص ، وأقرع، وأعمى، أراد الله أن يبتليهم فبعث إليهم ملكاً، فأتى الأبرص فقال‏:‏ أي شيء أحب إليك‏؟‏ قال ‏:‏ لون حسن، وجلد حسن ، ويذهب عني الذى قد قذرني الناس؛ فمسحه فذهب عنه قذره وأعطي لونا حسناً‏.‏ قال‏:‏ فأي المال أحب إليك‏؟‏ قال‏:‏ الإبل-أو قال البقر-شك الرواي- فأعطي ناقة عشراء، فقال‏:‏ بارك الله لك فيها‏.‏ \nفأتى الأقرع فقال‏:‏ أي شيء أحب إليك‏؟‏ قال‏:‏ شعر حسن، ويذهب عني هذا الذى قذرني الناس ، فمسحه فذهب عنه وأعطي شعراً حسناً‏.‏ قال‏:‏ فأي المال أحب إليك‏؟‏ قال‏:‏ البقر، فأعطي بقرة حاملاً،وقال بارك الله لك فيها‏.‏\nفأتي الأعمى فقال‏:‏ أي شيء أحب إليك‏؟‏ قال‏:‏ أن يرد الله إلي بصري فأبصر الناس، فمسحه فرد الله إليه بصره‏.‏ قال‏:‏ فأي المال أحب إليك‏؟‏ قال‏:‏ الغنم، فأعطي شاة والداً‏.‏ فأنتج هذان وولد هذا، فكان لهذا واد من الإبل، ولهذا واد من البقر، ولهذا واد من الغنم‏.‏\nثم إنه أتى الأبرص في صورته وهيئته، فقال له‏:‏ رجل مسكين وابن سبيل قد انقطعت بي الحبال في سفري، فلا بلاغ لي اليوم إلا بالله ثم بك، أسألك بالذي أعطاك اللون الحسن، والجلد الحسن، والمال، بعيراً أتبلغ به في سفري، فقال‏:‏ الحقوق كثيرة‏.‏ فقال ‏:‏ كأني أعرفك، ألم تكن أبرص يقذرك الناس فقيراً، فأعطاك الله ‏؟‏‏!‏ فقال ‏:‏ إنما ورثت هذا المال كابراً عن كابر، فقال‏:‏ إن كنت كاذباً فصيرك الله إلى ما كنت‏.‏\nوأتى الأقرع، فقال له مثل ما قال لهذا، ورد عليه مثل ما ردّ هذا، فقال إن كنت كاذبا فصيرك الله إلى ما كنت ‏.‏\nوأتى الأعمى في صورته وهيئته، فقال‏:‏ رجل مسكين وابن سبيل انقطعت بي الحبال في سفري، فلا بلاغ لي اليوم إلا بالله ثم بك، أسألك بالذي رد عليك بصرك شاة أتبلغ بها في سفري‏؟‏ فقال‏:‏ قد كنت أعمى فرد الله بصري، فخذ ما شئت ودع ما شئت، فوالله ما أجهدك اليوم بشيء أخذته لله عز وجل فقال‏:‏ أمسك عليك مالك فإنما ابتليتم، فقد رضي الله عنك، وسخط على صاحبيك‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏</p>","grades":[]}]}
