{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"14.00","hadithNumber":"150","hadith":[{"lang":"en","chapterNumber":"14","chapterTitle":"Moderation in Worship","urn":1601490,"body":"<p>'Abdullah bin 'Amr bin Al-'as (May Allah be pleased with them) reported: The Prophet (ﷺ) was informed that I said that I would perform prayers the whole night and observe fasting every day as long as I live. Messenger of Allah (ﷺ) said, \"Is it you who said this?\" I said to him, \"O Messenger of Allah! I ransom you with my parents, it is I who said that.\" Messenger of Allah (ﷺ) said, \"You will not be able to do that. Observe fast and break it; sleep and get up for prayer, and observe fast for three days during the month; for every good is multiplied ten times and that will be equal to fasting the whole year.\" I said, \"O Messenger of Allah! I can do more than that.\" He said, \"Observe fast one day and leave off the next two days.\" I said, \"O Messenger of Allah! I have strength to do more than that.\" Messenger of Allah (ﷺ) said, \"Observe fast every other day, and that is the fasting of Dawud (ﷺ) and that is the most moderate fasting\".<br/><br/>According to another narration: Messenger of Allah (ﷺ) said, \"That is the best fasting.\" I said, \"But I am capable of doing more than this\". Thereupon, Messenger of Allah (ﷺ) said, \"There is nothing better than this.\" 'Abdullah bin 'Amr (May Allah be pleased with them) said (when he grew old): \"Had I accepted the three days (fasting during every month) as the Messenger of Allah (ﷺ) had said, it would have been dearer to me than my family and my property\".<br/><br/>In another narration 'Abdullah is reported to have said: Messenger of Allah (ﷺ) said to me, \"O 'Abdullah! Have I not been informed that you observe fast during the day and offer prayer all the night.\" I replied, \"Yes, O Messenger of Allah!\" Messenger of Allah (ﷺ) said, \"Don't do that. Observe fast for few days and then leave off for few days, perform prayers and also sleep at night, as your body has a right upon you, and your eyes have a right upon you; and your wife has a right upon you; your visitors have a right upon you. It is sufficient for you to observe fast three days in a month, as the reward of good deeds is multiplied ten times, so it will be like fasting the whole year.\" I insisted (on fasting) and so I was given a hard instruction. I said, \"O Messenger of Allah! I have strength.\" Messenger of Allah (ﷺ) said, \"Observe fast like the fasting of Prophet Dawud (ﷺ); and do not fast more than that.\" I said: \"How was the fasting of Prophet Dawud?\" He (ﷺ) said, \"Half of the year (i.e., he used to fast on every alternate day).\"<br/><br/>Afterwards when 'Abdullah (May Allah be pleased with him) grew old, he used to say: \"Would that I had availed myself of the concession granted to me by Messenger of Allah.\"<br/><br/>In another narration 'Abdullah is reported to have said: Messenger of Allah (ﷺ) said, \"I have been informed that you observe fast continuously and recite (the whole of the Qur'an) every night.\" I said, \"Messenger of Allah! It is right, but I covet thereby nothing but good,\" whereupon he (ﷺ) said, \"Then observe fasts like the fasting of Prophet Dawud (ﷺ) as he was the most ardent worshipper of Allah; recite the Qur'an once every month.\" I said, \"O Prophet of Allah! I am capable of doing more than that.\" He said, \"Then recite it (the complete Qur'an) in every twenty days.\" I said, \"O Prophet of Allah I am capable of reciting more than that.\" He said, \"Then recite it once in every ten days.\" I said, \"O Prophet of Allah! I am capable of reciting more than that.\" He said, \"Then recite it once in every seven days, but not recite more than that.\" The Prophet (ﷺ) of Allah also said to me, \"You do not know, you may have a longer life\". When I grew old I wished I had availed myself of the concession (granted to me by) the Prophet (ﷺ) of Allah.<br/><br/>In another narration 'Abdullah is reported to have said: Messenger of Allah (ﷺ) said, \"The best fasting with Allah is that of (Prophet) Dawud, and the best prayer with Allah is that of Dawud (ﷺ) for he would sleep half of the night and stand for prayer for the third of it and (then) would sleep sixth part of it; he observed fast one day and leave off the other. He would not flee on meeting the enemy\".<br/><br/>In another narration 'Abdullah is reported to have said: My father helped me marry a noble woman and he used to inquire of his daughter-in-law regarding her husband. She would say: \"He is, indeed, a fine man. Since I have come to him, he has neither stepped on my bed nor he has had sexual intercourse with me\". When this state of affairs lasted for some time, my father mentioned the matter to Messenger of Allah (ﷺ) who directed my father saying, \"Send him to me\". I went to him accordingly. He asked me, \"How often do you observe fast?\" I replied; \"Daily\". He asked me, \"How long do you take in reading the Noble Qur'an completely.\" I said, \"Once every night\". Then he narrated the whole story. He (in his old age) would recite one seventh of his nightly recitation to some members of his family during the day to lighten his task at night. Whenever he wished to have a relief from his fast on alternate days, he would give up fasting for a few days and make up deficiency later by observing the number of fasts he had missed. He would not give up the number of fasts altogether because he did not like to abandon what he had settled with Messenger of Allah (ﷺ).<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"14","chapterTitle":"- باب في الاقتصاد في العبادة","urn":1701490,"body":"<p>- وعن أبي محمد عبد الله بن عمرو بن العاص رضي الله عنهما قال‏:‏ أخبر النبي صلى الله عليه وسلم أني أقول‏:‏ والله لأصومن النهار، ولأقومن الليل ماعشت، فقال رسول الله صلى الله عليه وسلم ‏:‏ أنت الذي تقول ذلك‏؟‏ فقلت له‏:‏ قد قلته بأبى أنت وأمى يا رسول الله‏.‏ قال‏:‏‏\"‏فإنك لا تستطيع ذلك؛ فصم وأفطر، ونم وقم، وصم من الشهر ثلاثة أيام فإن الحسنة بعشر أمثالها، وذلك مثل صيام الدهر‏\"‏ قلت‏:‏ فإنى أطيق أفضل من ذلك قال‏:‏ فصم يوما وأفطر يومين، قلت‏:‏ فإنى أطيق أفضل من ذلك، قال‏:‏ ‏\"‏فصم يوماً وأفطر يوماً، فذلك صيام داود صلى الله عليه وسلم، وهو أعدل الصيام‏\"‏‏.‏ وفي رواية‏:‏ ‏\"‏وهو أفضل الصيام‏\"‏ فقلت ‏:‏ فإني أطيق أفضل من ذلك‏.‏ فقال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏ لا أفضل من ذلك‏\"‏ ولأن أكون قبلت الثلاثة الأيام التي قال رسول الله صلى الله عليه وسلم أحب إلي من أهلي وما لي‏.‏ وفي رواية‏:‏ ‏\"‏ألم أخبر أنك تصوم النهار وتقوم الليل‏؟‏‏\"‏ قلت ‏:‏ بلى يا رسول الله قال‏:‏ ‏\"‏فلا تفعل‏:‏ صم وأفطر ، ونم وقم فإن لجسدك عليك حقاً، وإن لعينيك عليك حقاً، وإن لزوجك عليك حقاً، وإن لزورك عليك حقاً، وإن بحسبك أن تصوم في كل شهر ثلاثة أيام ، فإن لك بكل حسنة عشر أمثالها، فإن ذلك صيام الدهر‏\"‏ فشددت فشدد علي، قلت‏:‏ يا رسول الله إني أجد قوة، قال‏:‏ ‏\"‏صم صيام نبي الله داود ولا تزد عليه‏\"‏ قلت‏:‏ وما كان صيام داود‏؟‏ قال‏:‏ ‏\"‏نصف الدهر‏\"‏ فكان عبد الله يقول بعدما كبر‏:‏ يا ليتني قبلت رخصة رسول الله صلى الله عليه وسلم‏.‏ وفي رواية‏:‏ ‏\"‏ ألم أخبر أنك تصوم الدهر، وتقرأ القرآن كل ليلةٍ‏؟‏‍‍‍‍‍‍‏\"‏ فقلت‏:‏ بلى يا رسول الله، ولم أرد بذلك إلا الخير قال‏:‏ ‏\"‏فصم صوم نبي الله داود، فإنه كان أعبد الناس، واقرأِ القرآن كل شهرٍ‏\"‏ قلت‏:‏ يا نبي الله إني أطيق أفضل من ذلك‏؟‏ قال‏:‏ ‏\"‏فاقرأه في كل عشرين‏\"‏ قلت‏:‏ يا نبي الله إني أطيق أفضل من ذلك‏؟‏ قال‏:‏ ‏\"‏فاقرأه في كل عشر‏\"‏ قلت يا نبي الله إني أطيق أفضل من ذلك‏؟‏ قال‏:‏ ‏\"‏فاقرأه في كل سبع ولا تزد على ذلك‏\"‏‏.‏ فشددت فشدد علي ، وقال لي النبي صلى الله عليه وسلم‏:‏ ‏\"‏إنك لا تدري لعلك يطول بك عمر‏\"‏ قال‏:‏ فصرت إلى الذي قال لي النبي صلى الله عليه وسلم، فلما كبرت وددت أني كنت قبلت رخصة نبي الله صلى الله عليه وسلم‏.‏ وفي رواية‏:‏ ‏\"‏ وإن لولدك عليك حقاً‏\"‏ وفي رواية‏:‏ ‏\"‏ لا صام من صام الأبد‏\"‏ ثلاثاً‏.‏ وفي رواية‏:‏ ‏\"‏أحب الصيام إلى الله تعالى صيام داود، وأحب الصلاة إلى الله تعالى صلاة داود‏:‏ كان ينام نصف الليل، ويقوم ثلثه، وينام سدسه، وكان يصوم يوما ويفطر يوماً، ولا يفر إذا لاقى‏\"‏‏.‏ وفي رواية‏:‏ أنكحني أبي امرأة ذات حسب، وكان يتعاهد كنته-أي ‏:‏ امرأة ولده- فيسألها عن بعلها، فتقول له ‏:‏ نعم الرجل من رجل لم ييطأ لنا فراشاً ولم يفتش لنا كنفاً منذ أتيناه‏.‏ فلما طال ذلك عليه ذكر ذلك للنبي صلى الله عليه وسلم‏.‏ فقال‏:‏ ‏\"‏القنى به‏\"‏ فلقيته بعد ذلك فقال‏:‏ ‏\"‏كيف تصوم‏؟‏‏\"‏ قلت كل يوم، قال‏:‏ ‏\"‏وكيف تختم‏؟‏‏\"‏ قلت‏:‏ كل ليلةٍ، وذكر نحون ما سبق ، وكان يقرأ على بعض أهله السبع الذي يقرؤه، يعرضه من النهار ليكون أخف عليه بالليل، وإذا أراد أن يتقوى أفطر أياماً وأحصى وصام مثلهن كراهية أن يترك شيئاً فارق عليه النبي صلى الله عليه وسلم‏.‏ كل هذه الروايات صحيحة معظمها في الصحيحين وقليل منها في أحدهما‏.‏ ‏.‏</p>","grades":[]}]}
