{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"26.00","hadithNumber":"217","hadith":[{"lang":"en","chapterNumber":"26","chapterTitle":"Unlawfulness of Oppression and Restoring Others Rights","urn":1602140,"body":"<p>Abu Qatadah Al-Harith bin Rib'i (May Allah bepleased with him) reported: Messenger of Allah (ﷺ) said, \"Faith in Allah and striving in His Cause (Jihad) are the deeds of highest merit.\" A man stood up said: \"O Messenger of Allah! Tell me if I am killed in the Cause of Allah, will all my sins be forgiven?\" He (ﷺ) replied, \"Yes, if you are killed in the Cause of Allah while you are patient, hopeful of your reward and marching forward not retreating.\" Then the Prophet (ﷺ) said to him, \"Repeat what you have said.\" The man said: \"Tell me if I am killed in the Cause of Allah, will all my sins be remitted?\". He replied, \"Yes, if you are martyred while you are patient, hopeful of your reward and march forward without retreating, unless, if you owe any debt, that will not be remitted. Angel Jibril told me that\".<br/><br/><b>[Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"26","chapterTitle":"- باب تحريم الظلم والأمر برد المظالم","urn":1702160,"body":"<p>- وعن أبي قتادة الحارث بن ربعي رضي الله عنه عن رسول الله صلى الله عليه وسلم أنه قام فيهم ، فذكر لهم أن الجهاد في سبيل الله، والإيمان بالله أفضل الأعمال، فقام رجل فقال‏:‏ يا رسول الله أرأيت إن قتلت في سبيل الله، تكفر عني خطاياي‏؟‏ فقال له رسول الله صلى الله عليه وسلم‏:‏ “نعم إن قتلت في سبيل الله وأنت صابر محتسب، مقبل غير مدبر” ثم قال رسول الله صلى الله عليه وسلم‏:‏ “كيف قلت‏؟‏” قال‏:‏ أرأيت إن قتلت في سبيل الله، أتكفر عني خطاياي‏؟‏ فقال رسول الله صلى الله عليه وسلم‏:‏ “نعم وأنت صابر محتسب، مقبل غير مدبر، إلا الدين فإن جبريل قال لي ذلك” ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏</p>","grades":[]}]}
