{"collection":"riyadussalihin","bookNumber":"15","chapterId":"247.00","hadithNumber":"1447","hadith":[{"lang":"en","chapterNumber":"247","chapterTitle":"The Excellence of Gathering in which Allah is Remembered","urn":1613130,"body":"<p>Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"Allah, the Exalted, has teams of angels who go about on the roads seeking those who remember Allah. When they find some people remembering Allah they call to one another and say, 'Come to what you are looking for;' and they surround them with their wings till the space between them and the lowest sky is fully covered. Allah, the Exalted and Glorious, asks them (although He is best informed about every thing): 'What are my slave saying?' They say: 'They are glorifying Your Tasbih, Tahmid, Takbir, Tamjid, (i.e., they were declaring Your Perfectness, praising, remembering the Greatness and Majesty of Allah).' He asks: 'Have they seen Me?' They reply, 'No, indeed, they have not seen You.' He asks: 'How would they act if they were to see Me?' Thereupon they reply: 'If they were to see You, they would engage more earnestly in worshipping and glorifying You and would extol You more.' He would say: 'What do they beg of Me?' They say, 'They beg You for Your Jannah.' Allah says, 'Have they seen My Jannah?' They say, 'No, our Rubb.' He says: 'How would they act if they were to see My Jannah?' They reply, 'Were they to see it, they would more intensely eager for it.' They (the angels) say, 'They seek Your Protection.' He asks, 'Against what do they seek My Protection?' They (the angels) say, 'Our Rubb, from the fire of Hell.' (He, the Rubb) says, 'Have they seen the fire of Hell?' They say, 'No. By Your Honour, they have not seen it.' He says: 'How would they act if they were to see My Fire?' They say: 'If they were to see it, they would more earnest in being away from it and fearing it. They beg of Your forgiveness.' He says: 'I call you to witness that I hereby grant pardon to them and confer upon them what they ask for; and grant them protection against what they seek protection from.' One of the angels says: 'Our Rubb, there is amongst them such and such slave who does not belong to the assembly of those who are participating in Your remembrance. He passed by them and sat down with them.' He says: 'I also grant him pardon because they are the people by virtue of whom their associates will not be unfortunate'.\"<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/>(The narration in Muslim is also the same with minor changes in wordings).<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"247","chapterTitle":"- باب فضل حلق الذكر والندب إلى ملازمتها والنهي عن مفارقتها لغير عذر","urn":1714370,"body":"<p>- وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏\"‏إن لله تعالى ملائكة يطوفون في الطرق يلتمسون أهل الذكر، فإذا وجدوا قومًا يذكرون الله عز وجل، تنادوا‏:‏ هلموا إلى حاجتكم، فيحفونهم بأجنحتهم إلى السماء الدنيا، فيسألهم ربهم - وهو أعلم‏:‏ ما يقول عبادي‏؟‏ قال‏:‏ يقولون‏:‏ يسبحونك، ويكبرونك، ويحمدونك، ويمجدونك، فيقول‏:‏ هل رأوني‏؟‏ فيقولون‏:‏ لا لا والله ما رأوك، فيقول‏:‏ كيف لو رأوني‏؟‏‏!‏ قال‏:‏ يقولون‏:‏ لو رأوك كانوا أشد لك عبادة، وأشد لك تمجيدًا، وأكثر لك تسبيحًا فيقول‏:‏ فماذا يسألون‏؟‏ قال‏:‏ يقولون‏:‏ يسألونك الجنة‏.‏ قال‏:‏ يقول‏:‏ وهل رأوها‏؟‏ قال‏:‏ يقولون‏:‏ لا والله يا رب ما رأوها‏.‏ قال‏:‏ يقول‏:‏ فكيف لو رأوها‏؟‏‏!‏ قال‏:‏ يقولون‏:‏ لو أنهم رأوها كانوا أشد عليها حرصًا، وأشد لها طلبًا، وأعظم فيها رغبة‏.‏ قال‏:‏ فمم يتعوذون‏؟‏ قال يقولون‏:‏ يتعوذون من النار، قال‏:‏ فيقول‏:‏ وهل رأوها‏؟‏ قال‏:‏ يقولون‏:‏ ولا والله ما رأوها‏.‏ فيقول‏:‏ كيف لو رأوها‏؟‏‏!‏ قال‏:‏ يقولون‏:‏ لو رأوها كانوا أشد فرارًا، وأشد لها مخافة‏.‏ قال‏:‏ يقول‏:‏ فأشهدكم أني قد غفرت لهم، قال‏:‏ يقول ملك من الملائكة‏:‏ فيهم فلان ليس منهم، إنما جاء لحاجة، قال‏:‏ هم الجلساء لا يشقى بهم جليسهم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ \nوفي رواية لمسلم عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏إن لله ملائكة سيارة فضلا يتتبعون مجالس الذكر، فإذا وجدوا مجلسًا فيه ذكر، قعدوا معهم، وحف بعضهم بعضًا بأجنحتهم حتى يملئوا ما بينهم وما بين السماء الدنيا، فإذا تفرقوا عرجوا وصعدوا إلى السماء، فيسألهم الله عز وجل - وهو أعلم‏:‏ من أين جئتم‏؟‏ فيقولون‏:‏ جئنا من عند عباد لك في الأرض‏:‏ يسبحونك، ويكبرونك، ويهللونك، ويحمدونك، ويسألونك‏.‏ قال‏:‏ وماذا يسألوني‏؟‏ قالوا‏:‏ يسألونك جنتك‏.‏ قال‏:‏ وهل رأوا جنتي‏؟‏ قالوا‏:‏ لا، أي رب‏.‏ قال‏:‏ فكيف لو رأوا جنتي‏؟‏‏!‏ قالوا‏:‏ ويستجيرونك‏.‏ قال‏:‏ ومم يستجيروني‏؟‏ قالوا‏:‏ من نارك يا رب‏.‏ قال‏:‏ وهل رأوا ناري‏؟‏ قالوا‏:‏ لا، قال‏:‏ فكيف لو رأوا ناري‏؟‏ قالوا‏:‏ ويستغفرونك، فيقول‏:‏ قد غفرت لهم، وأعطيتهم ما سألوا، وأجرتهم ما استجاروا‏.‏ قال‏:‏ فيقولون‏:‏ رب فيهم فلان عبد خطاء إنما مر، فجلس معهم، فيقول‏:‏ وله غفرت، هم القوم لا يشقى بهم جليسهم‏\"‏‏.‏</p>","grades":[]}]}
