{"collection":"riyadussalihin","bookNumber":"18","chapterId":"370.00","hadithNumber":"1810","hadith":[{"lang":"en","chapterNumber":"370","chapterTitle":"Ahadith about Dajjal and Portents of the Hour","urn":1616000,"body":"<p>'Abdullah bin 'Amr bin Al-'As (May Allah be pleased with them) said: The Messenger of Allah (ﷺ) said, \"Dajjal (the Antichrist) will appear in my Ummah and he will stay in the world for forty. I do not know whether this will be forty days or forty months or forty years. Allah will then send (Prophet) 'Isa (Jesus), son of Maryam (Mary). 'Isa will pursue him and slaughter him. Then people will survive for seven years (i.e., after the demise of 'Isa) in the state that there will be no rancour between two persons. Then Allah will send a cool breeze from the side of Ash-Sham. None will remain upon the face of the earth having the smallest particle of good or Faith in him but he will die, so much so that even if someone amongst you will enter the innermost part of a mountain, this breeze will reach that place also and will cause him to die. Only the wicked people will survive and they will be as fast as birds (i.e., to commit evil) and as ferocious towards one another as wild beasts. They will never appreciate the good, nor condemn evil. Then Shaitan (Satan) will come to them in the garb of a man and will say: 'Will you not obey me?' They will say: 'What do you order us to do?' He will command them to worship idols. They will have abundance of sustenance and will lead comfortable lives. Then the Trumpet will be blown. Every one hearing it, will turn his neck towards it and will raise it. The first one to hear that Trumpet will be a man who will be busy repairing the basin for his camels. He will become unconscious. Allah will send, or will cause to send, rain which will be like dew and there will grow out of it (like wild growth) the bodies of the people. Then the second Trumpet will be blown and they will stand up and begin to look around. Then it will be said: 'O people! Go to your Rubb.' Then there will be a command: 'Make them stand there.' After it they will be called to account. Then it will be said: 'Separate from them the share of the Fire.' It will be asked: 'How much?' It will be said: 'Nine hundred and ninety-nine out of every thousand.' That will be the Day which will make children hoary-headed men because of its terror and that will be the Day when the Shin will be uncovered.\"<br/><br/><b>[Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"370","chapterTitle":"باب أحاديث الدجال وأشراط الساعة وغيرها","urn":1717990,"body":"<p>- وعن عبد الله بن عمرو بن العاص رضي الله عنهما قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏يخرج الدجال في أمتى فيمكث أربعين لا أدري يوماً أو أربعين شهراً، أو أربعين عاماً، فيبعث الله تعالى عيسى بن مريم‏.‏ صلى الله عليه وسلم ، فيطلبه فيهلكه، ثم يمكث الناس سبع سنين ليس بين اثنين عداوة، ثم يرسل الله عز وجل،ريحاً باردة من قبل الشام، فلا يبقى على وجه الأرض أحد في قلبه مثقال ذرة من خير أو إيمان إلا قبضته، حتى لو أن أحدكم دخل في كبد جبل، لدخلته عليه حتى تقبضه، فيبقى شرار الناس في خفة الطير، وأحلام السباع لا يعرفون معروفاً ، ولا ينكرون منكراً، فيتمثل لهم الشيطان، فيقول‏:‏ ألا تستجيبون‏؟‏ فيقولون ‏:‏ فما تأمرنا‏؟‏ فيأمرهم بعبادة الأوثان، وهم في ذلك دار رزقهم، حسن عيشهم ، ثم ينفخ في الصور، فلا يسمعه أحد إلا أصغى ليتا ورفع ليتا، وأول من يسمعه رجل يلوط حوض إبله فيصعق ويصعق الناس، ثم يرسل الله -أو قال‏:‏ ينزل الله - مطرا كأنه الطل أو الظل، فتنبت منه أجساد الناس، ثم ينفخ فيه أخرى فإذا هم قيام ينظرون ، ثم يقال‏:‏ يا أيها الناس هلم إلى ربكم ، وقفوهم إنهم مسؤولون ‎، ثم يقال‏:‏ أخرجوا بعث النار فيقال‏:‏ من كم‏؟‏ فيقال‏:‏ من كل ألف تسعمائة وتسعة وتسعين، فذلك يوم يجعل الولدان شيباً، وذلك يوم يكشف عن ساق‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ «الليت» : صفحة العنق. ومعناه يضع صفحة عنقه ويرفع صفحته الأخرى.</p>","grades":[]}]}
