{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"64.00","hadithNumber":"572","hadith":[{"lang":"en","chapterNumber":"64","chapterTitle":"Excellence of a Grateful Rich Man","urn":1605680,"body":"<p>Abu Hurairah (May Allah be pleased with him) reported: Some of the poor Emigrants came to Messenger of Allah (ﷺ) and said to him, \"The wealthy have obtained all high ranks and everlasting bliss.\" He asked, \"How is that?\" They replied: \"They offer Salaah as we do, and observe Saum (fasting) as we do, but they give in Sadaqah (charity) and we do not, and they emancipate slaves and we cannot.\" He (ﷺ) said, \"Shall I not teach you something whereby you will catch up with those who have preceded you and will get ahead of those who follow you, and no one will surpass you unless he does the same as you do?\" They said, \"Surely, O Messenger of Allah.\" He said, \"Say: Subhan Allah, and Allahu Akbar, and praise Him (by saying Al-hamdu lillah) thirty-three times at the end of every Salaah.\" They returned to him and said: \"Our brothers, the possessors of wealth, having heard what we are doing, have started doing the same.\" Messenger of Allah (ﷺ) said, \"This is Grace of Allah which He gives to whom He wishes.\"<br/><br/><b>[Al- Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"64","chapterTitle":"- باب فضل الغني الشاكر وهو من أخذ المال من وجهه وصرفه فى وجوهه المأمور بها","urn":1705680,"body":"<p>- وعن أبي هريرة رضي الله عنه أن فقراء المهاجرين أتوا رسول الله صلى الله عليه وسلم فقالوا‏:‏ ‏\"‏ذهب أهل الدثور بالدرجات العلى والنعيم المقيم، فقال‏:‏ ‏\"‏وما ذاك‏؟‏” فقالو”‏:‏يصلون كما نصلى، ويصومون كما نصوم ويتصدقون ولانتصدق، ويعتقون ولا نعتق فقال‏:‏ رسول الله صلى الله عليه وسلم ‏:‏” أفلا أعلمكم شيئا تدركون به من سبقكم، وتسبقون به من بعدكم ، ولا يكون أحد أفضل منكم إلا من صنع مثل ما صنعتم‏؟‏” قالوا‏:‏ بلى يا رسول الله ، قال‏:‏ تسبحون ، وتكبرون، وتحمدون ، دبر كل صلاة ثلاثاً وثلاثين مرة” فرجع فقراء المهاجرين إلى رسول الله صلى الله عليه وسلم ، فقالو‏:‏ سمع إخواننا أهل الأموال بما فعلنا، ففعلوا مثله‏؟‏ فقال رسول الله صلى الله عليه وسلم “ذلك فضل الله يؤتيه من يشاء” ‏(‏‏(‏متفق عليه‏)‏‏)‏ ، وهذا لفظ ‏رواية مسلم‏.‏</p>","grades":[]}]}
