{
    "collection": "riyadussalihin",
    "bookNumber": "17",
    "chapterId": "264.00",
    "hadithNumber": "1558",
    "hadith": [
        {
            "lang": "en",
            "chapterNumber": "264",
            "chapterTitle": "Prohibition of Cursing one Particular Man or Animal",
            "urn": 1623590,
            "body": "<p>Abu Barzah Nadlah bin 'Ubaid Al-Aslami (May Allah be pleased with him) said: A young woman was riding a she-camel on which there was the luggage of people. Suddenly she saw the Prophet (ﷺ). The pass of the mountain became narrow for her people (because of fear). The young woman said to the she-camel: \"Go ahead.\" When it did not move, she said, \"O Allah! Curse it.\" The Prophet (ﷺ) said, \"The she-camel that has been cursed should not accompany us.\"<br/><br/><b>[Muslim]</b>.<br/><br/></p>",
            "grades": []
        },
        {
            "lang": "ar",
            "chapterNumber": "264",
            "chapterTitle": "- باب تحريم لعن إنسان بعينه أو دابة",
            "urn": 1715480,
            "body": "<p>- وعن أبي برزة نضلة بن عبيد الأسلمي رضي الله عنه قال بينما جارية على ناقة عليها بعض متاع القوم، إذ بصرت بالنبي صلى الله عليه وسلم، وتضايق بهم الجبل، فقالت‏:‏ حل، اللهم العنها‏.‏ فقال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏لا تصاحبنا ناقة عليها لعنة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏. ‏قوله: حل بفتح الحاء المهملة، وإسكان اللام وهي كلمة لزجر الإبل واعلم أن هذا الحديث قد يستشكل معناه ولا إشكال فيه بل المراد النهي أن تصاحبهم تلك الناقة وليس فيه نهي عن بيعها وذبحها وركوبها في غير صحبة النبي صلى الله عليه وسلم بل كل ذلك وما سواه من التصرفات جائز لا منع منه إلا من مصاحبته صلى الله عليه وسلم بها لأن هذه التصرفات كلها كانت جائزة فمنع بعض منها فبقي الباقي على ما كان والله أعلم</p>",
            "grades": []
        }
    ]
}