{"collection":"riyadussalihin","bookNumber":"18","chapterId":"370.00","hadithNumber":"1809","hadith":[{"lang":"en","chapterNumber":"370","chapterTitle":"Ahadith about Dajjal and Portents of the Hour","urn":1615990,"body":"<p>Rib'i bin Hirash (May Allah be pleased with him) said: I accompanied Abu Mas'ud Al-Ansari to Hudaifah bin Al-Yaman (May Allah be pleased with them). Abu Mas'ud said to him: \"Tell us what you heard from the Messenger of Allah (ﷺ) about Dajjal (the Antichrist).\" Hudaifah said: He (ﷺ) said, \"Dajjal will appear, and with him will be water and fire. That which people consider to be water will in fact be a burning fire, and that which people will consider to be fire will in fact be cool and sweet water. He who from amongst you happens to face him, should jump into that which he sees as fire for that will be nice and sweet water.\" Abu Mas'ud said: \"I have also heard this from the Messenger of Allah (ﷺ).\"<br/><br/><b>[Al-Bukhari and Muslim]</b></p>","grades":[]},{"lang":"ar","chapterNumber":"370","chapterTitle":"باب أحاديث الدجال وأشراط الساعة وغيرها","urn":1717980,"body":"<p>- وعن ربعي بن حراش قال‏:‏ انطلقت مع أبي مسعود الأنصاري إلى حذيفة بن اليمان رضي الله عنهم فقال له أبو مسعود، حدثني ما سمعت من رسول الله صلى الله عليه وسلم ، في الدجال قال‏:‏ ‏\"‏إن الدجال يخرج ، وإن معه ماء وناراً ، فأما الذي يراه الناس ماء فنار تحرق، وأما الذي يراه الناس نارأً، فماء بارد عذب، فمن أدركه منكم، فليقع في الذي يراه ناراً، فإنه ماء عذب طيب‏\"‏ فقال أبو مسعود‏:‏ وأنا قد سمعته‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏</p>","grades":[]}]}
