{"collection":"riyadussalihin","bookNumber":"1","chapterId":"86.00","hadithNumber":"690","hadith":[{"lang":"en","chapterNumber":"86","chapterTitle":"Fulfillment of Promises","urn":1606820,"body":"<p>Jabir (May Allah be pleased with him) reported: The Prophet (ﷺ) said to me, \"When the revenues of Bahrain will arrive, I shall give you such and such and such.\" He passed away before the revenues were received. When they arrive during the caliphate of Abu Bakr (May Allah be pleased with him), he ordered to be announced: \"Anyone whom Messenger of Allah (ﷺ) promised or owed anything, should come to him.\" I went to him and said: \"Messenger of Allah (ﷺ) had said to me such and such.\" He took a double handful out of the money and gave it to me. I counted it and found that it was five hundred dirham. Then Abu Bakr (May Allah be pleased with him) said to me: \"Take twice as much more of that amount.\"<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"86","chapterTitle":"-باب الوفاء بالعهد وإنجاز الوعد","urn":1706860,"body":"<p>- وعن جابر رضي الله عنه قال‏:‏ قال لي النبى صلى الله عليه وسلم‏:‏ ‏\"‏لو قد جاء مال البحرين أعطيتك هكذا وهكذا وهكذا‏\"‏ فلم يجئ مال البحرين حتى قبض النبى صلى الله عليه وسلم، فلما جاء مال البحرين أمر أبو بكر رضي الله عنه فنادي‏:‏ من كان له عند رسول صلى الله عليه وسلم عدة أو دين فليأتنا‏.‏ فأتيته وقلت له‏:‏ إن النبى صلى الله عليه وسلم قال لى كذا وكذا، فحثى لى حثية، فعددتها، فإذا هى خمسمائة، فقال لى‏:‏ خذ مثلها‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏</p>","grades":[]}]}
