{"collection":"riyadussalihin","bookNumber":"18","chapterId":"370.00","hadithNumber":"1808","hadith":[{"lang":"en","chapterNumber":"370","chapterTitle":"Ahadith about Dajjal and Portents of the Hour","urn":1615985,"body":"<p>An-Nawwas bin Sam`an (May Allah be pleased with him) reported: One morning the Messenger of Allah (ﷺ) made a mention of Dajjal, and he described him to be insignificant and at the same time described him so significant that we thought he was on the date-palm trees (i.e., nearby). When we went to him (the Prophet (ﷺ)) in the evening, he perceived the sign of fear on our faces. He said, \"What is the matter with you?'' We said: \"O Messenger of Allah, you talked about Dajjal this morning raising your voice and lowering it until we thought he was hiding in the palm-trees grove: He said: \"Something other than Dajjal make worry about you. If he appears while I am with you, I will defend you against him. But if he appears after I die, then everyone of you is his own defender. Allah is the One Who remains after me to guide every Muslim. Dajjal will be a young man with very curly hair with one eye protruding (with which he cannot see). I compare (his appearance) to that of Al-`Uzza bin Qatan. He who amongst you survives to see him, should recite over him the opening Ayat of Surat Al-Kahf (i.e., Surat 18: Verses 1-8). He will appear on the way between Syria and Iraq and will spread mischief right and left. O slaves of Allah! Remain adhered to the truth.'' We asked: \"O Messenger of Allah! How long will he stay on the earth?'' He said, \"For forty days. One day will be like a year, one day like a month, one day like a week and the rest of the days will be like your days.'' We said: \"O Messenger of Allah! Will one day's Salat (prayer) suffice for the Salat of that day which will be equal to one year?'' Thereupon he said, \"No, but you must make an estimate of time and then offer Salat.'' We said: \"O Messenger of Allah! How quickly will he walk upon the earth?'' Thereupon he said, \"Like cloud driven by the wind (i.e., very quickly). He will come to the people and call them to his obedience and they will affirm their faith in him and respond to him. He will then give command to the sky and it will send its rain upon the earth and he will then send his command to the earth and it will grow vegetation. Then in the evening their pasturing animals will come to them with their humps very high and their udders full of milk and their flanks stretched. He will then come to another people and invite them, but they will reject him and he will leave them, in barren lands and without any goods and chattels! He would then walk through the waste land and say to it: `Bring forth your treasures', and the treasures will come out and follow him like swarms of bees. He will then call a person brimming with youth and strike him with the sword and cut him into two pieces and make these pieces lie at a distance, which is generally between the archer and his target. He will then call that young man and he will come forward, laughing, with his face gleaming out of joy; and it will be at this very time that Allah will send `Isa (Jesus), son of Maryam (Mary) who will descend at the white minaret in the eastern side of Damascus, wearing two garments lightly dyed and placing his hands on the wings of two angels. When he will lower his head, there would fall drops of water from his head, and when he will raise it up, drops like pearls would scatter from it. Every disbeliever who will find his (i.e., `Isa's) smell will die and his smell will reach as far as he will be able to see. He will then search for Dajjal until he will catch hold of him at the gate of Ludd (village near Jerusalem), and will kill him. Then the people, whom Allah will have protected, will come to `Isa son of Maryam, and he will wipe their faces and will inform them of their ranks in Jannah, and it will be under such conditions that Allah will reveal to `Isa these words: `I have brought forth from amongst my slaves such people against whom none will be able to fight, so take these people safely to the mountain.' And then Allah will send Ya'juj and Ma'juj (Gog and Magog people) and they will sworn down from every slope. The first of them will pass the Lake Tabariyah (near the Dead Sea in Palestine) and drink all its water. And when the last of them will pass, he will say: `There was once water there.' Prophet `Isa (ﷺ) and his companions will then be so much hard-pressed that the head of an ox will be dearer to them than one hundred dinar, and `Isa along with his companions, will make supplication to Allah, Who will send insects which will attack their (Ya'juj and Ma'juj people) neck until they all will perish like a single person. Prophet, `¦sa and his companions will then come down and they will not find in the earth as much space as a single span which would not be filled with their corpses and their stench. Prophet `Isa and his companions will then again beseech Allah, Who will send birds whose necks will be like those of Bactrian camels, and they will carry them and throw them where Allah will desire. Then Allah will send down rain which will spare no house in the city or in the countryside. It would wash away the earth until it appears like a mirror. Then the earth will be told to bring forth its fruit and restore its blessings; and as a result of this, there will grow such a big pomegranate that a group of people will eat from it and seek shelter under its skin. Milk will be so blessed that the milk of one she-camel will suffice for a large company and the cow will give so much milk, that it will suffice for a whole tribe. The sheep will give so much milk that the whole family will be able to drink out of that, and at that time Allah will send a pleasant wind which will soothe people even under their armpits, and will take the life of every Muslim and true believer, and only the wicked will survive. They will commit adultery in public like asses and the Resurrection Day will be held.''\n</p>\n<p>\n<b>[Muslim]</b>.</p>","grades":[]},{"lang":"ar","chapterNumber":"370","chapterTitle":"باب أحاديث الدجال وأشراط الساعة وغيرها","urn":1717970,"body":"<p>- عن النواس بن سمعان رضي الله عنه قال‏:‏ ذكر رسول الله صلى الله عليه وسلم الدجال ذات غداة، فخفض فيه، ورفع حتى ظنناه في طائفة النخل‏.‏ فلما رحنا إليه، عرف ذلك فينا، فقال‏:‏ ‏\"‏ما شأنكم‏؟‏” قلنا‏:‏ يا رسول الله ذكرت الدجال الغداة، فخفضت فيه حتى ظنناه في طائفة النخل فقال‏:‏ ‏\"‏غير الدجال أخوفنى عليكم؛ إن يخرج وأنا فيكم، فأنا حجيجه دونكم؛ وإن يخرج ولست فيكم، فامرؤ حجيج نفسه، والله خليفتي على كل مسلم، إنه شاب قطط، عينه طافية، كأني أشبهه بعبد العزى بن قطن، فمن أدركه منكم فليقرأ عليه فواتح سورة الكهف، إنه خارج خلة بين الشام والعراق، فعاث يمينا وعاث شمالاً، يا عباد الله فاثبتوا” قلنا‏:‏ يا رسول الله وما لبثه في الأرض‏؟‏ قال‏:‏ ‏\"‏أربعون يوماً‏:‏ يوم كسنة، ويوم كشهر، ويوم كجمعة، وسائر أيامه كأيامكم‏\"‏ قلنا ‏:‏ يا رسول الله ، فذلك اليوم الذي كسنة أتكفينا فيه صلاة يوم‏؟‏ قال‏:‏ لا، اقدروا له قدره” فقلنا‏:‏ يا رسول الله وما إسراعه في الأرض‏؟‏ قال‏:‏ ‏\"‏كالغيث استدبرته الريح، فيأتي على القوم، فيدعوهم، فيؤمنون به، ويستجيبون له فيأمر السماء فتمطر، والأرض فتنبت، فتروح عليهم سارحتهم، أطول ما كانت ذرى، وأسبغه ضروعاً، وأمده خواصر، ثم يأتي القوم فيدعوهم، فيردون عليه قوله، فيصرف عنهم، فيصبحون ممحلين ليس بأيديهم شيء من أموالهم، ويمر بالخربة فيقول لها‏:‏ أخرجي كنوزك، فتتبعه كنوزها كيعاسيب النحل، ثم يدعو رجلاً ممتلئاً شبابا فيضربه بالسيف، فيقطعه جزلتين رمية الغرض، ثم يدعوه، فيقبل، ويتهلل وجهه يضحك، فبينما هو كذلك إذ بعث الله تعالى المسيح ابن مريم،صلى الله عليه وسلم ، فينزل عند المنارة البيضاء شرقي دمشق بين مهرودتين، واضعاً كفيه على أجنحة ملكين، إذا طأطأ رأسه، قطر، وإذا رفعه تحدر منه جمان كاللؤلؤ، فلا يحل لكافر يجد نفسه إلا مات، ونفسه ينتهي إلى حيث ينتهي طرفه، فيطلبه حتى يدركه بباب لد فيقتله، ثم يأتي عيسى ، صلى الله عليه وسلم ، قوم قد عصمهم الله منه، فيمسح عن وجوههم، ويحدثهم بدرجاتهم في الجنة، فبينما هو كذلك إذ أوحى الله تعالى إلى عيسى صلى الله عليه وسلم إني قد أخرجت عباداً لي لا يدان لأحد بقتالهم، فحرز عبادي إلى الطور، ويبعث الله يأجوج ومأجوج وهم من كل حدب ينسلون، فيمر أوائلهم على بحيرة طبرية فيشربون ما فيها، ويمر آخرهم فيقول‏:‏ لقد كان بهذه مرة ماء، ويحصر نبي الله عيسى، صلى الله عليه وسلم ، وأصحابه حتى يكون رأس الثور لأحدهم خيراً من مائة دينار لأحدكم اليوم، فيرغب نبي الله عيسى، صلى الله عليه وسلم وأصحابه، رضي الله عنهم، إلى الله تعالى، فيرسل الله تعالى عليهم النغف في رقابهم، فيصبحون فرسى كموت نفس واحدة ثم يهبط نبي الله عيسى، صلى الله عليه وسلم ، وأصحابه رضي الله عنهم، إلى الله تعالى، فيرسل الله تعالى عليهم النغف في رقابهم فيصبحون فرسى كموت نفس واحدة ثم يهبط نبي الله عيسى، صلى الله عليه وسلم ، وأصحابه رضي الله عنهم، إلى الأرض، فلا يجدون في الأرض موضع شبر إلا ملأه زهمهم ونتنهم، فيرغب، نبي الله عيسىصلى الله عليه وسلم ، وأصحابه رضي الله عنهم إلى الله تعالى، فيرسل الله تعالى طيراً كأعناق البخت، فتحملهم، فتطرحهم حيث شاء الله، ثم يرسل الله عز وجل مطراً لا يكن منه بيت مدر ولا وبر، فيغسل الأرض حتى يتركها كالزلقة، ثم يقال للأرض‏:‏ أنبتي ثمرتك، وردي بركتك، فيومئذ تأكل العصابة من الرمانة، ويستظلون بقحفها، ويبارك في الرسل حتى إن اللقحة من الإبل لتكفي الفئام من الناس، واللقحة من البقر لتكفي القبيلة من الناس، واللقحة من الغنم لتكفي الفخذ من الناس، فبينما هم كذلك إذ بعث الله تعالى ريحاً طيبة، فتأخذهم تحت آباطهم، فتقبض روح كل مؤمن وكل مسلم؛ ويبقى شرار الناس يتهارجون فيها تهارج الحمر فعليهم تقوم الساعة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ قوله: «خلة بين الشام والعراق» : أي طريقا بينهما. وقوله: «عاث» بالعين المهملة والثاء المثلثة، والعيث: أشد الفساد. «والذرى» : بضم الذال المعجمة وهو أعالي الأسنمة وهو جمع ذروة بضم الذال وكسرها « واليعاسيب» : ذكور النحل. «وجزلتين» : أي قطعتين، «والغرض» : الهدف الذي يرمى إليه بالنشاب، أي: يرميه رمية كرمية النشاب إلى الهدف. «والمهرودة» بالدال المهملة والمعجمة، وهي: الثوب المصبوغ. قوله: «لا يدان» : أي لا طاقة. «والنغف» : دود. «وفرسى» : جمع فريس، وهو القتيل. و «الزلقة» : بفتح الزاي واللام وبالقاف، ... وروي: الزلفة بضم الزاي وإسكان اللام وبالفاء وهي المرآة. ... «والعصابة» : الجماعة. «والرسل» بكسر الراء: اللبن. «واللقحة» : اللبون. «والفئام» بكسر الفاء وبعدها همزة ممدودة: الجماعة. ... «والفخذ» من الناس: دون القبيلة.</p>","grades":[]}]}
