{"collection":"riyadussalihin","bookNumber":"8","chapterId":"197.00","hadithNumber":"1104","hadith":[{"lang":"en","chapterNumber":"197","chapterTitle":"Briefness to be Adopted in Performing the two Rak'ah Sunnah before Fajr Prayer, their time and the Surah to recite in them","urn":1621470,"body":"<p>'Aishah (May Allah be pleased with her) reported: The Prophet (ﷺ) used to perform two Rak'ah short prayer between the Adhan (call to prayer) and the Iqamah of the dawn (Fajr) prayers.<br/><br/><b>[Al- Bukhari and Muslim]</b><br/><br/>In another narration, 'Aishah (May Allah be pleased with her) said: The Messenger of Allah (ﷺ) used to perform two supererogatory Rak'ah prayer of Fajr and make them so short in duration that I used to think whether he (ﷺ) had recited Surat Al-Fatihah (in it) or not.<br/><br/><b>[Al-Bukhari and Muslim]</b><br/><br/>In the narration of Muslim, 'Aishah (May Allah be pleased with her) said: When the Messenger of Allah (ﷺ) used to hear the Adhan (of Fajr prayer) he would perform two supererogatory Rak'ah prayer and would make them short.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"197","chapterTitle":"- باب تخفيف ركعتي الفجر وبيان ما يقرأ فيهما، وبيان وقتهما‏.","urn":1710940,"body":"<p>- عن عائشة رضي الله عنها أن رسول الله صلى الله عليه وسلم، كان يصلي ركعتين خفيفتين بين النداء والإقامة من صلاة الصبح‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ \nوفي رواية لهما‏:‏ يصلي ركعتي الفجر، إذا سمع الأذان فيخففهما حتى أقول هل قرأ فيهمابأم القرآن‏!‏‏.‏ وفي رواية لمسلم‏:‏ كان يصلى ركعتيي الفجر إذا سمع الأذان ويخففهما‏.‏\nوفي رواية‏:‏ إذا طلع الفجر‏.‏</p>","grades":[]}]}
