{"collection":"riyadussalihin","bookNumber":"17","chapterId":"305.00","hadithNumber":"1679","hadith":[{"lang":"en","chapterNumber":"305","chapterTitle":"Prohibition of Drawing Portraits","urn":1624800,"body":"<p>'Aishah (May Allah be pleased with her) said: The Messenger of Allah (ﷺ) visited me after returning from a journey, and I had a shelf with a thin cloth curtain hanging over it and on which there were portraits. When he saw it, the colour of his face changed (because of anger) and he said, \"O 'Aishah! the most grievous torment from Allah on the Day of Resurrection will be for those who imitate (Allah) in the act of His creation.\" 'Aishah said: We tore it into pieces and made a cushion or two cushions out of that.<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"305","chapterTitle":"- باب تحريم تصوير الحيوان في بساط أو حجر أو ثوب أو درهم أو مخدة أو دينار أو وسادة وغير ذلك وتحريم اتخاذ الصور في حائط وسقف وستر وعمامة وثوب ونحوها والأمر بإتلاف الصورة","urn":1716690,"body":"<p>- وعن عائشة رضي الله عنها قالت‏:‏ قدم رسول الله صلى الله عليه وسلم من سفر وقد سترت سهوة لي بقرام فيه تماثيل فلما رآه رسول الله صلى الله عليه وسلم، تلون وجهه، وقال‏:‏ ‏\"‏يا عائشة، أشد الناس عذابًا عن الله يوم القيامة الذين يضاهون بخلق الله‏\"‏ قالت‏:‏ فقطعناه، فجعلنا منه وسادة أو وسادتين‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ «القِرامُ» بكسرِ القاف هو: السِّتْرُ. «وَالسَّهْوَةُ» بفتح السينِ المهملة وهي: الصُّفَّةُ تَكُونُ بَيْنَ يَدَيِ البَيْتِ، وقيلَ: هِيَ الطَّاقُ النَّافِذُ في الحائِطِ.</p>","grades":[]}]}
