{"collection":"riyadussalihin","bookNumber":"2","chapterId":"116.00","hadithNumber":"773","hadith":[{"lang":"en","chapterNumber":"116","chapterTitle":"Permissibility of Drinking Water from all Types of Clean Vessels Except Those of Gold and Silver","urn":1607447,"body":"<p>Anas bin Malik (May Allah be pleased with him) reported: Once the time for As-Salat (the prayer) approached. Those whose houses were near, went to their houses (to perform Wudu') while some of the people remained with the Messenger of Allah (ﷺ). A stone (containing some water) bowl was brought for him. It was too small for him to spread his hand over it. He performed his Wudu' and it (the water) sufficed for all the others also. Anas was asked: \"How many of you were present there?\" He said: \"Eighty or more.\"\n</p>\n<p>\n<b>[Al-Bukhari and Muslim].</b> This is Al-Bukhari's version.<br/><br/>\nIn Muslim's version \"'that Allah's Messenger (ﷺ) called for a container of water so he was given a vessel that had some water.' Anas said 'Then I started looking at the water spouting from his fingers. Then I estimated (the persons) and they were between seventy and eighty.'\"</p>","grades":[]},{"lang":"ar","chapterNumber":"116","chapterTitle":"- باب جواز الشرب من جميع الأواني الطاهرة غير الذهب والفضة وجواز الكرع - وهو الشرب بالفم من النهر وغيره- بغير إناء ولا يد وتحريم استعمال إناء الذهب والفضة في الشرب والأكل والطهارة وسائر وجوه الاستعمال","urn":1707680,"body":"<p>- عن أنس رضى الله عنه قال‏:‏ حضرت الصلاة، فقام من كان قريب الدار إلى أهله، وبقى قوم فأتى رسول الله صلى الله عليه وسلم بمخضب من حجارة، فصغر المخضب أن يبسط فيه كفه، فتوضأ القوم كلهم‏.‏ قالوا‏:‏ كم كنتم‏؟‏ قال‏:‏ ثمانين وزيادة‏.‏((متفق عليه))، هذه رواية البخاري.<br/><br/>\nوفي رواية مسلم:‏ أن النبي صلى الله عليه وسلم دعا بإناء من ماء، فأتى بقدح رحراح فيه شئ من ماء، فوضع أصابعه فيه‏.‏ قال أنس ‏:‏ فجعلت أنظر إلى الماء ينبع من بين أصابعه ‎، فحزرت من توضأ ما بين السبعين إلى الثمانين‏.‏</p>","grades":[]}]}
