{"collection":"riyadussalihin","bookNumber":"3","chapterId":"119.00","hadithNumber":"797","hadith":[{"lang":"en","chapterNumber":"119","chapterTitle":"The Description of the Length of the Qamees' Sleeves, the End of the Turban, and Prohibition of Wearing Long Garments Out of Pride and Undesirability of Wearing Them Without Pride","urn":1607660,"body":"<p>Qais bin Bishr At-Taghlibi reported that his father, who attended the company of 'Abud-Darda' (May Allah be pleased with him) told him: There was a man in Damascus who was a Companion of the Messenger of Allah (ﷺ). He was called Ibn Al-Hanzaliyyah. He was a lonesome person and would rarely spend some time in the company of people. He would spend most of his time performing Salah and when he finished, he would engage himself in Tasbih (Subhan-Allah) and Takbir (Allahu Akbar), until he would go home. He passed by us one day when we were sitting with Abud-Darda' (May Allah be pleased with him). The latter said to him: \"Tell us something which will benefit for us and will not harm you.\" He said: \"The Messenger of Allah (ﷺ) sent a detachment. When they returned, one of them came to the assemblage in which the Messenger of Allah (ﷺ) was present and said to his neighbor during the conversation: 'I wish you had seen us when we encountered the enemy. So-and-so (a believer) took up his spear, struck and said: Take this from me and I am the Ghifari boy. Now what do you think of this?' The neighbor said: 'I think that he lost his reward because of boasting.' He said: 'I see no harm in it.' They began to exchange arguments till the Messenger of Allah (ﷺ) heard them and said, 'Subhan-Allah (Allah is free from every imperfection). He would be rewarded (in the Hereafter) and praised (in this world)'. I noticed that Abud-Darda' (May Allah be pleased with him) felt a great pleasure at this remark and, raising his head began to repeat: \"Have you heard the Messenger of Allah (ﷺ) say this!\" Ibn Al-Hanzaliyyah (May Allah be pleased with him) continued responding until I asked Abud-Darda' (May Allah be pleased with him) not to annoy him.<br/><br/>Ibn Al-Hanzaliyyah (May Allah be pleased with him) happened to pass by us another day and Abud-Darda' said to him: \"Tell us something which will benefit us and will not harm you.\" He said: \"The Messenger of Allah (ﷺ) told us, 'He who spends to purchase a horse (for Jihad) is like one who extends his hand for spending out of charity without withholding it.\"'<br/><br/>He passed by us another day and Abud-Darda' (May Allah be pleased with him) said to him: \"Tell us something which might benefit us, and will not harm you.\" He said: \"The Messenger of Allah (ﷺ) once said, 'Khuraim Al-Usaidi is an excellent man were it not for his long hair and his lower garment which is hanging down.' When Khuraim heard about what the Prophet (ﷺ) had said about him, he trimmed his long hair up to his ears with a knife and raised his lower garment half way to his shanks.\"<br/><br/>On another occasion he passed by us and Abud-Darda' (May Allah be pleased with him) said to him: \"Tell us something that will benefit us and will not harm you.\" He said that he heard the Messenger of Allah (ﷺ) say, while coming back from an expedition: \"You are returning to your brothers, so set your saddles and clothes in order so that you look tidy and graceful. Allah hates untidiness.\"<br/><br/><b>[Abu Dawud]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"119","chapterTitle":"- باب صفة طول القميص والكم والإزار وطرف العمامة وتحريم إسبال شئ من ذلك على سبيل الخيلاء وكراهته من غير خيلاء","urn":1707910,"body":"<p>وعن قيس بن بشر التغلبى قال‏:‏ أخبرني أبى - وكان جليساً لأبى الدرداء-قال‏:‏ كان بدمشق رجل من أصحاب النبي صلى الله عليه وسلم يقال له سهل بن الحنظلية، وكان رجلاً متوحداً قلما يجالس الناس، إنما هو في صلاة ، فإذا فرغ فإنما هو تسبيح وتكبير حتى يأتى أهله، فمر بنا ونحن عند أبى الدرداء فقال أبو الدرداء‏:‏ كلمةً تنفعنا ولا تضرك‏.‏ قال‏:‏ بعث رسول الله صلى الله عليه وسلم سرية فقدمت ، فجاء رجل منهم فجلس في المجلس الذي يجلس فيه رسول الله صلى الله عليه وسلم ، فقال لرجل إلى جنبه‏:‏ لو رأيتنا حين التقينا نحن والعدو،فحمل فلان وطعن، فقال‏:‏ خذها منى،وأنا الغلام الغفارى، كيف ترى في قوله‏؟‏ قال‏:‏ ما أراه إلا قد بطل أجره‏.‏ فسمع بذلك آخر فقال‏:‏ ما أرى بذلك بأساً ، فتنازعا حتى سمع رسول الله صلى الله عليه وسلم فقال‏:‏ ‏\"‏سبحان الله‏؟‏لا بأس أن يؤجر ويحمد‏\"‏ فرأيت أبا الدرداء سر بذلك، وجعل يرفع رأسه إليه ويقول‏:‏ أنت سمعت ذلك من رسول الله صلى الله عليه وسلم ‍‍‍‍‍‍‏؟‏ فيقول‏:‏ نعم‏.‏ فما زال يعيد عليه حتى إني لأقول ليبركن على ركبتيه‏.‏ قال‏:‏ فمر بنا يوماً آخر، فقال له الدرداء‏:‏ كلمة تنفعنا ولا تضرك، قال‏:‏ قال لنا رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏المنفق على الخير كالباسط يده بالصدقة ولا يقبضها‏\"‏‏.‏ثم مر بنا يوماً آخر، فقال له أبو الدرداء‏:‏ كلمة تنفعنا ولا تضرك، قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏:‏‏\"‏نعم الرجل خريم الأسدى ‍‏!‏ لولا طول جمته وإسبال إزاره ‏!‏‏:‏ فبلغ خريما، فجعل، فأخذ شفرة فقطع بها جمته إلى أذنيه ، ورفع إزاره إلى أنصاف ساقية‏.‏ ثم مر بنا يوماً آخر فقال له أبو الدرداء‏:‏ كلمةً تنفعنا ولا تضرك، قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏إنكم قادمون على إخوانكم، فأصلحوا رحالكم، وأصلحوا لباسكم حتى تكونوا كأنكم شامة في الناس، فإن الله لا يحب الفحش ولا التفحش‏\"‏‏.‏((رواه أبو داود))</p>","grades":[]}]}
