{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"78.00","hadithNumber":"653","hadith":[{"lang":"en","chapterNumber":"78","chapterTitle":"Obligation of Rulers to show Kindness to their Subjects","urn":1606470,"body":"<p>Abu Ya'la Ma'qil bin Yasar (May Allah be pleased with him) reported: Messenger of Allah (ﷺ) said, \"Any slave whom Allah makes him in charge of subjects and he dies while he is not sincere to them, Allah will make Jannah unlawful for him.\"<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/>Another narration is: Allah's Messenger (ﷺ) said, \"He who does not look after his subjects with goodwill and sincerity, will be deprived of the fragrance of Jannah.\"<br/><br/>A narration in Muslim is: Messenger of Allah (ﷺ) said, \"A ruler who, having control over the affairs of the Muslims, does not strive diligently for their betterment and does not serve them sincerely, will not enter Jannah with them.\"<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"78","chapterTitle":"- باب أمر ولاة الأمور بالرفق برعاياهم ونصيحتهم والشفقة والنهى عن غشهم والتشديد عليهم وإهمال مصالحهم والغفلة عنهم وعن حوائجهم","urn":1706490,"body":"<p>- وعن أبى يعلى معقل بن يسار رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم‏:‏ يقول‏:‏ “ما من عبد يستر عليه الله رعية، يموت يوم يموت وهو غاش لرعيته، إلا حرم الله عليه الجنة” ‏(‏‏(‏متفق عليه‏)‏‏)‏ \n<br/>\n‏(‏‏(‏وفي رواية‏:‏ ‏\"‏فلم يحطها بنصحه لم يجد رائحة الجنة‏\"‏‏)‏‏)‏\n<br/>\n<br/>\nوفي رواية لمسلم‏:‏ ‏\"‏ما من أمير يلى أمور المسلمين، ثم لا يجهد لهم وينصح لهم، إلا لم يدخل معهم الجنة‏\"‏‏.‏</p>","grades":[]}]}
