{"collection":"riyadussalihin","bookNumber":"1","chapterId":"99.00","hadithNumber":"726","hadith":[{"lang":"en","chapterNumber":"99","chapterTitle":"Excellence of Using the Right Hand for Performing Various Good Acts","urn":1607150,"body":"<p>Anas (May Allah be pleased with him) reported: When Messenger of Allah (ﷺ) went to Mina, he came to Jamrat-ul-'Aqabah and threw pebbles at it. After that, he went to his lodge in Mina and sacrificed. Then he called for a barber and pointed his right side to him, said, \"Shave from here.\" Then he pointed his left side and said, \"Take (hair) from here.\" Then he distributed his hair among the people.<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/>Another narration is: After the Messenger of Allah (ﷺ) had thrown pebbles at Jamrah and sacrificed an animal, he turned the right side of his head towards the barber who shaved it for him. Then he called Abu Talhah Ansari (May Allah be pleased with him) and gave his hair to him. Then he turned his head to the left side and asked the barber to shave it. He gave the hair to Abu Talhah and told him, \"Distribute it among the people.\"<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"99","chapterTitle":"- باب استحباب تقديم اليمين في كل ماهو من باب التكريم كالوضوء والغسل والتيمم، ولبس الثوب والنعل والخف والسراويل ودخول المسجد، والسواك، والاكتحال، وتقليم الأظفار، وقص الشارب ونتف الإبط، وحلق الرأس، والسلام من الصلاة، والأكل والشرب، والمصافحة، واستلام الحجر الأسود، والخرود من الخلاء، والأخذ والعطاء، وغير ذك مما هو في معناه‏.‏ ويستحب تقديم اليسار في ضد ذلك، كالامتخاط والبصاق عن اليسار، ودخول الخلاء، والخروج من المسجد، وخلع الخف والنعل والسراويل والثوب، والإستنجاء وفعل المستقذرات وأشباه ذلك","urn":1707220,"body":"<p>- وعن أنس رضي الله عنه أن رسول الله صلى الله عليه وسلم أتى منى‏:‏ فأتى الجمرة فرماها، ثم أتى منزله بمنى، ونحر، ثم قال للحلاق “خذ” وأشار إلى جانبه الأيمن، ثم الأيسر، ثم جعل يعطيه الناس‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏وفي رواية‏:‏ لما رمى الجمرة، ونحر نسكه وحلق‏:‏ ناول الحلاق شقه الأيمن فحلقه، ثم دعا أبا طلحة الأنصارى رضي الله عنه ، فأعطاه إياه،ثم ناوله الشق الأيسر فقال “احلق” فحلقه فأعطاه أبا طلحة فقال‏:‏ ‏\"‏اقسمه بين الناس‏\"‏‏.‏</p>","grades":[]}]}
