{"collection":"riyadussalihin","bookNumber":"17","chapterId":"256.00","hadithNumber":"1534","hadith":[{"lang":"en","chapterNumber":"256","chapterTitle":"Some cases where it is permissible to Backbite","urn":1623350,"body":"<p>Zaid bin Al-Arqam (May Allah be pleased with him) said: We set out on a journey along with the Messenger of Allah (ﷺ) and we faced many hardships. 'Abdullah bin Ubaiy (the chief of the hypocrites at Al- Madinah) said to his friends: \"Do not spend on those who are with the Messenger of Allah (ﷺ) until they desert him.\" He also said: \"If we return to Al-Madinah, the more honourable (meaning himself, i.e., Abdullah bin Ubaiy) will drive out therefrom the meaner (meaning Messenger of Allah (ﷺ)).\" I went to the Messenger of Allah (ﷺ) and informed him about that and he sent someone to 'Abdullah bin Ubaiy. He asked him whether he had said that or not. Abdullah took an oath that he had not done anything of that sort and said that it was Zaid who carried a false tale to the Messenger of Allah (ﷺ). Zaid said: I was so much perturbed because of this until this Verse was revealed verifying my statement:<br/><br/>\"When the hypocrites come to you (O Muhammad (ﷺ)), they say: 'We bear witness that you are indeed the Messenger of Allah.' Allah knows that you are indeed His Messenger, and Allah bears witness that the hypocrites are liars indeed.\" (63:1) Then the Messenger of Allah (ﷺ) called the hypocrites in order to seek forgiveness for them from Allah, but they turned away their heads.<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"256","chapterTitle":"- باب ما يباح من الغيبة","urn":1715240,"body":"<p>- وعن زيد بن أرقم رضي الله عنه قال‏:‏ خرجنا مع رسول الله صلى الله عليه وسلم في سفر أصاب الناس فيه شدة، فقال عبد الله بن أبي‏:‏ لا تنفقوا على من عند رسول الله حتى ينفضوا وقال‏:‏ لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل فأتيت رسول الله صلى الله عليه وسلم، فأخبرته بذلك، فأرسل إلى عبد الله بن أبي ، فاجتهد يمينه‏:‏ ما فعل، فقالوا‏:‏ كذب زيد رسول الله صلى الله عليه وسلم فوقع في نفسي مما قالوا شدة حتى أنزل الله تعالى تصديقي ‏{‏إذا جاءك المنافقون‏}‏ ثم دعاهم النبي صلى الله عليه وسلم، ليستغفر لهم فلووا رءوسهم‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏</p>","grades":[]}]}
