{"collection":"riyadussalihin","bookNumber":"1","chapterId":"85.00","hadithNumber":"686","hadith":[{"lang":"en","chapterNumber":"85","chapterTitle":"Secrecy of Private Matters (Guarding Secrets)","urn":1606780,"body":"<p>'Aishah (May Allah be pleased with her) reported: On one occasion all the wives of the Prophet (ﷺ) were with him when his daughter, Fatimah (May Allah be pleased with her) who walked after the style of her father, came there. He (ﷺ) welcomed her saying, \"Welcome, O my daughter\", and made her sit on his right side, or on his left side and then whispered something to her at which she wept bitterly. When he perceived her grief, he talked secretly to her again and she smiled (with happiness). I said to her: \"Messenger of Allah (ﷺ chose you from amongst all his wives to speak secretly to you and yet you cried.\" When he left, I asked her, \"What did Messenger of Allah (ﷺ) say to you?\" She said, \"I will not divulge the secret of Messenger of Allah (ﷺ).\" When Messenger of Allah (ﷺ) passed away, I said to her: \"I adjure you by the right I have in respect of you to tell me what Messenger of Allah (ﷺ) had told you.\" She said: \"Now (when Messenger of Allah (ﷺ) has died), I will tell you. When he whispered to me the first time, he told me, 'Jibril (Gabriel) used to listen to my recitation of the Qur'an and then recite it back to me once or twice a year, and this time he has done it twice; and so I perceive that my death is approaching. Then be mindful of your duty to Allah and be patient and steadfast, for I shall be an excellent predecessor for you.' On this I wept as you saw. When he perceived my distress he talked to me secretly the second time and said, 'O Fatimah, are you not pleased that you will be the chief among the believing women or of this Ummah?' This made me smile as you saw.\"<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"85","chapterTitle":"-باب حفظ السر","urn":1706820,"body":"<p>- وعن عائشة رضي الله عنها قالت‏:‏ كن أزواج النبى صلى الله عليه وسلم عنده، فأقبلت فاطمة رضي الله عنها تمشى، ما تخطئ من مشية رسول الله صلى الله عليه وسلم شيئاً، فلما رآها رحب بها وقال‏:‏ “مرحباً بابنتى” ثم أجلسها عن يمينه أو عن شماله، ثم سارها فبكت بكاء شديداً، فلما رأى جزعها سارها الثانية فضحكت، فقلت لها‏:‏ خصك رسول الله صلى الله عليه وسلم من بين نسائه بالسرار، ثم أنت تبكين ‏!‏ فلما قام رسول الله صلى الله عليه وسلم سألتها‏:‏ ما قال لك رسول الله صلى الله عليه وسلم ‏؟‏ قالت‏:‏ ما كنت لأفشي على رسول الله صلى الله عليه وسلم سره‏.‏ فلما توفي رسول الله صلى الله عليه وسلم قلت‏:‏ عزمت عليك بما لي عليك من الحق، لما حدثتني ما قال لك رسول الله صلى الله عليه وسلم‏؟‏ فقالت‏:‏ أما الآن فنعم، أما حين سارني في المرة الأولى فأخبرني “أن جبريل كان يعارضه القرآن في كل سنة مرة أو مرتين، وأنه عارضه الآن مرتين، وإني لا أرى الأجل إلا قد اقترب، فاتقى الله واصبرى، فغنه نعم السلف أنا لك” فبكيت بكائى الذى رأيت‏.‏ فلما رأى جزعى سارنى الثانية، فقال‏:‏ ‏\"‏يا فاطمة أما ترضين أن تكونى سيدة نساء المؤمنين، أو سيدة نساء هذه الأمة” فضحكت ضحكى الذى رأيت‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏(‏‏(‏وهذا لفظ مسلم‏)‏‏)‏‏.‏</p>","grades":[]}]}
