{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"42.00","hadithNumber":"342","hadith":[{"lang":"en","chapterNumber":"42","chapterTitle":"Excellence in doing Good to the Friends of Parents and other Relatives","urn":1603380,"body":"<p>'Abdullah bin Dinar reported: 'Abdullah bin 'Umar (May Allah be pleased with them) met a bedouin on his way to Makkah, he greeted him, offered him to mount the donkey he was riding and gave him the turban he was wearing on his head. Ibn Dinar said to him: \"May Allah make you pious! Bedouins can be satisfied with anything you give them (i.e., what you have given the bedouin is too much). Upon this, 'Abdullah bin 'Umar said, the father of this man was one of 'Umar's friends whom he loved best, and I heard Messenger of Allah saying, \"The finest act of goodness is the good treatment of someone whom one's father loves\".<br/><br/>Another narration goes: When 'Abdullah bin 'Umar (May Allah be pleased with them) set out to Makkah, he kept a donkey with him to ride when he would get tired from the riding of the camel, and had a turban which he tied round his head. One day, as he was riding the donkey, a bedouin happened to pass by him. He ('Abdullah bin 'Umar) said, \"Aren't you so-and-so?\" The bedouin said, \"Yes\". He ('Abdullah bin 'Umar) gave him his donkey and his turban and said, \"Ride this donkey, and tie this turban round your head\". Some of his companions said, \"May Allah forgive you, you gave to this bedouin the donkey which you enjoyed to ride for change, and the turban which you tied round your head\".'Abdullah bin 'Umar said,\"I heard Messenger of Allah (ﷺ) saying, 'The finest act of goodness is the kind treatment of a person to the loved ones of his father after his death,' and the father of this person was a friend of 'Umar (May Allah be pleased with him).<br/><br/><b>[Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"42","chapterTitle":"- باب فضل بر أصدقاء الأب والأم والأقارب والزوجة وسائر من يندب إكرامه","urn":1703380,"body":"<p>- وعن عبد الله بن دينار عن عبد الله بن عمر رضي الله عنهما أن رجلاً من الأعراب لقيه بطريق مكة، فسلم عليه عبد الله بن عمر، وحمله على حمار كان يركبه، وأعطاه عمامة كانت على رأسه، قال ابن دينار‏:‏ فقلنا له‏:‏ أصلحك الله إنهم الأعراب وهم يرضون اليسير فقال عبد الله بن عمر‏:‏ إن أبا هذا كان ودًا لعمر بن الخطاب رضي الله عنه وإني سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏إن أبر البر صلة الرجل أهل ود أبيه‏\"‏‏.‏ \nوفي رواية عن ابن دينار عن ابن عمر أنه كان إذا خرج إلى مكة كان له حمار يتروح عليه إذا مل ركوب الراحلة، وعمامة يشد بها رأسه، فبينا هو يومًا على ذلك الحمار إذ مر به أعرابي، فقال‏:‏ ألست ابن فلان بن فلان‏؟‏ قال‏:‏ بلى‏.‏ فأعطاه الحمار، فقال‏:‏ اركب هذا، وأعطاه العمامة وقال‏:‏ اشدد بها رأسك ، فقال له بعض أصحابه‏:‏ غفر الله لك أعطيت هذا الأعرابي حمارًا كنت تروح عليه، وعمامة كنت تشد بها رأسك‏؟‏ فقال‏:‏إني سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏إن من أبر البر أن يصل الرجل أهل ود أبيه بعد أن يولي‏\"‏ وإن أباه كان صديقًا لعمر رضي الله عنه ،</p>","grades":[]}]}
