{"collection":"riyadussalihin","bookNumber":"18","chapterId":"370.00","hadithNumber":"1859","hadith":[{"lang":"en","chapterNumber":"370","chapterTitle":"Ahadith about Dajjal and Portents of the Hour","urn":1616490,"body":"<p>'Auf bin Malik (May Allah be pleased with him) said: 'Aishah (May Allah be pleased with her) as told that 'Abdullah bin Az-Zubair (May Allah be pleased with them) had said in respect of selling of a gift which was presented to her: \"By Allah! If 'Aishah does not stop this kind of thing, I will declare her incompetent to administer her property.\" 'Aishah (May Allah be pleased with her) asked: \"Did He ('Abdullah bin Az-Zubair) say so?\" The people said: \"Yes.\" 'Aishah (May Allah be pleased with her) said: \"I vow it before Allah that I will never speak to Ibn Az-Zubair.\" When this desertion lasted long, 'Abdullah bin Az-Zubair sought intercession with her, but she said: \"By Allah I will not accept the intercession of anyone for him, and I will not commit a sin of breaking my vow.\" When this state of affairs was prolonged, Ibn Az-Zubair felt it hard on him. He said to Al-Miswar bin Makhramah and 'Abdur-Rahman bin Al-Aswad bin Yaghut: \"I beseech you in the Name of Allah that you should take me to 'Aishah because it is unlawful for her to vow to sever relations with me.\" So Al-Miswar and 'Abdur-Rahman took him with them. They sought her permission, saying: \"As-salamu 'alaika wa rahmatullahi wa barakatuhu! Shall we come in?\" 'Aishah (May Allah be pleased with her) said: \"Come in,\" They asked: \"All of us?\" She said: \"All of you,\" not knowing that Ibn Az-Zubair was also with them. So, when they entered, Ibn Az-Zubair entered the screened place and got hold of 'Aishah (May Allah be pleased with her), his aunt. He was requesting her to forgive him and wept. Al-Miswar and 'Abdur-Rahman also pleaded on his behalf and requested her to speak to him and to accept his repentance. They said to her: \"The Prophet (ﷺ) forbade to cut off relationship because it is unlawful for any Muslim not to talk to his (Muslim) brother (or sister, for that matter) for more than three (days).\" So when they persisted in urging and reminding her of the superiority of having good relation with kith and kin, she began to weep, saying: \"I have made a vow which is a matter of very serious nature.\" They persisted in their appeal till she spoke with 'Abdullah bin Az-Zubair, and she freed forty slaves as an expiation for breaking her vow. Later on, whenever she remembered her vow, she would weep so much that her veil would become wet with tears.<br/><br/><b>[Al- Bukhari]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"370","chapterTitle":"باب أحاديث الدجال وأشراط الساعة وغيرها","urn":1718470,"body":"<p>- وعن عوف بن مالك بن الطفيل أن عائشة رضي الله عنها حدثت أن عبد الله بن الزبير رضي الله عنهما قال في بيع أو عطاء أعطته عائشة رضي الله عنها‏:‏ والله لتنتهين عائشة، أو لأحجرن عليها، قالت أهو قال هذا ‏؟‏ قالو‏:‏ نعم، قالت‏:‏ هو لله علي نذر أن لا أكلم ابن الزبير أبدا، فاستشفع بن الزبير إليها حين طالت الهجرة، فقالت‏:‏ لا والله لا أشفع فيه أبداً، ولا أتحنث إلى نذري فلما طال ذلك على ابن الزبير كلم المسور ابن مخرمة، وعبد الرحمن بن الأسود بن عبد يغوث وقال لهما‏:‏ أنشدكما الله لما أدخلتماني على عائشة رضي الله عنها، فإنها لا يحل لها أن تنذر قطيعتى، فأقبل به المسور، وعبد الرحمن حتى استأذنا على عائشة، فقالا‏:‏ السلام عليك ورحمة الله وبركاته، أندخل‏؟‏ قالت عائشة‏:‏ ادخلوا، قالوا‏:‏ كلنا‏؟‏ قالت‏:‏ نعم ادخلوا كلكم، ولا تعلم أن معهما ابن الزبير، فلما دخلوا ، دخل ابن الزبير الحجاب، فاعتنق عائشة رضي الله عنها، وطفق يناشدها ويبكي، وطفق المسور، وعبد الرحمن يناشدانها إلا كلمته وقبلت منه، ويقولان ‏:‏ إن النبي صلى الله عليه وسلم نها عما قد علمت من الهجرة، ولا يحل لمسلم أن يهجر أخاه فوق ثلاث ليال، فلما أكثروا على عائشة من التذكرة والتحريج، طفقت تذكرهما وتبكي ، وتقول‏:‏ إني نذرت والنذر شديد ، فلم يزالا بها حتى كلمت ابن الزبير، وأعتقت في نذرها ذلك أربعين رقبة، وكانت تذكر نذرها بعد ذلك فتبكي حتى تبل دموعها خمارها‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏</p>","grades":[]}]}
