{"collection":"riyadussalihin","bookNumber":"17","chapterId":"305.00","hadithNumber":"1686","hadith":[{"lang":"en","chapterNumber":"305","chapterTitle":"Prohibition of Drawing Portraits","urn":1624870,"body":"<p>'Aishah (May Allah be pleased with her) said: Jibril (Gabriel) (ﷺ) made a promise with the Messenger of Allah (ﷺ) to come at a definite hour; that hour came but he did not visit him. There was a staff in the hand of the Messenger of Allah (ﷺ). He threw it from his hand and said, \"Never does Allah back out of His Promise, nor do His messengers.\" Then he noticed a puppy under his bed and said, \"O 'Aishah, when did this dog enter?\" She said: \"By Allah, I don't know.\" He then commanded that it should be turned out. No sooner than had they expelled it, Jibril came and the Messenger of Allah (ﷺ) said to him, \"You promised to visit me. I waited for you but you did not come.\" Whereupon he said: \"The dog kept me from coming. We do not enter a house in which there is a dog or a picture.\"<br/><br/><b>[Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"305","chapterTitle":"- باب تحريم تصوير الحيوان في بساط أو حجر أو ثوب أو درهم أو مخدة أو دينار أو وسادة وغير ذلك وتحريم اتخاذ الصور في حائط وسقف وستر وعمامة وثوب ونحوها والأمر بإتلاف الصورة","urn":1716760,"body":"<p>- وعن عائشة رضي الله عنها قالت‏:‏ واعد رسول الله صلى الله عليه وسلم جبريل عليه السلام في ساعة أن يأتيه، فجاءت تلك الساعة ولم يأته‏!‏ قالت‏:‏ وكان بيده عصًا، فطرحها من يده وهو يقول‏:‏ ‏\"‏ما يخلف الله وعده ولا رسله‏\"‏ ثم التفت، فإذا جرو كلب تحت سريره‏.‏ فقال‏:‏ ‏\"‏متى دخل هذا الكلب‏؟‏‏\"‏ فقلت‏:‏ والله ما دريت به، فأمر به فأخرج، فجاءه جبريل عليه السلام‏:‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏وعدتني، فجلست لك ولم تأتني‏\"‏ فقال‏:‏ منعني الكلب الذي كان في بيتك، إنا لا ندخل بيتًا فيه كلب ولا صورة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏</p>","grades":[]}]}
