{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"47.00","hadithNumber":"388","hadith":[{"lang":"en","chapterNumber":"47","chapterTitle":"Signs of Allah's love for His slaves and the efforts for its Achievement","urn":1603840,"body":"<p>'Aishah (May Allah be pleased with her) reported: Messenger of Allah, (ﷺ) appointed a man in charge of an army unit who led them in Salat (prayer); he always concluded his recitation with Surat Al-Ikhlas: \"Say (O Muhammad (ﷺ)): 'He is Allah, (the) One. Allah-us-Samad (Allah - the Self-Sufficient). He begets not, nor was He begotten. And there is none equal or comparable to Him.\"' (112:1-4) Upon their return to Al-Madinah, they mentioned this to Messenger of Allah (ﷺ), who said, \"Ask him why he does so?\" He was asked and he said, \"This Surah contains the Attributes of Allah, the Gracious, and I love to recite it. Messenger of Allah (ﷺ) then told them, \"Tell him that Allah loves him\".<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"47","chapterTitle":"- باب علامات حب الله تعالى للعبد والحث على التخلق بها والسعي في تحصيلها‏.‏","urn":1703840,"body":"<p>- وعن عائشة رضي الله عنها، أن رسول الله صلى الله عليه وسلم، بعث رجلاً على سرية، فكان يقرأ لأصحابه في صلاتهم، فيختم بـ‏{‏قل هو الله أحد‏}‏ فلما رجعوا، ذكروا ذلك لرسول الله، صلى الله عليه وسلم، فقال‏:‏ ‏\"‏سلوه لأي شيء كان يصنع ذلك‏؟‏ ‏\"‏ فسألوه، فقال ‏:‏ لأنها صفة الرحمن، فأنا أحب أن أقرأ بها، فقال رسول الله صلى الله عليه وسلم ‏:‏‏\"‏أخبروه أن الله تعالى يحبه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏ </p>","grades":[]}]}
