{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"1.00","hadithNumber":"4","hadith":[{"lang":"en","chapterNumber":"1","chapterTitle":"Sincerity and Significance of Intentions and all Actions, Apparent and Hidden","urn":1600040,"body":"<p>Jabir bin Abdullah Al-Ansari (May Allah be pleasedwith them) reported: We accompanied the Prophet (ﷺ) in an expedition when he said, \"There are some men in Al-Madinah who are with you wherever you march and whichever valley you cross. They have not joined you in person because of their illness.\" In another version he said: \"They share the reward with you.\"<br/><br/><b>[Muslim]</b>.<br/><br/>It is narrated by Bukhari from Anas bin Malik (May Allah be pleased with him): We were coming back from the battle of Tabuk with the Prophet (ﷺ) when he remarked, \"There are people whom we left behind in Al- Madinah who accompanied us in spirit in every pass and valley we crossed. They remained behind for a valid excuse.\"<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"1","chapterTitle":"- باب الإخلاص وإحضارالنية","urn":1700040,"body":"<p>- وعن أبي عبد الله جابر بن عبد الله الأنصارى رضي الله عنهما قال‏:‏ كنا مع النبي صلى الله عليه وسلم في غزاةٍ فقال‏:‏ ‏\"‏إن بالمدينة لرجالاً ماسرتم مسيراً، ولا قطعتم وادياً إلا كانوا معكم حبسهم المرض‏\"‏ وفى رواية‏:‏ ‏\"‏إلا شاركوكم في الأجر‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ \n‏(‏‏(‏ورواه البخاري‏)‏‏)‏ عن أنس رضي الله عنه قال‏:‏ رجعنا من غزوة تبوك مع النبي صلى الله عليه وسلم فقال‏:‏ ‏\"‏ إن أقواماً خلفنا بالمدينة ما سلكنا شعباً ولا وادياً إلا وهم معنا، حبسهم العذر‏\"‏‏.‏</p>","grades":[]}]}
