{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"46.00","hadithNumber":"382","hadith":[{"lang":"en","chapterNumber":"46","chapterTitle":"Excellence and Etiquette of Sincere love for the sake of Allah","urn":1603780,"body":"<p>Abu Idris Al-Khaulani (May Allah had mercy upon him) reported: I once entered the mosque in Damascus. I happened to catch sight of a young man who had bright teeth (i.e., he was always seen smiling). A number of people had gathered around him. When they differed over anything they would refer it to him and act upon his advice. I asked who he was and I was told that he was Mu'adh bin Jabal (May Allah be pleased with him) The next day I hastened to the mosque, but found that he had arrived before me and was busy in performing Salat. I waited until he finished, and then went to him from the front, greeted him with Salam and said to him, \"By Allah I love you.\" He asked, \"For the sake of Allah?\" I replied, \"Yes, for the sake of Allah\". He again asked me, \"Is it for Allah's sake?\" I replied, \"Yes, it is for Allah's sake.\" Then he took hold of my cloak, drew me to himself and said, \"Rejoice,! I heard Messenger of Allah (ﷺ) saying, 'Allah, the Exalted, says: My love is due to those who love one another for My sake, meet one another for My sake, visit one another for My sake and spend in charity for My sake\".<br/><br/><b>[Malik]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"46","chapterTitle":"- باب فضل الحب في الله والحث عليه وإعلام الرجل من يحبه أنه يحبه، وماذا يقول له إذا أعلمه","urn":1703780,"body":"<p>- وعن أبي إدريس الخولاني رحمه الله قال‏:‏ دخلت مسجد دمشق، فإذا فتًى براق الثنايا وإذا الناس معه، فإذا اختلفوا بشيء، أسندوه إليه، وصدروا عن رأيه، فسألت عنه، فقيل‏:‏ هذا معاذ بن جبل رضي الله عنه، فلما كان من الغد، هجرت، فوجدته قد سبقني بالتهجير، ووجدته يصلي، فانتظرته حتى قضى صلاته، ثم جئته من قبل وجهه، فسلمت عليه، ثم قلت‏:‏ والله إني لأحبك، فقال‏:‏ آلله‏؟‏ فقال‏:‏ الله، فقال‏:‏ آلله‏؟‏ فقالت‏:‏ الله، فأخذني بحبوة ردائي، فجبذني إليه، فقال‏:‏أبشر، فإني سمعت رسول الله صلى الله عليه وسلم يقول‏:‏‏\"‏ قال الله تعالى وجبت محبتي للمتحابين فيَّ، والمتجالسين فيَّ ، والمتزاورين فيَّ ، والمتباذلين فيَّ ‏\"‏ حديث صحيح ‏(‏‏(‏رواه مالك فيَّ الموطأ بإسناده الصحيح‏)‏‏)‏‏.‏</p>","grades":[]}]}
