{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"25.00","hadithNumber":"200","hadith":[{"lang":"en","chapterNumber":"25","chapterTitle":"Discharging the Trusts","urn":1601990,"body":"<p>Hudhaifah bin Al-Yaman (May Allah bepleased with him) reported: Messenger of Allah (ﷺ) foretold to us two Ahadith. I have seen one (being fulfilled), and I am waiting for the other. He (ﷺ) told us, \"Amanah (the trust) descended in the innermost (root) of the hearts of men (that is, it was in their heart innately, by Fitrah, or pure human nature). Then the Qur'an was revealed and they learnt from the Quran and they learned from the Sunnah.\" Then the (Prophet (ﷺ)) told us about the removal of Amanah. He said, \"The man would have some sleep, and Amanah would be taken away from his heart leaving the impression of a faint mark. He would again sleep, and Amanah would be taken away from his heart leaving an impression of a blister, as if you rolled down an ember on your foot and it was vesicled. He would see a swelling having nothing in it.\" He (the Prophet (ﷺ)) then took up a pebble and rolled it over his foot and said, \"The people would enter into transactions with one another and hardly a person would be left who would return (things) entrusted to him (and there would look like an honest person) till it would be said: 'In such and such tribe there is a trustworthy man.' And they would also say about a person: 'How prudent he is! How handsome he is and how intelligent he is!' whereas in his heart there would be no grain of Faith.\" Hudhaifah bin Al-Yaman (May Allah bepleased with him) added: I had a time when I did not care with whom amongst you I did business, I entered into a transaction, for if he were a Muslim, his Faith would compel him to discharge his obligation to me; and if he were a Christian or a Jew, his guardian (surety) would compel him to discharge his obligation to me. But today I would not enter into a transaction except with so-and-so.<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"25","chapterTitle":"- باب الأمر بأداء الأمانة","urn":1701990,"body":"<p>- وعن حذيفة بن اليمان‏.‏ رضي الله عنه ، قال‏:‏ حدثنا رسول الله، صلى الله عليه وسلم، حديثين قد رأيت أحدهما، وأنا أنتظر الآخر‏:‏ حدثنا أن الأمانة نزلت في جذر قلوب الرجال، ثم نزل القرآن فعلموا من القرآن، وعلموا من السنة، ثم حدثنا عن رفع الأمانة فقال‏:‏ ‏\"‏ينام الرجل النومة فتقبض الأمانة من قلبه، فيظل أثرها مثل الوكت، ثم ينام النومة فتبض الأمانة من قلبه، فيظل أثرها مثل أثر المجل، كجمر دحرجته على رجلك، فنفط فتراه منتبرًا وليس فيه شيء ‏\"‏ ثم أخذ حصاة فدحرجه على رجله ‏\"‏فيصبح الناس يتبايعون، فلا يكاد أحد يؤدي الأمانة حتى يقال‏:‏” إن في بني فلان رجلاً أمينًا، حتى يقال للرجل، ما أجلده ما أظرفه، ما أعقله‏!‏ وما في قلبه مثقال حبة من خردل من إيمان ‏.‏ ولقد أتى علي زمان وما أبالي أيكم بايعت؛ لئن كان مسلمًا ليردنه علي دينه، ولئن كان نصرانيا أو يهودياً ليردنه علي ساعيه، وأما اليوم فما كنت أبايع منكم إلا فلانًا و فلانًا‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏</p>","grades":[]}]}
