{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"55.00","hadithNumber":"464","hadith":[{"lang":"en","chapterNumber":"55","chapterTitle":"Excellence of Leading an Ascetic Life, and Virtues of Simple Life","urn":1604610,"body":"<p>Abu Dharr (May allah be pleased with him) reported: I was walking with the Prophet (ﷺ) on the stony ground in Al-Madinah in the afternoon when Uhud Mount came into sight. Messenger of Allah (ﷺ) said, \"O Abu Dharr!\" I said, \"O Messenger of Allah, here I am responding to you\". He said, \"If I had as much gold as the weight of Uhud, it would not please me to have a single dinar out of it with me after the passage of three days, but I would hold back something for the repayment of a debt. I would distribute it among the slaves of Allah like this and like this and like this.\" And he (ﷺ) pointed in front of him, and on his right side and on his left side. We then walked a little further and he (ﷺ) said: \"The rich would be poor on the Day of Resurrection, except he who spent like this and like this and like this,\". and he pointed as he did the first time. \"But such persons are few\". Then he said, \"Stay where you are till I come back to you\". He (the Prophet (ﷺ)) walked ahead a little further in the darkness of the night and disappeared from my sight. I heard a loud voice. I said (to myself): \"The Messenger of Allah (ﷺ) might have met (mishap or an enemy)\". I wished I could go after him but I remembered his commanding me to stay till he came back. So I waited for him; and when he came, I made mention of what I had heard. He asked, \"Did you hear it?\". I said, \"Yes\". Then he said, \"It was Jibril (Gabriel), who came to me and said: 'He who dies among your Ummah without having associated anything with Allah (in worship) will enter Jannah.' I said: 'Even if he committed illicit sexual intercourse or steals?' He (Jibril) said: 'Even if he has committed illicit sexual intercourse or steals\".<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"55","chapterTitle":"- باب فضل الزهد في الدنيا و الحث على التقلل منها و فضل الفقر","urn":1704600,"body":"<p>- وعن أبي ذر رضي الله عنه ، قال كنت أمشى مع النبي صلى الله عليه وسلم في حرة بالمدينة ، فاستقبلنا أحد فقال‏:‏ ‏\"‏يا أبا ذر‏\"‏ قلت‏:‏ لبيك يا رسول الله‏.‏ فقال‏:‏ ‏\"‏ما يسرني أن عندي مثل أحد هذا ذهبا تمضى علي ثلاثة أيام وعندي منه دينار، إلا شئ أرصده لدين، إلا أن أقول له به في عباد الله هكذا، وهكذا وهكذا‏\"‏ عن يمينه وعن شماله ومن خلفه، ثم سار فقال‏:‏ ‏\"‏إن الأكثرين هم الأقلون يوم القيامة إلا من قال بالمال هكذا وهكذا وهكذا‏\"‏ عن يمينه وعن شماله ومن خلفه‏\"‏ وقليل ما هم‏\"‏ ثم قال لى ‏\"‏مكانك لا تبرح حتى آتيك‏\"‏ ثم انطلق في سواد الليل حتى توارى، فسمعت صوتا قد ارتفع ، فتخوفت أن يكون أحد عرض للنبى، صلى الله عليه وسلم، فأردت أن آتيه فذكرت قوله‏:‏ ‏\"‏لا تبرح حتى آتيك‏\"‏ فلم أبرح حتى أتانى، فقلت ‏:‏ لقد سمعت صوتاً تخوفت منه، فذكرت له، فقال‏:‏ ‏\"‏وهل سمعته‏؟‏‏\"‏ قلت‏:‏ نعم، قال‏:‏ ‏\"‏ذاك جبريل أتانى فقال‏:‏ من مات من أمتك لا يشرك بالله شيئاً دخل الجنة، قلت‏:‏ وإن زنى وإن سرق‏؟‏ قال‏:‏ وإن زنى وإن سرق‏\"‏ ‏(‏‏(‏متفق عليه وهذا لفظ البخاري‏)‏‏)‏‏.‏</p>","grades":[]}]}
