{"collection":"riyadussalihin","bookNumber":"1","chapterId":"96.00","hadithNumber":"712","hadith":[{"lang":"en","chapterNumber":"96","chapterTitle":"Bidding Farewell and Advising on the Eve of Departure for a Journey or Other Things","urn":1607020,"body":"<p>Malik bin Al-Huwairith (May Allah be pleased with him) reported: We came to the Messenger of Allah (ﷺ) when we were all young men of nearly equal age. We stayed with him for twenty days. He was extremely kind and considerate. He perceived that we missed our families so he asked us about those we left behind, and we informed him. Then he (ﷺ) said, \"Go back to your families, stay with them, teach them (about Islam) and exhort them to do good. Perform such Salat (prayer) at such a time and such Salat at such a time. When the time for Salat is due, one of you should announce Adhan (call for prayer) and the oldest among you should lead Salat.\"<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/>\nAl-Bukhari added in a version of his \"And pray as you have seen me pray.\"</p>","grades":[]},{"lang":"ar","chapterNumber":"96","chapterTitle":"- باب وداع الصاحب ووصيته عند فراقه لسفر وغيره والدعاء له وطلب الدعاء منه","urn":1707080,"body":"<p>- وعن أبي سليمان مالك بن الحويرث رضي الله عنه قال‏:‏ أتينا رسول الله صلى الله عليه وسلم ونحن شببه متقاربون، فأقمنا عنده عشرين ليلة، وكان رسول الله صلى الله عليه وسلم رحيماً رفيقاً، فظن أنّا قد اشتقنا أهلنا، فسألنا عمن تركنا من أهلنا، فأخبرناه، فقال‏:‏ “ارجعوا إلى أهليكم، فأقيموا فيهم، وعلموهم ومروهم ، وصلو صلاة كذا في حين كذا، وصلوا كذا في حين كذا، فإذا حضرت الصلاة فليؤذن لكم أحدكم، وليؤمكم أكبركم” ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏ \n‏(‏‏(‏زاد البخاري في رواية له‏:‏ ‏\"‏ وصلوا كما رأيتموني أصلي‏\"‏‏)‏‏)‏</p>","grades":[]}]}
