{
    "collection": "riyadussalihin",
    "bookNumber": "introduction",
    "chapterId": "2.00",
    "hadithNumber": "21",
    "hadith": [
        {
            "lang": "en",
            "chapterNumber": "2",
            "chapterTitle": "Repentance",
            "urn": 1600210,
            "body": "<p>Abdullah bin Ka'b, who served as the guide of Ka'b bin Malik (May Allah be pleased with him) when he became blind, narrated: I heard Ka'b bin Malik (May Allah be pleased with him) narrating the story of his remaining behind instead of joining Messenger of Allah (ﷺ) when he left for the battle of Tabuk. Ka'b said: \"I accompanied Messenger of Allah (ﷺ) in every expedition which he undertook excepting the battle of Tabuk and the battle of Badr. As for the battle of Badr, nobody was blamed for remaining behind as Messenger of Allah (ﷺ) and the Muslims, when they set out, had in mind only to intercept the caravan of the Quraish. Allah made them confront their enemies unexpectedly. I had the honour of being with Messenger of Allah (ﷺ) on the night of 'Aqabah when we pledged our allegiance to Islam and it was dearer to me than participating in the battle of Badr, although Badr was more well-known among the people than that. And this is the account of my staying behind from the battle of Tabuk. I never had better means and more favourable circumstances than at the time of this expedition. And by Allah, I had never before possessed two riding-camels as I did during the time of this expedition. Whenever Messenger of Allah (ﷺ) decided to go on a campaign, he would not disclose his real destination till the last moment (of departure). But on this expedition, he set out in extremely hot weather; the journey was long and the terrain was waterless desert; and he had to face a strong army, so he informed the Muslims about the actual position so that they should make full preparation for the campaign. And the Muslims who accompanied Messenger of Allah (ﷺ) at that time were in large number but no proper record of them was maintained.\" Ka'b (further) said: \"Few were the persons who chose to remain absent believing that they could easily hide themselves (and thus remain undetected) unless Revelation from Allah, the Exalted, and Glorious (revealed relating to them). And Messenger of Allah (ﷺ) set out on this expedition when the fruit were ripe and their shade was sought. I had a weakness for them and it was during this season that Messenger of Allah (ﷺ) and the Muslims made preparations. I also would set out in the morning to make preparations along with them but would come back having done nothing and said to myself: 'I have means enough (to make preparations) as soon as I like'. And I went on doing this (postponing my preparations) till the time of departure came and it was in the morning that Messenger of Allah (ﷺ) set out along with the Muslims, but I had made no preparations. I would go early in the morning and come back, but with no decision. I went on doing so until they (the Muslims) hastened and covered a good deal of distance. Then I wished to march on and join them. Would that I had done that! But perhaps it was not destined for me. After the departure of Messenger of Allah (ﷺ) whenever I went out, I was grieved to find no good example to follow but confirmed hypocrites or weak people whom Allah had exempted (from marching forth for Jihad). Messenger of Allah (ﷺ) made no mention of me until he reached Tabuk. While he was sitting with the people in Tabuk, he said, 'What happened to Ka'b bin Malik?' A person from Banu Salimah said: \"O Messenger of Allah, the (beauty) of his cloak and an appreciation of his finery have detained him.' Upon this Mu'adh bin Jabal (MatAllah be pleased with him) admonished him and said to Messenger of Allah (ﷺ): \"By Allah, we know nothing about him but good.' Messenger of Allah (ﷺ), however, kept quiet. At that time he (the Prophet (ﷺ)) saw a person dressed in white and said, 'Be Abu Khaithamah.' And was Abu Khaithamah Al- Ansari was the person who had contributed a Sa' of dates and was ridiculed by the hypocrites.\" Ka'b bin Malik further said: \"When the news reached me that Messenger of Allah (ﷺ) was on his way back from Tabuk, I was greatly distressed. I thought of fabricating an excuse and asked myself how I would save myself from his anger the next day. In this connection, I sought the counsels of every prudent member of my family. When I was told that Messenger of Allah (ﷺ) was about to arrive, all the wicked ideas vanished (from my mind) and I came to the conclusion that nothing but the truth could save me. So I decided to tell him the truth. It was in the morning that Messenger of Allah (ﷺ) arrived in Al-Madinah. It was his habit that whenever he came back from a journey, he would first go to the mosque and perform two Rak'ah (of optional prayer) and would then sit with the people. When he sat, those who had remained behind him began to put forward their excuses and take an oath before him. They were more than eighty in number. Messenger of Allah (ﷺ) accepted their excuses on the very face of them and accepted their allegiance and sought forgiveness for them and left their insights to Allah, until I appeared before him. I greeted him and he smiled and there was a tinge of anger in that. He then said to me, 'Come forward'. I went forward and I sat in front of him. He said to me, 'What kept you back? Could you not afford to go in for a ride?' I said, 'O Messenger of Allah, by Allah, if I were to sit before anybody else, a man of the world, I would have definitely saved myself from his anger on one pretext or the other and I have a gifted skill in argumentation, but, by Allah, I am fully aware that if I were to put forward before you a lame excuse to please you, Allah would definitely provoke your wrath upon me. In case, I speak the truth, you may be angry with me, but I hope that Allah would be pleased with me (and accept my repentance). By Allah, there is no valid excuse for me. By Allah, I never possessed so good means, and I never had such favourable conditions for me as I had when I stayed behind.' Thereupon, Messenger of Allah (ﷺ) said, 'This man spoke the truth, so get up (and wait) until Allah gives a decision about you.' I left and some people of Banu Salimah followed me. They said to me, 'By Allah, we do not know that you committed a sin before. You, however, showed inability to put forward an excuse before Messenger of Allah (ﷺ) like those who stayed behind him. It would have been enough for the forgiveness of your sin that Messenger of Allah (ﷺ) would have sought forgiveness for you.' By Allah, they kept on reproaching me until I thought of going back to Messenger of Allah (ﷺ) and retract my confession. Then I said to them, 'Has anyone else met the same fate?' They said, 'Yes, two persons have met the same fate. They made the same statement as you did and the same verdict was delivered in their case.' I asked, 'Who are they?' They said, 'Murarah bin Ar-Rabi' Al-'Amri and Hilal bin Umaiyyah Al- Waqifi.' They mentioned these two pious men who had taken part in the battle of Badr and there was an example for me in them. I was confirmed in my original resolve. Messenger of Allah (ﷺ) prohibited the Muslims to talk to the three of us from amongst those who had stayed behind. The people began to avoid us and their attitude towards us changed and it seemed as if the whole atmosphere had turned against us, and it was in fact the same atmosphere of which I was fully aware and in which I had lived (for a fairly long time). We spent fifty nights in this very state and my two friends confined themselves within their houses and spent (most of their) time weeping. As I was the youngest and the strongest, I would leave my house, attend the congregational Salat, move about in the bazaars, but none would speak to me. I would come to Messenger of Allah (ﷺ) as he sat amongst (people) after the Salat, greet him and would ask myself whether or not his lips moved in response to my greetings. Then I would perform Salat near him and look at him stealthily. When I finish my Salat, he would look at me and when I would cast a glance at him he would turn away his eyes from me. When the harsh treatment of the Muslims to me continued for a (considerable) length of time, I walked and I climbed upon the wall of the garden of Abu Qatadah, who was my cousin, and I had a great love for him. I greeted him but, by Allah, he did not answer to my greeting. I said to him, 'O Abu Qatadah, I adjure you in the Name of Allah, are you not aware that I love Allah and His Messenger (ﷺ)?' I asked him the same question again but he remained silent. I again adjured him, whereupon he said, 'Allah and His Messenger (ﷺ) know better.' My eyes were filled with tears, and I came back climbing down the wall.<br/><br/>As I was walking in the bazaars of Al-Madinah, a man from the Syrian peasants, who had come to sell food grains in Al-Madinah, asked people to direct him to Ka'b bin Malik. People pointed towards me. He came to me and delivered a letter from the King of Ghassan, and as I was a scribe, I read that letter whose purport was: 'It has been conveyed to us that your friend (the Prophet (ﷺ)) was treating you harshly. Allah has not created you for a place where you are to be degraded and where you cannot find your right place; so come to us and we shall receive you graciously.' As I read that letter I said: 'This is too a trial,' so I put it to fire in an oven. When forty days had elapsed and Messenger of Allah (ﷺ) received no Revelation, there came to me a messenger of the Messenger of Allah (ﷺ) and said, 'Verily, Messenger of Allah (ﷺ) has commanded you to keep away from your wife.' I said, 'Should I divorce her or what else should I do?' He said, 'No, but only keep away from her and don't have sexual contact with her.' The same message was sent to my companions. So, I said to my wife: 'You better go to your parents and stay there with them until Allah gives the decision in my case.' The wife of Hilal bin Umaiyyah came to Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, Hilal bin Umaiyyah is a senile person and has no servant. Do you disapprove if I serve him?' He said, 'No, but don't let him have any sexual contact with you.' She said, 'By Allah, he has no such desire left in him. By Allah, he has been in tears since (this calamity) struck him.' Members of my family said to me, 'You should have sought permission from Messenger of Allah (ﷺ) in regard to your wife. He has allowed the wife of Hilal bin Umaiyyah to serve him.' I said, 'I would not seek permission from Messenger of Allah (ﷺ) for I do not know what Messenger of Allah might say in response to that, as I am a young man'. It was in this state that I spent ten more nights and thus fifty days had passed since people boycotted us and gave up talking to us. After I had offered my Fajr prayer on the early morning of the fiftieth day of this boycott on the roof of one of our houses, and had sat in the very state which Allah described as: 'The earth seemed constrained for me despite its vastness', I heard the voice of a proclaimer from the peak of the hill Sal' shouting at the top of his voice: 'O Ka'b bin Malik, rejoice.' I fell down in prostration and came to know that there was (a message of) relief for me. Messenger of Allah (ﷺ) had informed the people about the acceptance of our repentance by Allah after he had offered the Fajr prayer. So the people went on to give us glad tidings and some of them went to my companions in order to give them the glad tidings. A man spurred his horse towards me (to give the good news), and another one from the tribe of Aslam came running for the same purpose and, as he approached the mount, I received the good news which reached me before the rider did. When the one whose voice I had heard came to me to congratulate me, I took off my garments and gave them to him for the good news he brought to me. By Allah, I possessed nothing else (in the form of clothes) except these garments, at that time. Then I borrowed two garments, dressed myself and came to Messenger of Allah (ﷺ) On my way, I met groups of people who greeted me for (the acceptance of) repentance and they said: 'Congratulations for acceptance of your repentance.' I reached the mosque where Messenger of Allah (ﷺ) was sitting amidst people. Talhah bin 'Ubaidullah got up and rushed towards me, shook hands with me and greeted me. By Allah, no person stood up (to greet me) from amongst the Muhajirun besides him.\" Ka'b said that he never forgot (this good gesture of) Talhah. Ka'b further said: \"I greeted Messenger of Allah (ﷺ) with 'As-salamu 'alaikum' and his face was beaming with pleasure. He (ﷺ) said, 'Rejoice with the best day you have ever seen since your mother gave you birth. 'I said: 'O Messenger of Allah! Is this (good news) from you or from Allah?' He said, 'No, it is from Allah.' And it was common with Messenger of Allah (ﷺ) that when ever he was happy, his face would glow as if it were a part of the moon and it was from this that we recognized it (his delight). As I sat before him, I said, I have placed a condition upon myself that if Allah accepts my Taubah, I would give up all of my property in charity for the sake of Allah and His Messenger (ﷺ)!' Thereupon Messenger of Allah (ﷺ) said, 'Keep some property with you, as it is better for you.' I said, 'I shall keep with me that portion which is in Khaibar'. I added: 'O Messenger of Allah! Verily, Allah has granted me salvation because of my truthfulness, and therefore, repentance obliges me to speak nothing but the truth as long as I am alive.\" Ka'b added: \"By Allah, I do not know anyone among the Muslims who has been granted truthfulness better than me since I said this to the Prophet (ﷺ). By Allah! Since the time I made a pledge of this to Messenger of Allah (ﷺ), I have never intended to tell a lie, and I hope that Allah would protect me (against telling lies) for the rest of my life. Allah, the Exalted, the Glorious, revealed these Verses:<br/><br/>'Allah has forgiven the Prophet (ﷺ), the Muhajirun (Muslim Emigrants who left their homes and came to Al-Madinah) and the Ansar (Muslims of Al- Madinah) who followed him (Muhammad (ﷺ)) in the time of distress (Tabuk expedition), after the hearts of a party of them had nearly deviated (from the Right Path), but He accepted their repentance. Certainly, He is unto them full of kindness, Most Merciful. And (He did forgive also) the three who did not join <b>[the Tabuk expedition and whose case was deferred (by the Prophet (ﷺ)) for Allah's Decision]</b> till for them the earth, vast as it is, was straitened and their ownselves were straitened to them, and they perceived that there is no fleeing from Allah, and no refuge but with Him. Then, He forgave them (accepted their repentance), that they might beg for His Pardon <b>[repent (unto Him)]</b>. Verily, Allah is the One Who forgives and accepts repentance, Most Merciful. O you who believe! Be afraid of Allah, and be with those who are true (in word and deeds).\" (9:117,118).<br/><br/>Ka'b said: \"By Allah, since Allah guided me to Islam, there has been no blessing more significant for me than this truth of mine which I spoke to Messenger of Allah (ﷺ), and if I were to tell a lie I would have been ruined as were ruined those who had told lies, for Allah described those who told lies with the worst description He ever attributed to anybody else, as He sent down the Revelation:<br/><br/>They will swear by Allah to you (Muslims) when you return to them, that you may turn away from them. So turn away from them. Surely, they are Rijsun <b>[i.e., Najasun (impure) because of their evil deeds]</b>, and Hell is their dwelling place - a recompense for that which they used to earn. They (the hypocrites) swear to you (Muslims) that you may be pleased with them, but if you are pleased with them, certainly Allah is not pleased with the people who are Al- Fa'siqun (rebellious, disobedient to Allah)\". (9:95,96)<br/><br/>Ka'b further added: \"The matter of the three of us remained pending for decision apart from the case of those who had made excuses on oath before Messenger of Allah (ﷺ) and he accepted those, took fresh oaths of allegiance from them and supplicated for their forgiveness. The Prophet (ﷺ) kept our matter pending till Allah decided it. The three whose matter was deferred have been shown mercy. The reference here is not to our staying back from the expedition but to his delaying our matter and keeping it pending beyond the matter of those who made their excuses on oath which he accepted\".<br/><br/><b>[Al- Bukhari and Muslim]</b><br/><br/>Another version adds: \"Messenger of Allah (ﷺ) set out for Tabuk on Thursday. He used to prefer to set out on journey on Thursday.\" Another version says: \"Messenger of Allah (ﷺ) used to come back from a journey in the early forenoon and went straight to the mosque where he would perform two Rak'ah prayer. Afterwards he would seat himself there\".<br/><br/></p>",
            "grades": []
        },
        {
            "lang": "ar",
            "chapterNumber": "2",
            "chapterTitle": "- باب التوبة",
            "urn": 1700210,
            "body": "<p>- وعن عبد الله بن كعب بن مالك، وكان قائد كعب رضي الله عنه من بنيه حين عمي قال‏:‏ سمعت كعب بن مالك رضي الله عنه يحدث بحديثه حين تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك‏.‏ قال كعب‏:‏ لم اتخلف عن رسول الله، صلى الله عليه وسلم ، في غزوة غزاها قط إلا في غزوة تبوك، غير أني قد تخلفت في غزوة بدر، ولم يعاتب أحد تخلف عنه، إنما خرج رسول الله صلى الله عليه وسلم والمسلمون يريدون عير قريش حتى جمع الله تعالى بينهم وبين عدوهم على غير ميعاد‏.‏ ولقد شهدت مع رسول الله صلى الله عليه وسلم ليلة العقبة حين تواثقنا على الإسلام، وما أحب أن لي بها مشهد بدرٍ، وإن كانت بدر أذكر في الناس منها‏.‏ \nوكان من خبري حين تخلف عن رسول الله، صلى الله عليه وسلم، في غزوة تبوك أني لم أكن قط أقوى ولا أيسر مني حين تخلفت عنه في تلك الغزوة، والله ما جمعت قبلها راحلتين قط حتى جمعتهما في تلك الغزوة، ولم يكن رسول الله صلى الله عليه وسلم يريد غزوة إلا ورى بغيرها حتى كانت تلك الغزوة، فغزاها رسول الله صلى الله عليه وسلم في حر شديد، واستقبل سفراً بعيداً ومفازاً، واستقبل عدداً كثيراً، فجلى للمسلمين أمرهم ليتأهبوا أهبة غزوهم فأخبرهم بوجههم الذي يريد، والمسلمون مع رسول الله كثير ولا يجمعهم كتاب حافظ ‏\"‏يريد بذلك الديوان‏\"‏ قال كعب‏:‏ فقل رجل يريد أن يتغيب إلا ظن أن ذلك سيخفى به مالم ينزل فيه وحي من الله، وغزا رسول الله صلى الله عليه وسلم تلك الغزوة حين طابت الثمار والظلال فأنا إليها أصعر فتجهز رسول الله صلى الله عليه وسلم والمسلمون معه، وطفقت أغدو لكي أتجهز معه، فأرجع ولم أقض شيئاً، وأقول في نفسي‏:‏ أنا قادر على ذلك إذا أردت، فلم يزل يتمادى بي حتى استمر بالناس الجد، فأصبح رسول الله صلى الله عليه وسلم غادياً والمسلمون معه، ولم أقض من جهازي شيئاً، ثم غدوت فرجعت ولم أقض شيئاً، فلم يزل يتمادى بي حتى أسرعوا وتفارط الغرو، فهممت أن أرتحل فأدركهم، فياليتني فعلت، ثم لم يقدر ذلك لي، فطفقت إذا خرجت في الناس بعد خروج رسول الله صلى الله عليه وسلم يحزنني أني أرى لي أسوة، إلا رجلاً مغموصاً عليه في النفاق، أو رجلاً ممن عذر الله تعالى من أسوة، إلا رجلاً مغموصاً عليه في النفاق، أو رجلاً ممن عذر الله تعالى من الضعفاء، ولم يذكرني رسول الله صلى الله عليه وسلم حتى بلغ تبوك، فقال وهو جالس في القوم بتبوك‏:‏ ما فعل كعب بن مالك‏؟‏ قَالَ رَجُلٌ مِنْ بَنِي سَلِمَةَ يَا رَسُولَ اللَّهِ حَبَسَهُ بُرْدَاهُ وَالنَّظَرُ فِي عِطْفَيْهِ.فقال له معاذ بن جبل رضي الله عنه بئس ما قلت‏!‏ والله يارسول الله ما علمنا عليه إلا خيراً ، فسكت رسول الله صلى الله عليه وسلم فبينا هو على ذلك رأى رجلا مبيضا يزول به السراب فقال رسول الله صلى الله عليه وسلم‏:‏ كن أبا خيثمة، فإذا أبو خيثمة الأنصاري وهو الذي تصدق بصاع التمر حين لمزه المنافقون، قال كعب‏:‏ فلما بلغني أن رسول الله صلى الله عليه وسلم قد توجه قافلاً من تبوك حضرني بثي، فطفقت أتذكر الكذب وأقول‏:‏ بم أخرج من سخطه غداً وأستعين على ذلك بكل ذي رأى من أهلي، فلما قيل‏:‏ إن رسول الله صلى الله عليه وسلم قد أظل قادماً زاح عني الباطل حتى عرفت أني لم أنج منه بشيء أبداً، فأجمعت صدقه، وأصبح رسول الله صلى الله عليه وسلم قادماً، وكان إذا قدم من سفر بدأ بالمسجد فركع فيه ركعتين ثم جلس للناس، فلما فعل فعل ذلك جاءه المخلفون يعتذرون إليه ويحلفون له، وكانوا بضعا وثمانين رجلاً فقبل منهم علانيتهم وبايعهم واستغفر لهم ووكل سرائرهم إلى الله تعالى حتى جئت‏.‏ فلما سلمت تبسم تبسم المغضب ثم قال‏:‏ تعال، فجئت أمشي حتى جلست بين يديه، فقال لي‏:‏ ما خلفك‏؟‏ ألم تكن قد ابتعت ظهرك‏!‏ قال قلت‏:‏ يارسول الله إني والله لو جلست عند غيرك من أهل الدنيا لرأيت أني سأخرج من سخطه بعذر، لقد أعطيت جدلاً، ولكنني والله لقد علمت لئن حدثتك اليوم حديث كذب ترضي به ليوشكن الله يسخطك علي، وإن حدثتك حديث صدق تجد علي فيه إني لأرجو فيه عقبى الله عز وجل، والله ما كان لي من عذر، والله ما كنت قط أقوى ولا أيسر مني حين تخلفت عنك‏.‏ قال‏:‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما هذا فقد صدق، فقم حتى يقضي الله فيك‏\"‏ وسار رجال من بني سلمة فاتبعوني، فقالوا لي‏:‏ والله ما علمناك أذنبت ذنبا قبل هذا، لقد عجزت في أن لا يكون اعتذرت إلى رسول الله صلى الله عليه وسلم بما اعتذر إليه المخلفون فقد كان كافيك ذنبك استغفار رسول الله صلى الله عليه وسلم لك‏.‏ قال‏:‏ فوالله ما زالوا يؤنبونني حتى أردت أن أرجع إلى رسول الله صلى الله عليه وسلم فأكذب نفسي، ثم قلت لهم‏:‏ هل لقي هذا معي من أحد‏؟‏ قالوا‏:‏ نعم لقيه معك رجلان قالا مثل ما قلت، وقيل لهما مثل ما قيل لك، قال قلت‏:‏ من هما‏؟‏ قالوا‏:‏ مرارة بن الربيع العمري، وهلال بن أمية الواقفي‏؟‏ قال‏:‏ فذكروا لي رجلين صالحين قد شهدا بدراً فيهما أسوة‏.‏ قال‏:‏ فمضيت حين ذكروهما لي‏.‏ ونهى رسول صلى الله عليه وسلم عن كلامنا أيها الثلاثة من بين من تخلف عنه، قال‏:‏ فاجتنبنا الناس- أو قال‏:‏ تغيروا لنا- حتى تنكرت لي في نفس الأرض، فما هي بالأرض التي أعرف، فلبثنا على ذلك خمسين ليلة‏.‏ فأما صاحباي فاستكانا وقعدا في بيوتهما يبكيان، وأما أنا فكنت أشب القوم وأجلدهم، فكنت أخرج فأشهد الصلاة مع المسلمين، وأطوف في الأسواق ولا يكلمني أحد، وآتي رسول الله صلى الله عليه وسلم فأسلم عليه، وهو في مجلسه بعد الصلاة، فأقول في نفسي ‏:‏ هل حرك شفتيه برد السلام أم ‏؟‏ ثم أصلي قريباً منه وأسارقه النظر، فإذا أقبلت على صلاتي نظر إلي، وإذا التفت نحوه أعرض عني، حتى إذا طال ذلك علي من جفوة المسلمين مشيت حتى تسورت جدار حائط أبي قتادة وهو ابن عمي وأحب الناس إلي، فسلمت عليه فوالله ما ردّ علي السلام، فقلت له‏:‏ يا أبا قتادة أنشدك بالله هل تعلمني أُحب الله ورسوله صلى الله عليه وسلم ‏؟‏ فسكت، فعدت فناشدته فسكت، فعدت فناشدته فقال‏:‏ الله ورسوله أعلم‏.‏ ففاضت عيناي، وتوليت حتى تسورت الجدار، فبينما أنا أمشى في سوق المدينة إذا نبطى من نبط أهل الشام ممن قدم بالطعام ببيعه بالمدينة يقول‏:‏ من يدل على كعب بن مالك‏؟‏ فطفق الناس يشيرون له إلي حتى جاءنى فدفع إلي كتاب من ملك غسان، وكنت كاتباً‏.‏ فقرأته فإذا فيه‏:‏ أما بعد فإنه قد بلغنا أن صاحبك قد جفاك، ولم يجعلك الله بدار هوان ولا مضيعة، فالحق بنا نواسك، فقلت حين قرأتها، وهذه أيضاً من البلاء فتيممت بها التنور فسجرتها، حتى إذا مضت أربعون من الخمسين واستلبث الوحى إذا رسول رسول الله صلى الله عليه وسلم يأتينى، فقال‏:‏ إن رسول الله صلى الله عليه وسلم يأمرك أن تعتزل امرأتك، فقلت‏:‏ أطلقها، أم ماذا أفعل‏؟‏ قال‏:‏ لا، بل اعتزلها فلا تقربنها، وأرسل إلى صاحبي بمثل ذلك‏.‏ فقلت لامرأتي‏:‏ ألحقي بأهلك فكوني عندهم حتى يقضي الله في هذا الأمر، فجاءت امرأة هلال بن أمية رسول الله صلى الله عليه وسلم فقالت له ‏:‏ يا رسول الله إن هلال بن أمية شيخ ضائع ليس له خادم، فهل تكره أن أخدمه‏؟‏ قال ‏:‏ لا، ولكن لا يقربنك‏.‏ فقالت‏:‏ إنه والله ما به من حركة إلى شيء، ووالله ما زال يبكي منذ كان من أمره ما كان إلى يومه هذا‏.‏ فقال لي بعض أهلي‏:‏ لو استأذنت رسول الله صلى الله عليه وسلم في امرأتك، فقد أذن لامرأة هلال بن أمية أن تخدمه‏؟‏ فقلت‏:‏ لا أستأذن فيها رسول الله صلى الله عليه وسلم، وما يدريني ماذا يقول رسول الله صلى الله عليه وسلم، إذا استأذنته فيها وأنا رجل شاب‏!‏ فلبثت بذلك عشر ليالٍ، فكمل لنا خمسون ليلة من حين نهى عن كلامنا‏.‏ ثم صليت صلاة الفجر صباح خمسين ليلة على ظهر بيت من بيوتنا، فبينما أنا جالس على الحال التى ذكر الله تعالى منا، قد ضافت علي نفسي وضاقت علي الأرض بما رحبت، سمعت صوت صارخ أوفى على سلع يقول بأعلى صوته‏:‏ يا كعب بن مالك أبشر فخررت ساجداً، وعرفت أنه قد جاء فرج‏.‏ فآذن رسول الله صلى الله عليه وسلم الناس بتوبة الله عز وجل علينا حين صلى صلاة الفجر فذهب الناس يبشروننا، فذهب قبل صاحبي مبشرون، وركض رجل إلي فرساً وسعى ساع من أسلم قبلي وأوفى على الجبل، فكان الصوت أسرع من الفرس، فلما جاءني الذى سمعت صوته يبشرني نزعت له ثوبي فكسوتهما إياه ببشراه، والله ما أملك غيرهما يومئذ، واستعرت ثوبين فلبستهما وانطلقت أتأمم رسول الله صلى الله عليه وسلم يتلقانى الناس فوجاً فوجاً يهنئوني بالتوبة ويقولون لي‏:‏ لتهنك توبة الله عليك، حتى دخلت المسجد فإذا رسول الله صلى الله عليه وسلم جالس حوله الناس، فقام طلحة بن عبيد الله رضي الله عنه يهرول حتى صافحني وهنأني، والله ما قام رجل من المهاجرين غيره، فكان كعب لا ينساها لطلحة‏.‏ قال كعب‏:‏ فلما سلمت على رسول الله صلى الله عليه وسلم قال‏:‏ وهو يبرق وجهه من السرور ‏:‏ أبشر بخير يوم مرّ عليك مذ ولدتك أمك، فقلت‏:‏ أمن عندك يا رسول الله أم من عند الله‏؟‏ قال ‏:‏ لا ، بل من عند الله عز وجل، وكان رسول الله صلى الله عليه وسلم إذا سر استنار وجهه حتى كأن وجهه قطعة قمر، وكنا نعرف ذلك منه، فلما جلست بين يديه قلت‏:‏ يا رسول الله إن من توبتي أن أنخلع من مالي صدقة‎ إلى الله وإلى رسوله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ أمسك عليك بعض مالك فهو خير لك، فقلت‏:‏ إني أمسك سهمي الذى بخيبر‏.‏ وقلت‏:‏ يا رسول الله إن الله تعالى إنما أنجاني بالصدق، وإن من توبتي أن لا أحدثَ إلا صدقاً ما بقيت ، فو الله ما علمت أحداً من المسلمين أبلاه الله في صدق الحديث منذ ذكرت ذلك لرسول الله صلى الله عليه وسلم أحسن مما أبلاني الله تعالى ، والله ما تعمدت كذبة منذ قلت ذلك لرسول الله صلى الله عليه وسلم إلى يومي هذا، وإني لأرجو أن يحفظني الله تعالى فيما بقي، قال‏:‏ فأنزل الله تعالى‏:‏ ‏{‏لقد تاب الله على النبي والمهاجرين والأنصار الذين اتبعوه في ساعة العسرة‏)‏ حتى بلغ‏:‏ ‏{‏إنه بهم رؤوف رحيم ‏.‏ وعلى الثلاثة الذين خلفوا حتى إذا ضاقت عليهم الأرض بما رحبت‏}‏ حتى بلغ ‏:‏ ‏{‏اتقوا الله وكونوا مع الصادقين‏}‏ ‏(‏‏(‏التوبة 117، 119‏)‏‏)‏ قال كعب ‏:‏ والله ما أنعم الله علي من نعمة قط بعد إذ هداني الله للإسلام أعظم في نفسي من صدقي رسول الله صلى الله عليه وسلم أن لا أكون كذبته، فأهلك كما هلك الذين كذبوا، إن الله تعالى قال للذين كذبوا حين أنزل الوحي شر ما قال لأحد، فقال الله تعالى ‏:‏ ‏{‏سيحلفون بالله لكم إذا انقلبتم إليهم لتعرضوا عنهم فأعرضوا عنهم إنهم رجس ومأواهم جهنم جزاء بما كانوا يكسبون يحلفون لكم لترضوا عنهم فإن ترضوا عنهم فإن الله لا يرضى عن القوم الفاسقين‏}‏ ‏(‏‏(‏التوبة‏:‏ 95،96‏)‏‏)‏ ‏.‏\nقال كعب ‏:‏ كنا خلفنا أيها الثلاثة عن أمر أولئك الذين قبل منهم رسول الله صلى الله عليه وسلم حين حلفوا له ، فبايعهم واستغفر لهم، وأرجأ رسول الله صلى الله عليه وسلم أمرنا حتى قضى الله تعالى فيه بذلك، قال الله تعالى ‏:‏ ‏{‏وعلى الثلاثة الذين خلفوا‏}‏ وليس الذي ذكر مما خلفنا تخلفنا عن الغزو، وإنما هو تخليفه إيانا وإرجاؤه أمرنا عمن حلف له واعتذر إليه فقبل منه‏.‏ متفق عليه‏.‏\nوفى رواية ‏\"‏أن النبي صلى الله عليه وسلم خرج في غزوة تبوك يوم الخميس، وكان يحب أن يخرج يوم الخميس‏\"‏\nوفى رواية‏:‏ ‏\"‏وكان لا يقدم من سفر إلا نهاراً في الضحى، فإذا قدم بدأ بالمسجد فصلى فيه ركعتين ثم جلس فيه‏\"‏ ‏.‏</p>",
            "grades": []
        }
    ]
}