{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"1.00","hadithNumber":"1","hadith":[{"lang":"en","chapterNumber":"1","chapterTitle":"Sincerity and Significance of Intentions and all Actions, Apparent and Hidden","urn":1600010,"body":"<p>'Umar bin Al-Khattab (May Allah be pleased with him), reported: The Messenger of Allah (ﷺ) said, \"The deeds are considered by the intentions, and a person will get the reward according to his intention. So whoever emigrated for Allah and His Messenger, his emigration will be for Allah and His Messenger; and whoever emigrated for worldly benefits or for a woman to marry, his emigration would be for what he emigrated for\".<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"1","chapterTitle":"- باب الإخلاص وإحضارالنية","urn":1700010,"body":"<p>- وعن أمير المؤمنين أبي حفص عمر بن الخطاب بن نفيل بن عبد العزى بن رياح بن قرط بن رزاح بن عدى بن لؤى ابن غالب القرشى العدوى‏.‏ رضي الله عنه، قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏ إنما الأعمال بالنيات، وإنما لكل امرىء ما نوى فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها، أو امرأة ينكحها فهجرته إلى ما هاجر إليه‏\"‏ ‏(‏‏(‏متفق على صحته‏.‏ رواه إماما المحدثين‏: أبو عبدالله محمد بن إسماعيل بن إبراهيم بن المغيرة بن بَرْدِزْبَهْ الجعفي البخاري، أبو الحسين مسلم بن الحجاج بن مسلم القشيرى النيسابورى رضي الله عنهما في صحيحهما اللذين هما أصح الكتب المصنفة‏)‏‏)‏‏.‏</p>","grades":[]}]}
