{
    "collection": "riyadussalihin",
    "bookNumber": "introduction",
    "chapterId": "3.00",
    "hadithNumber": "29",
    "hadith": [
        {
            "lang": "en",
            "chapterNumber": "3",
            "chapterTitle": "Patience and Perseverance",
            "urn": 1600290,
            "body": "<p>Usamah bin Zaid (May Allah be pleased with them) narrated: The daughter of the Prophet (ﷺ) sent for him as her child was dying, but the Prophet (ﷺ) returned the messenger and sent her good wishes saying, \"Whatever Allah takes away or gives, belongs to Him, and everything with Him has a limited fixed term (in this world), and so she should be patient and anticipate Allah's reward.\" She again sent for him adjuring him for the sake of Allah to come. The Messenger of Allah, accompanied with Sa'd bin 'Ubadah, Mu'adh bin Jabal, Ubayy bin Ka'b, Zaid bin Thabit and some other men went to see her. The child was lifted up to the Messenger of Allah (ﷺ) while his breath was disturbed in his chest. On seeing that, the eyes of the Prophet (ﷺ) streamed with tears. Sa'd said, \"O Messenger of Allah! What is this?\" He replied, \"It is compassion which Allah has placed in the hearts of His slaves, Allah is Compassionate only to those among His slaves who are compassionate (to others)\".<br/><br/>Another version says: Messenger of Allah (ﷺ) said, \"Allah shows compassion only to those among His slaves who are compassionate\".<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>",
            "grades": []
        },
        {
            "lang": "ar",
            "chapterNumber": "3",
            "chapterTitle": "- باب الصبر",
            "urn": 1700290,
            "body": "<p>- وعن أبي زيد أسامة بن زيد بن حارثة مولى رسول الله صلى الله عليه وسلم وحبه وابن حبه، رضي الله عنهما، قال‏:‏ أرسلت بنت النبي صلى الله عليه وسلم ‏:‏ إن ابني قد احتضر فاشهدنا، فأرسل يقرئ السلام ويقول‏:‏ ‏\"‏إن لله ما أخذ، وله ما أعطى، وكل شيء عنده بأجل مسمى، فلتصبر ولتحتسب‏\"‏ فأرسلت إليه تقسم عليه ليأتينها‏.‏ فقام ومعه سعد بن عبادة، ومعاذ بن جبل، وأبي بن كعب، وزيد بن ثابت، ورجال رضي الله عنهم، فرفع إلى رسول الله صلى الله عليه وسلم الصبي فأقعده في حجره ونفسه تقعقع، ففاضت عيناه، فقال سعد‏:‏ يا رسول الله ماهذا‏؟‏ فقال‏:‏ ‏\"‏هذه رحمة جعلها الله تعالى في قلوب عباده‏\"‏ وفى رواية ‏:‏ ‏\"‏في قلوب من شاء من عباده وإنما يرحم الله من عباده الرحماء‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏</p>",
            "grades": []
        }
    ]
}