{"collection":"riyadussalihin","bookNumber":"1","chapterId":"96.00","hadithNumber":"711","hadith":[{"lang":"en","chapterNumber":"96","chapterTitle":"Bidding Farewell and Advising on the Eve of Departure for a Journey or Other Things","urn":1607010,"body":"<p>Then from it is the narration of Zaid bin Arqam (May Allah be pleased with them) that preceded in the Chapter of \"Showing reverence to the Family of Allah's Messenger (ﷺ)\". \n<br/><br/>\nHe said: \"One day Messenger of Allah (ﷺ) stood amongst us to deliver a Khutbah. So he praised Allah, extolled Him, exhorted and reminded (us) and said: 'Amma Ba'du (now then)! O people, certainly I am a human being. I am about to receive a messenger of Allah my Lord (the angel of death) and I respond. And I am leaving among you two weighty things: There first of which is the Book of Allah. In is guidance and light, so hold fast to the Book of Allah and adhere to it.' So he exhorted (us) (to hold fast to it) and encouraged it then said, 'And the members of my household, I remind you of Allah with regards (of your duties) to the members of my family.\"'<br/><br/><b>[Muslim]</b>.<br/><br/>\nAnd it has preceded in its entirety.</p>","grades":[]},{"lang":"ar","chapterNumber":"96","chapterTitle":"- باب وداع الصاحب ووصيته عند فراقه لسفر وغيره والدعاء له وطلب الدعاء منه","urn":1707070,"body":"<p>- فمنها حديث زيد بن أرقم رضي الله عنه -الذي سبق في باب إكرام أهل بيت رسول الله صلى الله عليه وسلم -قال‏:‏ قام رسول الله صلى الله عليه وسلم فينا خطيباً، فحمد الله، وأثنى عليه، ووعظ وذكر، ثم قال‏:‏ “أما بعد”ألا أيها الناس إنما أنا بشر يوشك أن يأتي رسول الله ربي فأجيب، وأنا تارك فيكم ثقلين ‏:‏‏\"‏ أولهما‏:‏ كتاب الله، فيه الهدى والنور، فخذو بكتاب الله، واستمسكوا به” فحث على كتاب الله، ورغب فيه، ثم قال‏:‏ “وأهل بيتي، أذكركم الله في أهل بيتي‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏ وقد سبق بطوله‏.‏</p>","grades":[]}]}
