{"collection":"riyadussalihin","bookNumber":"17","chapterId":"260.00","hadithNumber":"1546","hadith":[{"lang":"en","chapterNumber":"260","chapterTitle":"Condemnation and Prohibition of Falsehood","urn":1623470,"body":"<p>Sumurah bin Jundub (May Allah be pleased with him) said: The Messenger of Allah (ﷺ) very often used to ask his Companions, \"Do any one of you has seen a dream?\" So dreams would be narrated to him by those whom Allah willed to relate. One day he (ﷺ) said, \"Last night I had a vision in which two men (angels) came to me and woke me up and said to me, 'Proceed!' I set out with them and we came across a man lying down, and behold, another man was standing over his head, holding a big rock. Behold, he was throwing the rock at the man's head, smashing it. When he struck him, the stone rolled away and he went after it to get it, and no sooner had he returned to this man, his head was healed and restored to its former condition. The thrower (of the rock) then did the same as he had done before. I said to my two companions, 'Subhan-Allah! Who are these?' They said: 'Proceed, proceed.' So we proceeded and came to a man lying in a prone position and another man standing over his head with an iron hook, and behold, he would put the hook in one side of the man's mouth and tear off that side of his face to the back (of the neck), and similarly tear his nose from front to back, and his eyes from front to back. Then he turned to the other side of the man's face and did just as he has done with the first side. He had hardly completed that (second) side when the first returned to its normal state. I said to my two companions, 'Subhan-Allah! Who are these?' They said, 'Proceed, proceed.' So we proceeded and came across something like a Tannur (a kind of baking oven, a pit usually clay-lined for baking bread).\" I (the narrator) think the Prophet (ﷺ) said, \"In that oven there was much noise and voices.\" The Prophet (ﷺ) added, \"We looked into it and found naked men and women, and behold, a flame of fire was reaching to them from underneath, and when it reached them they cried loudly. I asked, 'Who are these?' They said to me, 'Proceed, proceed.' And so we proceeded and came across a river.\" I (the narrator) think he said, \"-- red like blood.\" The Prophet (ﷺ) added, \"And behold, in the river there was a man swimming, and on the bank there was a man who had collected many stones. Behold, while the other man was swimming, he went near him. The former opened his mouth and the latter (on the bank) threw a stone into his mouth whereupon he went swimming again. Then again he (the former) returned to him (the latter), and every time the former returned, he opened his mouth, and the latter threw a stone into his mouth, (and so on) the performance was repeated. I asked my two companions, 'Who are these?' They replied, 'Proceed, proceed.' And we proceeded till we came to a man with a repulsive appearance, the most repulsive appearance you ever saw a man having! Beside him there was a fire, and he was kindling it and running around it. I asked my two companions, 'Who is this (man).' They said to me, 'Proceed, proceed!' So we proceeded till we reached a garden of deep green dense vegetation, having all sorts of spring colours. In the midst of the garden there was a very tall man, and I could hardly see his head because of his great height, and around him there were children in such a large number as I have never seen! I said to my two companions, 'Who is this?' They replied, 'Proceed, proceed.' So we proceeded till we came to a majestic, huge garden, greater and better than any garden I have ever seen! My two companions said to me, 'Ascend up' and I ascended up.\" The Prophet (ﷺ) added, \"So we ascended till we reached a city built of gold and silver bricks, and we went to its gate and asked (the gatekeeper) to open the gate, and it was opened; and we entered the city and found in it men with one side of their bodies as handsome as the most handsome person you have ever seen, and the other side as ugly as the ugliest person you have ever seen! My two companions ordered those men to throw themselves into the river. Behold, there was a river flowing across (the city), and its water was like milk in whiteness. Those men went and threw themselves in it and then returned to us after the ugliness (of their bodies) had disappeared, and they came in the best shape.\" The Prophet (ﷺ) further added, \"My two companions said to me: 'This place is the 'Adn Jannah, and that is your place.' I raised up my sight, and behold, there I saw a palace like a white cloud! My two companions said to me, 'That palace is your place,' I said to them, 'May Allah bless you both! Let me enter it.' They replied, 'As for now, you will not enter it, but you shall enter it (one day).' I said to them, 'I have seen many wonders tonight. What does all that mean which I have seen?' They replied, 'We will inform you: As for the first man you came upon, whose head was being smashed with the rock, he is the symbol of the one who studies the Qur'an and then neither recites it nor acts on its orders, and sleeps, neglecting the enjoined prayers. As for the man you came upon, whose sides of mouth, nostrils and eyes were torn off from front to back, he is the symbol of the man who goes out of his house in the morning and tells lies that are spread all over the world. And those naked men and women whom you saw in a construction resembling an oven, they are the adulterers and the adulteresses. And the man who was given a stone to swallow is the eater of Ar-Riba (usury), and the bad-looking man whom you saw near the fire, kindling it and going around it, is Malik, the gatekeeper of Hell, and the tall man you saw in the garden is (Prophet) Abraham, and the children around him are those who died upon Al-Fitrah (the Islamic Faith of Monotheism).\"' The narrator added: Some Muslims asked the Prophet (ﷺ) , \"O Messenger of Allah! What about the children of Al- Mushrikun (i.e., polytheists, pagans, idolaters, and disbelievers in the Oneness of Allah and in His Messenger Muhammad (ﷺ))?\" The Prophet (ﷺ) replied, \"And also the children of Al-Mushrikun.\" The Prophet (ﷺ) added: \"My two companions added, 'The men you saw half handsome and half ugly were these people who had mixed an act that was good with another that was bad, but Allah forgave them'.\"<br/><br/>Another narration of Al-Bukhari is: The Messenger of Allah (ﷺ) said, \"One night two men came to me and took me to a blessed land.\" (The Messenger of Allah (ﷺ) told of the same incident as above) and said, \"After a while of walking we came upon a pit like an oven, narrow at the top and wide at the bottom with fire raging in it. When the flames rose up (the people in it) also rose up till they were about to come out; and when the fire subsided they, too, would go down with it. In it were naked men and women.\" (The remainder of the Hadith is the same as the above Hadith except that at the end of it, the Messenger of Allah (ﷺ) said: \"We came upon a river of blood in the middle of which there was a man standing, and at the bank of the river there was a man with plenty of stones before him...\" In this narration we also find: \"They made me climb the tree and they made me enter an abode so beautiful the like of which I have never seen before. There (I saw) old men and youth.\" In this narration we also find: \"'The first house you entered was the abode of the believers in general, and the other house was the abode of the martyrs. I am Jibril (Gabriel), and this is Mika'il. Raise your head.' I looked up and saw something like clouds. They said to me, 'That is your abode.' I said, 'Shall I enter it?' They said, 'You have not completed your term of life yet. When you do, you will certainly enter it.\"'<br/><br/><b>[Al-Bukhari]</b><br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"260","chapterTitle":"- باب تحريم الكذب","urn":1715360,"body":"<p>- وعن سمرة بن جندب رضي الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم مما يكثر أن يقول لأصحابه‏:‏‏(‏‏(‏هل رأى أحد منكم رؤيا‏؟‏‏)‏‏)‏ فيقص عليه من شاء الله أن يقص، وإنه قال لنا ذات غداة‏:‏‏(‏‏(‏إنه أتاني الليلة آتيان، وإنهما قالا لي‏:‏ انطلق، وإني انطلقت معهما، وإنا أتينا على رجل مضطجع، وإذا آخر قائم عليه بصخرة، وإذا هو يهوي بالصخرة لرأسه، فيثلغ رأسه، فيتدهده الحجر ها هنا، فيتبع الحجر فليأخذه، فلا يرجع إليه حتى يصح رأسه كما كان، ثم يعود عليه، فيفعل به مثل ما فعل المرة الأولى‏!‏‏\"‏ قال‏:‏ ‏\"‏قلت لهما‏:‏ سبحان الله‏!‏ ما هذان‏؟‏ قالا لي‏:‏ انطلق انطلق، فانطلقنا، فأتينا على رجل مستلق لقفاه، وإذا آخر قائم عليه بكلوب من حديد، وإذا هو يأتي أحد شقي وجهه فيشرشر شدقه إلى قفاه، ومنخره إلى قفاه، وعينه إلى قفاه، ثم يتحول إلى الجانب الآخر، فيفعل به مثل ما فعل بالجانب الأول، فما يفرغ من ذلك الجانب حتى يصح ذلك الجانب كما كان، ثم يعود عليه، فيفعل مثل ما فعل في المرة الأولى‏\"‏ قال‏:‏ قلت‏:‏ سبحان الله‏؟‏ ما هذان‏؟‏ قال‏:‏ قالا لي‏:‏ انطلق انطلق، فانطلقنا، فأتينا على مثل التنور‏\"‏ فأحسب أنه قال‏:‏ ‏\"‏فإذا فيه‏:‏ لغط وأصوات، فاطلعنا فيه فإذا فيه رجال ونساء عراة، وإذا هم يأتيهم لهب من أسفل منهم فإذا أتاهم ذلك اللهب ضوضئوا‏.‏ قلت‏:‏ ما هؤلاء‏؟‏ قالا لي‏:‏ انطلق انطلق، فانطلقنا فأتينا على نهر‏\"‏ حسبت أنه كان يقول‏:‏ ‏\"‏أحمر مثل الدم، وإذا في النهر رجل سابح يسبح، وإذا على شط النهر رجل قد جمع عنده حجارة كثيرة، وإذا ذلك السابح يسب ما يسبح، ثم يأتي ذلك الذي قد جمع عنده الحجارة، فيفغر له فاه، فيلقمه حجرًا، فينطلق فيسبح، ثم يرجع إليه، كلما رجع إليه، فغر له فاه، فألقمه حجرًا، قلت لهما‏:‏ ما هذان‏؟‏ قالا لي‏:‏ انطلق انطلق، فانطلقنا، فأتينا على رجل كريه المرآة، أو كأكره ما أنت راء رجلا مرأى فإذا هو عنده نارٌ يحشها ويسعى حولها‏.‏ قلت لهما‏:‏ ما هذا‏؟‏ قال لي‏:‏ انطلق انطلق، فانطلقنا فأتينا على روضة معتمة فيها من كل نور الربيع، وإذا بين ظهري الروضة رجل طويل لا أكاد أرى رأسه طولا في السماء، وإذا حول الرجل من أكثر ولدان رأيتهم قط، قلت‏:‏ ما هذا‏!‏ وما هؤلاء‏؟‏ قالا لي‏:‏ انطلق انطلق، فانطلقنا، فأتينا إلى دوحة عظيمة لم أرَ دوحة قط أعظم منها، ولا أحسن‏!‏ قالا لي‏:‏ ارقَ لي‏:‏ ارقَ فيها، فارتقينا فيها إلى مدينة مبنية بلبن ذهب ولبن فضة، فأتينا باب المدينة فاستفتحنا، ففتح لنا، فدخلناها، فتلقانا رجال شطر من خلقهم كأحسن ما أنت راء‏!‏ وشطر منهم كأقبح ما أنت راء‏!‏ قالا لهم‏:‏ اذهبوا فقعوا في ذلك النهر، وإذا هو نهر معترض يجري كأن ماءه المحض في البياض، فذهبوا فوقعوا فيه‏.‏ ثم رجعوا إلينا قد ذهب ذلك السوء عنهم، فصاروا في أحسن صورة‏.‏ قال‏:‏ قالا لي‏:‏ هذه جنة عدن، وهذاك منزلك، فسما بصري صعدًا، فإذا قصر مثل الربابة البيضاء‏.‏ قالا لي‏:‏ هذاك منزلك‏؟‏ قلت لهما‏:‏ بارك الله فيكما، فذراني فأدخله‏.‏ قالا‏:‏ أما الآن فلا، وأنت داخله‏.‏ قلت لهما‏:‏ فإني رأيت منذ الليلة عجبًا‏؟‏ فما هذا الذي رأيت‏؟‏ قالا لي‏:‏ أما إنا سنخبرك‏:‏ أما الرجل الأول الذي أتيت عليه يثلغ رأسه بالحجر، فإنه الرجل يأخذ القرآن فيرفضه وينام عن الصلاة المكتوبة، وأما الرجل الذي أتيت عليه يشرشر شدقه إلى قفاه، ومنخره إلى قفاه، وعينه إلى قفاه، فإنه الرجل يغدو من بيته فيكذب الكذبة تبلغ الآفاق‏.‏ وأما الرجال والنساء العراة الذين هم في مثل بناء التنور، فإنهم الزناة والزواني، وأما الرجل الذي أتيت عليه يسبح في النهر، ويلقم الحجارة، فإنه آكل الربا، وأما الرجل الكرية المرآة الذي عند النار يحشها ويسعى حولها، فإنه مالك خازن جهنم، وأما الرجل الطويل الذي في الروضة، فإنه إبراهيم، وأما الولدان الذين حوله، فكل مولود مات على الفطرة‏\"‏ وفي رواية البرقاني‏:‏ ‏\"‏ولد على الفطرة‏\"‏ فقال بعض المسلمين‏:‏ يا رسول الله، وأولاد المشركين‏؟‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏وأولاد المشركين، وأما القوم الذين كانوا شطر منهم حسن، وشطر منهم قبيح، فإنهم قوم خلطوا عملا صالحًا وآخر سيئًا، تجاوز الله عنهم‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏\n وفي رواية له‏:‏ ‏\"‏رأيت الليلة رجلين أتياني فأخرجاني إلى أرض مقدسة‏\"‏ ثم ذكره وقال‏:‏ ‏\"‏فانطلقنا إلى نقب مثل التنور، أعلاه ضيق وأسفله واسع؛ يتوقد تحته نارًا، فإذا ارتفعت ارتفعوا حتى كادوا أن يخرجوا، وإذا خمدت، رجعوا فيها، وفيها رجال ونساء عراة‏\"‏‏.‏ وفيها‏:‏ ‏\"‏حتى أتينا على نهر من دم‏\"‏ ولم يشك ‏\"‏فيه رجل قائم على وسط النهر، وعلى شط النهر رجل، وبين يديه حجارة، فأقبل الرجل الذي في النهر، فإذا أراد أن يخرج، رمى الرجل بحجر في فيه، فرده حيث كان، فجعل كلما جاء ليخرج جعل يرمي في فيه بحجر، فيرجع كما كان‏\"‏‏.‏ وفيها‏:‏ ‏\"‏فصعدا بي الشجرة، فأدخلاني دارًا لم أرَ قط أحسن منها، فيها رجال شيوخ وشباب‏\"‏‏.‏ وفيها‏:‏ ‏\"‏الذي رأيته يشق شدقه فكذاب، يحدث بالكذبة فتحمل عنه حتى تبلغ الآفاق، فيصنع به ما رأيت إلى يوم القيامة‏\"‏ وفيها‏:‏ ‏\"‏الذي رأيته يشدخ رأسه فرجل علمه الله القرآن، فنام عنه بالليل، ولم يعمل فيه بالنهار، فيفعل به إلى يوم القيامة، والدار الأولى التي دخلت دار عامة المؤمنين، وأما هذه الدار فدار الشهداء، وأنا جبريل، وهذا ميكائيل، فارفع رأسك، فرفعت رأسي، فإذا فوقي مثل السحاب، قالا‏:‏ ذاك منزلك، قلت‏:‏ دعاني أدخل منزلي، قالا‏:‏ إنه بقي لك عمر لم تستكمله، فلو استكملته، أتيت منزلك‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏قوله: «يثلغ رأسه» هو بالثاء المثلثة والغين المعجمة، أي: يشدخه ويشقه. قوله: «يتدهده» أي: يتدحرج. و «الكلوب» بفتح الكاف وضم اللام المشددة، وهو معروف. قوله: «فيشرشر» : أي: يقطع. قوله: «ضوضوا» وهو بضادين معجمتين: أي صاحوا. قوله: «فيفغر» هو بالفاء والغين المعجمة، أي: يفتح. قوله «المرآة» هو بفتح الميم، أي: المنظر. قوله: «يحشها» هو بفتح الياء وضم الحاء المهملة والشين المعجمة، أي: يوقدها. قوله: «روضة معتمة» هو بضم الميم وإسكان العين وفتح التاء وتشديد الميم، أي: وافية النبات طويلته. قوله: «دوحة» وهي بفتح الدال وإسكان الواو وبالحاء المهملة: وهي الشجرة الكبيرة. قوله: «المحض» هو بفتح الميم وإسكان الحاء المهملة وبالضاد المعجمة، وهو: اللبن. قوله «فسما بصري» أي: ارتفع. و «صعدا» بضم الصاد والعي، أي: مرتفعا. و «الربابة» بفتح الراء وبالباء الموحدة مكررة، وهي: السحابة</p>","grades":[]}]}
