{"collection":"riyadussalihin","bookNumber":"11","chapterId":"234.00","hadithNumber":"1316","hadith":[{"lang":"en","chapterNumber":"234","chapterTitle":"Obligation of Jihad","urn":1611860,"body":"<p>Anas (May Allah be pleased with him) reported: Some people came to the Prophet (ﷺ) and said to him: \"Send with us some men who may teach us the Qur'an and the Sunnah.\" He (ﷺ) sent seventy men from the Ansar. They were called Al-Qurra' (the reciters) and among them was my maternal uncle, Haram. They used to recite the Qur'an, ponder over its meaning and learn (its wisdom) at night. In the day, they used to bring water and pour it in pitchers in the mosque, then they would collect wood and sell it; and with the sale proceeds, they would buy food for the people of As-Suffah and the needy. The Prophet (ﷺ) sent the reciters with these people but these (treacherous people) fell upon them and killed them before they reached their destination. (While dying) they supplicated: \"O Allah convey from us the news to our Prophet that we have met You (in a way), that we are pleased with You and You are pleased with us.\" (The narrator said:) A man attacked Haram from behind and smote him with a spear which pierced him. Whereupon Haram said: \"By the Rubb of Ka'bah, I have met with success. The Messenger of Allah (ﷺ) said to his Companions, \"Your brethren have been slain and they were saying: \"O Allah! Convey from us to our Prophet the news that we have met You (in a way) that we are pleased with You and You are pleased with us.\"<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"234","chapterTitle":"- باب وجوب الجهاد وفضل الغدوة والروحة","urn":1713060,"body":"<p>- وعنه قال‏:‏ جاء ناس إلى النبي صلى الله عليه وسلم أن ابعث معنا رجالا يعلمونا القرآن والسنة فبعث إليهم سبعين رجلا من الأنصار يقال لهم‏:‏ القراء، فيهم خالي حرام، يقرءون القرآن ويتدارسونه بالليل يتعلمون، وكانوا بالنهار يجيئون بالماء فيضعونه في المسجد، ويحتطبون فيبيعونه، ويشترون به الطعام لأهل الصفة، وللفقراء فبعثهم صلى الله عليه وسلم فعرضوا لهم فقتلوهم قبل أن يبلغوا المكان، فقالوا‏:‏ اللهم بلغ عنا نبينا أن قد لقيناك فرضينا عنك ورضيت عنا، وأتى رجل حراما خال أنس من خلف فطعنه برمح حتى أنفذه، فقال حرام‏:‏ فزت ورب الكعبة، فقال رسول الله صلى الله عليه وسلم ‏\"‏إن إخوانكم قد قتلوا وإنهم قالوا‏:‏ اللهم بلغ عنا نبينا أنا قد لقيناك فرضينا عنك ورضيت عنا‏\"‏ ‏(‏‏(‏متفق عليه وهذا لفظ مسلم‏)‏‏)‏‏.‏</p>","grades":[]}]}
