{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"56.00","hadithNumber":"501","hadith":[{"lang":"en","chapterNumber":"56","chapterTitle":"Excellence of Simple Living and being Content with Little","urn":1604980,"body":"<p>Abu Hurairah (May Allah be pleased with him) reported: By Allah other than Whom there is none worthy of worship, I used to press my stomach against the earth owing to my hunger; I would tie a stone over it. One day, I was sitting on the way they usually take when the Prophet (ﷺ) passed by me. When he saw me he smiled at me and knew my condition and my feelings. He called me and I replied, \"At your service, O Messenger of Allah.\" He said, \"Follow me.\" So I followed him. Having arrived at home, he sought permission and entered. He allowed me in and I, too, entered. He found milk in a bowl and asked, \"Where is this from?\" He was told that it was a gift for him from so- and-so. He called me and I responded: \"At your service, O Messenger of Allah.\" He said, \"Go to the people of As-Suffah and usher them in.\" He Abu Hurairah (May Allah be pleased with him) explained: The people of As-Suffah were guests of Islam; they had no family, no property and no relations. When Messenger of Allah (ﷺ) used to receive something in charity, he would send it to them without taking anything from it. When he received a present, he would send for them and share it with them. On this occasion, I disliked to give them anything. I said to myself: \"This meagre quantity of milk will not be enough for all the people of As-Suffah! I am more deserving of it than anyone else. By drinking it I may attain some strength. When they come, he will order me to give it to them. I do not expect that anything will be left for me from this milk.\" As there was no alternative but to obey Allah and His Messenger (ﷺ). I went and called them. They came and sought permission which was granted. They took their seats. The Prophet (ﷺ) called me and I responded, \"At your service, O Messenger of Allah.\" He then said, \"Take the milk and give it to them.\" I took the bowl and gave it to one man who drank his fill and returned it to me, and I gave it to the next and he did the same. I went on doing this till the bowl reached Messenger of Allah (ﷺ). By that time all had taken their fill. He (ﷺ) took the bowl, put it on his hand, looked at me, smiled and said, \"Abu Hirr.\" I said, \"At your service, O Messenger of Allah.\" He said, \"Now you and I are left.\" I said, \"That is true, O Messenger of Allah.\" He said, \"Sit down and drink.\" I drank, but he went on saying, \"Drink some more.\" I said, \"By Him Who has sent you with the Truth, I have no room for it.\" He said, \"Then give it to me.\" So I gave him the bowl. He praised Allah, uttered the Name of Allah and drank the remainder.<br/><br/><b>[Al- Bukhari]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"56","chapterTitle":"-باب فضل الجوع وخشونة العيش والإقتصار على القليل من المأكول والمشروب والملبوس وغيرها من حظوظ النفس وترك الشهوات","urn":1704970,"body":"<p>- وعن أبي هريرة رضي الله عنه قال‏:‏ والله الذي لا إله إلا هو، إن كنت لأعتمد بكبدي على الأرض من الجوع، وإن كنت لأشد الحجر على بطني من الجوع‏.‏ ولقد قعدت يوماً على طريقهم الذي يخرجون منه، فمر بي النبي، صلى الله عليه وسلم ، فتبسم حين رآني، وعرف ما في وجهي وما في نفسي، ثم قال‏:‏ ‏\"‏ أبا هر‏\"‏ قلت لبيك يا رسول الله، قال‏:‏ ‏\"‏ الحق‏\"‏ ومضى فاتبعته، فدخل فاستأذن، فأذن لي فدخلت، فوجد لبنا في قدح فقال‏:‏ ‏\"‏ من أين هذا اللبن‏؟‏‏\"‏ قالوا‏:‏ أهداه لك فلان- أو فلانة- قال‏:‏‏\"‏ أبا هر‏\"‏ قلت‏:‏ لبيك يارسول الله، قال‏:‏ ‏\"‏ الحق إلى أهل الصفة فادعهم لي‏\"‏ قال‏:‏ وأهل الصفة أضياف الإسلام، لا يأوون على أهل، ولا مال، وإذا أتته هدية أرسل إليهم، وأصاب منها وأشركهم فيها، فساءني ذلك فقلت‏:‏ وما هذا اللبن في أهل الصفة‏!‏ كنت أحق أن أصيب من هذا اللبن شربة أتقوى بها، فإذا جأووا وأمرني فكنت أنا أعطيهم؛ وما عسى أن يبلغني من هذا اللبن، ولم يكن من طاعة الله وطاعة رسوله، صلى الله عليه وسلم بد، فأتيتهم فدعوتهم، \nفأقبلوا واستأذنوا، فأذن لهم وأخذوا مجالسهم من البيت قال‏:‏‏\"‏ يا أبا هر‏\"‏ قلت‏:‏ لبيك يا رسول الله قال‏:‏ ‏\"‏ خذ فأعطهم‏\"‏ قال‏:‏ فأخذت القدح، فجعلت أعطيه الرجل فيشرب حتى يروى، ثم يرد علي القدح، فأعطيه الآخر فيشرب حتى يروى، ثم يرد علي القدح حتى انتيهت إلى النبي صلى الله عليه وسلم ، وقد روي القوم كلهم، فأخذ القدح فوضعه على يده، فنظر إلي فتبسم، فقال‏:‏ ‏\"‏ أبا هر‏\"‏ قلت‏:‏ لبيك يا رسول الله، قال‏:‏ ‏\"‏ بقيت أنا وأنت‏\"‏ قلت‏:‏ صدقت يا رسول الله، قال‏:‏ ‏\"‏ اقعد فاشرب‏\"‏ فقعدت فشربت‏:‏ فقال‏:‏ ‏\"‏ اشرب‏\"‏ فشربت، فما زال يقول‏:‏ ‏\"‏ اشرب‏\"‏ حتى قلت‏:‏ لا والذي بعثك بالحق ما أجد له مسلكاً‏!‏ قال‏:‏ ‏\"‏ فأرني‏\"‏ فأعطيته القدح، فحمد الله تعالى، وسمى وشرب الفضلة‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏</p>","grades":[]}]}
