{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"31.00","hadithNumber":"251","hadith":[{"lang":"en","chapterNumber":"31","chapterTitle":"Making Peace among People","urn":1602480,"body":"<p>Sahl bin Sa'd As-Sa'idi (May Allah be pleased with him) reported: There was some quarrel among the members of Banu 'Amr bin 'Auf. Messenger of Allah (ﷺ) went with some of his Companions to bring about peace between them and he was detained. The time for Salat approached and Bilal (May Allah be pleased with them) went to Abu Bakr (May Allah be pleased with him) and said to him: \"Messenger of Allah (ﷺ) has got late and it is the time for Salat. Will you lead Salat?\" He said: \"Yes, if you desire\". Bilal (May Allah be pleased with him) proclaimed the Adhan and then pronounced Iqamah. Abu Bakr (May Allah be pleased with him) stepped forward and commenced As- Salat. (He recited Takbir and the people followed him). In the meantime, Messenger of Allah (ﷺ) arrived and, passing through the rows, took his stand in the first row. The people started clapping. It was the habit of Abu Bakr (May Allah be pleased with him) that whenever he started praying, he would never look round. He paid no heed (to the clapping). When the clapping increased, he turned round and saw Messenger of Allah (ﷺ). He (the Prophet (ﷺ)) beckoned him to continue performing Salat. But Abu Bakr (May Allah be pleased with him) raised his hands and praised Allah. Then he retreated, taking his steps backwards. When Messenger of Allah (ﷺ) saw that, he went ahead and led Salat. When he finished Salat, he faced the congregation and said, \"Why do you clap when something happens during the Salat. Clapping is only for women. If something happens in the course of Salat you should say, Subhan Allah. It is bound to attract attention. And you, Abu Bakr, what prevented you from carrying on with Salat, after I beckoned to do so?\" He said, \"It was not becoming for the son of Abu Quhafah to lead Salat in the presence of Messenger of Allah (ﷺ)\".<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"31","chapterTitle":"- باب الإصلاح بين الناس","urn":1702500,"body":"<p>- وعن أبي العباس سهل بن سعد الساعدي رضي الله عنه ، أن رسول الله صلى الله عليه وسلم بلغه أن بني عمرو بن عوف كان بينهم شر، فخرج رسول الله صلى الله عليه وسلم يصلح بينهم في أناس معه ، فحبس رسول الله صلى الله عليه وسلم وحانت الصلاة، فهل لك أن تؤم الناس‏؟‏ قال‏:‏ نعم إن شئت، فأقام بلال الصلاة، وتقدم أبو بكر فكبر وكبر الناس،وجاء رسول الله صلى الله عليه وسلم يمشي في الصفوف حتى قام في الصف، فأخذ الناس في التصفيق، وكان أبو بكر رضي الله عنه لا يلتفت في صلاته، فلما أكثر الناس التصفيق التفت، فإذا رسول الله صلى الله عليه وسلم، فأشار إليه رسول الله صلى الله عليه وسلم، فرفع أبو بكر رضي الله عنه يده فحمد الله، ورجع القهقرى وراءه حتى قام في الصف، فتقدم رسول الله صلى الله عليه وسلم، فصلى للناس، فلما فرغ أقبل على الناس فقال‏:‏ ‏\"‏أيها الناس ما لكم حين نابكم شيء في الصلاة أخذتم في التصفيق ‏؟‏ إنما التصفيق للنساء‏.‏ من نابه شيء في صلاته فليقل سبحان الله، فإنه لا يسمعه أحد حين يقول سبحان الله إلا التفت، ‏:‏ يا أبا بكر‏:‏ ما منعك أن تصلي الناس حين أشرت إليك‏؟‏‏\"‏ فقال أبو بكر‏:‏ ما كان ينبغي لابن أبي قحافة أن يصلي بالناس بين يدي رسول الله صلى الله عليه وسلم‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ <a href=\"javascript:opencomment('‏‏معنى ‏ ‏حبس‏ ‏‏:‏ أمسكوه ليضيقوه ‏')\">(20)</a>‏‏.‏</p>","grades":[]}]}
