{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"56.00","hadithNumber":"507","hadith":[{"lang":"en","chapterNumber":"56","chapterTitle":"Excellence of Simple Living and being Content with Little","urn":1605040,"body":"<p>Ibn 'Umar (May Allah be pleased with them) reported: We were once sitting in the company of Messenger of Allah (ﷺ) when a man from the Ansar came and greeted. As he was leaving, Messenger of Allah (ﷺ) said to him, \"O brother of the Ansar, how is my brother Sa'd bin 'Ubadah?\" He replied, \"He is well.\" Messenger of Allah (ﷺ) asked, \"Which of you is desirous of visiting him?\" Having said this he got up and we followed him. We were ten and odd in number and we had neither shoes nor light boots nor caps nor shirts. We walked on foot through the barren plain till we came to the residence of Sa'd (May Allah be pleased with him). His people made way and Messenger of Allah (ﷺ) along with those who accompanied him went up to him.<br/><br/><b>[Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"56","chapterTitle":"-باب فضل الجوع وخشونة العيش والإقتصار على القليل من المأكول والمشروب والملبوس وغيرها من حظوظ النفس وترك الشهوات","urn":1705030,"body":"<p>- وعن ابن عمر رضي الله عنهما قال‏:‏ كنا جلوساً مع رسول الله صلى الله عليه وسلم ، إذ جاء رجل من الأنصار، فسلم عليه، ثم أدبر الأنصاري، فقال رسول الله‏.‏ صلى الله عليه وسلم ‏:‏ ‏\"‏ يا أخا الأنصار؛ كيف أخي سعد بن عبادة‏؟‏‏\"‏ فقال‏:‏ صالح، فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏من يعوده منكم‏؟‏‏\"‏ فقام وقمنا معه، ونحن بضعة عشر، ما علينا نعال، ولا خفاف، ولا قلانس، ولا قمص، نمشي في تلك السباخ، حتى جئناه، فاستأخر قومه من حوله حتى دنا رسول الله صلى الله عليه وسلم وأصحابه الذين معه‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏</p>","grades":[]}]}
