{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"18.00","hadithNumber":"170","hadith":[{"lang":"en","chapterNumber":"18","chapterTitle":"Prohibition of heresies in religion","urn":1601690,"body":"<p>Jabir (May Allah be pleased with him) reported: Whenever the Messenger of Allah (ﷺ) delivered a Khutbah, his eyes would become red, his tone loud and he showed anger as if he were warning us against an army. He (ﷺ) would say, \"The enemy is about to attack you in the morning and the enemy is advancing against you in the evening\". He would further say, \"I am sent with the final Hour like these two fingers of mine.\" Messenger of Allah (ﷺ) held up his index finger and the middle finger together to illustrate. He used to add: \"To proceed, the best speech is the Book of Allah and the best guidance is the guidance of Muhammad (ﷺ), the worst practice is the introduction of new practices in Islam and every Bid'ah is a misguidance\". He would also say, \"I am, in respect of rights, nearer to every believer than his own self. He who leaves an estate, it belongs to his heirs, and he who leaves a debt, it is my responsibility to pay it off.\" <b>[Muslim]</b>. <br/><br/> Same Hadith as reported by 'Irbad bin Sariyah (May Allah be pleased with him) has already been recorded in the previous chapter regarding safeguarding the Sunnah of the Prophet (ﷺ).(See Hadith number 158)<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"18","chapterTitle":"-باب النهي عن البدع ومحدثات الأمور","urn":1701690,"body":"<p>- وعن جابر، رضي الله عنه ، كان رسول الله، صلى الله عليه وسلم، إذا خطب احمرت عيناه، وعلا صوته، واشتد غضبه، حتى كأنه منذر جيش يقول‏:‏ ‏\"‏صبحكم ومساكم‏\"‏ ويقول‏:‏ ‏\"‏بعثت أنا والساعة كهاتين‏\"‏ ويقرن بين أصبعيه؛ السبابة والوسطى، ويقول‏:‏ ‏\"‏أما بعد؛ فإن خير الحديث كتاب الله وخير الهدى هدى محمد، صلى الله عليه وسلم، وشر الأمور محدثاتها، وكل بدعة ضلالة‏\"‏ ثم يقول‏:‏ ‏\"‏أنا أولى بكل مؤمن من نفسه‏.‏ من ترك مالاً فلأهله، ومن ترك ديناً أو ضياعاً فإلي وعلى‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ \nوعن العرباض بن سارية، رضي الله عنه ، حديثة السابق في باب المحافظة على السنة‏.‏</p>","grades":[]}]}
