{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"14.00","hadithNumber":"149","hadith":[{"lang":"en","chapterNumber":"14","chapterTitle":"Moderation in Worship","urn":1601480,"body":"<p>Abu Juhaifah (May Allah be pleased with him) reported: The Prophet (ﷺ) made a bond of brotherhood between Salman and Abud-Darda'. Salman paid a visit to Abud-Darda' and found Umm Darda' (his wife) dressed in shabby clothes and asked her why she was in that state. She replied: \"Your brother Abud-Darda' is not interested in (the luxuries of) this world. In the meantime Abud-Darda' came in and prepared a meal for Salman. Salman requested Abud-Darda' to eat (with him) but Abud-Darda' said: \"I am fasting.\" Salman said: \"I am not going to eat unless you eat.\" So, Abud-Darda' ate (with Salman). When it was night and (a part of the night passed), Abud-Darda' got up (to offer the night prayer) but Salman asked him to sleep and Abud-Darda' slept. After some time Abud-Darda' again got up but Salman asked him to sleep. When it was the last hours of the night, Salman asked him to get up and both of them offered (Tahajjud) prayer. Then Salman told Abud-Darda': \"You owe a duty to your Rubb, you owe a duty to your body; you owe a duty to your family; so you should give to every one his due. Abud-Darda' came to the Prophet (ﷺ) and reported the whole story. Prophet (ﷺ) said, \"Salman is right\".<br/><br/><b>[Al- Bukhari]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"14","chapterTitle":"- باب في الاقتصاد في العبادة","urn":1701480,"body":"<p>- وعن أبي جحيفة وهب بن عبد الله رضي الله عنه قال‏:‏ آخى النبي صلى الله عليه وسلم بين سلمان وأبى الدرداء ، فزار سلمان أبا الدرداء، فرأى أم الدرداء متبذلة فقال‏:‏ ما شأنك قالت‏:‏ أخوك أبو الدرداء ليس له حاجة في الدنيا، فجاء أبو الدراداء فصنع له طعاماً، فقال له‏:‏ كل فإنى صائم، قال‏:‏ ما أنا بآكل حتى تأكل، فأكل، فلما كان الليل ذهب أبو الدرداء يقوم فقال له‏:‏ نم، فنام، ثم ذهب يقوم فقال له ‏:‏ نم، فلما كان من آخر الليل قال سلمان‏:‏ قم الآن‏:‏ فصليا جميعاً، فقال له سلمان‏:‏ إن لربك عليك حقاً، وإن لنفسك عليك حقاً، ولأهلك عليك حقاً، فأعط كل ذى حق حقه، فأتى النبي صلى الله عليه وسلم فذكر ذلك له، فقال النبي صلى الله عليه وسلم ‏\"‏صدق سلمان‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏</p>","grades":[]}]}
