{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"26.00","hadithNumber":"213","hadith":[{"lang":"en","chapterNumber":"26","chapterTitle":"Unlawfulness of Oppression and Restoring Others Rights","urn":1602100,"body":"<p>Abu Bakrah (May Allah bepleased with him) reported: The Prophet (ﷺ) said, \"Time has completed its cycle and has come to the state of the day when Allah created the heavens and the earth. The year consists of twelve months of which four are inviolable; three of them consecutive - Dhul-Qa'dah, Dhul-Hijjah and Muharram and Rajab, the month of Mudar (tribe), which comes between Jumada and Sha'ban. What month is this?\" We said, \"Allah and His Messenger (ﷺ) know better\". The Prophet (ﷺ) remained silent for some time until we thought that he would give it a name other than its real name. Then asked, \"Is it not (the month of) Dhul-Hijjah?\". We replied in the affirmative. He asked, \"Which city is this?\". We replied: \"Allah and His Messenger know better\". He remained silent until we thought that he would give it another name. He (ﷺ) asked, \"Is it not Al-Baldah (Makkah)?\" We said: \"Yes\". He (ﷺ) asked, \"What day is this?\". We said: \"Allah and His Messenger know better.\" He (ﷺ) remained silent until we thought that he would give it another name. He asked, \"Is it not the day of An-Nahr (the sacrifice)?\". We replied in the affirmative. Thereupon he said, \"Your blood, your property and your honour are inviolable to you all like the inviolablity of this day of yours, in this city of yours and in this month of yours. You will soon meet your Rubb and He will ask you about your deeds. So do not turn to disbelief after me by striking the necks of one another. Behold! Let him who is present here convey (this message ) to him who is absent; for many a person to whom a message is conveyed has more retentive memory than the one who hears it.\" He (ﷺ) again said, \"Have I conveyed the message to you? Behold! Have I conveyed the Commandments (of Allah) to you.\" We submitted: \"Yes\". He then said, \"O Allah, bear witness (to this)\".<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"26","chapterTitle":"- باب تحريم الظلم والأمر برد المظالم","urn":1702120,"body":"<p>- وعن أبي بكرة نفيع بن الحارث رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏إن الزمان قد استدار كهيئته يوم خلق الله السموات والأرض‏:‏ السنة اثنا عشر شهرًا، منها أربعة حرم‏:‏ ثلاث متواليات‏:‏ ذو القعدة، وذو الحجة، والمحرم، ورجب مضر الذي بين جمادى وشعبان، أي شهر هذا‏؟‏‏\"‏ قلنا‏:‏ الله ورسوله أعلم، فسكت حتى ظننا أنه سيسميه بغير اسمه، قال‏:‏ أليس ذا الحجة‏؟‏ قلنا بلى‏.‏ قال‏:‏ ‏\"‏فأي بلد هذا‏؟‏‏\"‏ قلنا ‏:‏ الله ورسوله أعلم فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ قال‏:‏”أليس البلدة” قلنا‏:‏ بلى ‏.‏ قال‏:‏ ‏\"‏فأي يوم هذا‏؟‏‏\"‏ قلنا‏:‏ الله ورسوله أعلم، فسكت حتى ظننا أن سيسميه بغير اسمه‏.‏ قال‏:‏ “أليس يوم النحر‏؟‏” قلنا بلى‏.‏ قال “فإن دماءكم وأموالكم وأعراضكم عليكم حرام، كحرمة يومكم هذا في بلدكم هذا في شهركم هذا، وستلقون ربكم فيسألكم عن أعمالكم، ألا فلا ترجعوا بعدي كفارًا يضرب بعضكم رقاب بعض، ألا ليبلغ الشاهد الغائب، فلعل بعض من يبلغه أن يكون أوعى له من بعض من سمعه‏\"‏ ثم قال‏:‏ ‏\"‏ ألا هل بلغت، ألا هل بلغت‏؟‏” قلنا ‏:‏ نعم‏.‏ قال‏:‏ “ اللهم اشهد” ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏</p>","grades":[]}]}
