{
    "collection": "riyadussalihin",
    "bookNumber": "introduction",
    "chapterId": "17.00",
    "hadithNumber": "168",
    "hadith": [
        {
            "lang": "en",
            "chapterNumber": "17",
            "chapterTitle": "Obedience to the command of Allah is an obligatory duty",
            "urn": 1601670,
            "body": "<p>Abu Hurairah (May Allah be pleased with him) reported: When it was revealed to Messenger of Allah (ﷺ): \"To Allah belongs all that is in the heavens and all that is on the earth, and whether you disclose what is in your own selves or conceal it, Allah will call you to account for it,\" the Companions of Messenger of Allah (ﷺ) felt it hard and severe and they came to Messenger of Allah (ﷺ) and sat down on their knees and said: \"O Messenger of Allah, we were assigned some duties which were within our power to perform, such as Salat (prayer), Saum (fasting), Jihad (striving in the Cause of Allah), Sadaqah (charity). Then this (the above mentioned) Verse was revealed to you and it is beyond our power to live up to it.\" Messenger of Allah (ﷺ) said, \"Do you want to say what the people of two Books (Jews and Christians) said before you: 'We hear and disobey?' You should rather say: 'We hear and we obey, we seek forgiveness, our Rubb and unto You is the return.\"' And they said: \"We hear and we obey, (we seek) Your forgiveness, our Rubb! And unto You is the return.\" When the people recited it and it smoothly flowed on their tongues, then Allah revealed immediately afterwards: \"The Messenger (Muhammad (ﷺ)) believes in what has been sent down to him from his Rubb, and (so do) the believers. Each one believes in Allah, His Angels, His Books, and His Messengers. (They say), 'We make no distinction between one another of His Messengers' - and they say, 'We hear, and we obey. (We seek) Your forgiveness, our Rubb, and to You is the return (of all)\". When they did that, Allah abrogated this (Ayah) and Allah the Great revealed: \"Allah burdens not a person beyond his scope. He gets reward for that (good) which he has earned, and he is punished for that (evil) which he has earned.\" (The Prophet (ﷺ) said): \"Yes. 'Our Rubb! Lay not on us a burden like that which You did lay on those before us (Jews and Christians)\". (The Prophet (ﷺ) said): \"Yes. 'Our Rubb! Put not on us a burden greater than we have strength to bear\". (The Prophet (ﷺ) said): \"Yes. 'Pardon us and grant us forgiveness. Have mercy on us. You are our Maula (Patron, Supporter and Protector) and give us victory over the disbelieving people\".<br/><br/>He (the Prophet (ﷺ)) said: \"Yes\".<br/><br/><b>[Muslim]</b>.<br/><br/></p>",
            "grades": []
        },
        {
            "lang": "ar",
            "chapterNumber": "17",
            "chapterTitle": "- باب وجوب الانقياد لحكم الله تعالى",
            "urn": 1701670,
            "body": "<p>- عن أبي هريرة، رضي الله عنه ، قال‏:‏ لما نزلت على رسول الله، صلى الله عليه وسلم ‏:‏ ‏{‏ لله ما في السموات وما في الأرض وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله‏}‏ الآية ‏(‏‏(‏البقرة‏:‏283‏)‏‏)‏ أشتد ذلك على أصحاب رسول الله، صلى الله عليه وسلم، فأتوا رسول الله ، صلى الله عليه وسلم، ثم بركوا على الركب فقالوا‏:‏ أي رسول الله كلفنا من الأعمال مانطيق‏:‏ الصلاة والجهاد والصيام والصدقة، وقد أنزلت عليك هذه الآية ولا نطيقها‏.‏ قال رسول الله، صلى الله عليه وسلم‏:‏ ‏\"‏أتريدون أن تقولوا كما قال‏:‏ أهل الكتابين من قبلكم‏:‏ سمعنا وعصينا‏؟‏ بل قولوا‏:‏ سمعنا وأطعنا غفرانك ربنا وإليك المصير‏\"‏ فلما اقترأها القوم، وذلت بها ألسنتهم؛ أنزل الله تعالى في إثرها‏:‏ ‏{‏آمن الرسول بما أنزل إليه من ربه والمؤمنون كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله وقالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير‏}‏ فلما فعلوا ذلك نسخها الله تعالى؛ فأنزل الله عز وجل‏:‏ ‏{‏لايكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ، ربنا لا تؤاخذنا إن نسينا أو أخطأنا‏}‏ قال‏:‏ نعم ‏{‏ ربنا ولا تحمل علينا إصراً كما حملته على الذين من قبلنا ‏}‏ قال‏:‏ نعم ‏{‏ ربنا ولا تحملنا ما لا طاقة لنا به‏}‏ قال ‏:‏ نعم ‏{‏واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين ‏}‏ قال‏:‏ نعم‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏</p>",
            "grades": []
        }
    ]
}