{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"25.00","hadithNumber":"201","hadith":[{"lang":"en","chapterNumber":"25","chapterTitle":"Discharging the Trusts","urn":1601995,"body":"<p>Hudhaifah and Abu Hurairah (May Allah be pleased with them) reported that they heard Messenger of Allah (ﷺ) saying, \"Allah will assemble mankind, and the believers will stand till Jannah will be brought near them. They will then go to Adam (ﷺ) and say, `O our father, ask (Allah (SWT), that Jannah may be opened for us, but he will reply: `There was nothing that put you out of Jannah except your father's sin. I am not the one to do that, go to my son Ibrahim (Abraham), the beloved man of Allah.' Then Ibrahim (ﷺ) when approached, will say: `I am not the one to do that, for I was only a friend; and that is not a lofty status but ask Musa (Moses) to whom Allah spoke.' They will then go to Musa (ﷺ) but he will say: `I am not the one to do that; go to `Isa (Jesus), Allah's Word and spirit.' `Isa (ﷺ) will say: `I am not the one to do that.' So they will come to me; and I will stand and be given permission. Amanah and ties of relationship will be sent forth and will stand on the sides of the Sirat (that is, the Bridge set over Hell-fire) right and left, and the first of you will pass like lightning.'' I said (that is Abu Hurairah (May Allah be pleased with him)\" :I ransom you with my father and mother, what is like the movement of lightning?'' The Messenger of Allah (ﷺ) replied, \"Have you not seen how the lightning goes and returns in the twinkling of an eye? Next (group will pass) like the passing of the breeze, next like the passing of a bird, and the next with the speed of a running man, according to the quality of their deeds. (During all this time) your Prophet (ﷺ) will remain standing on the Bridge saying: `O my Rubb, keep (them) safe, keep (them) safe,' till men's deeds are so weak that a man comes who will be able only to crawl. On both sides of the Bridge pronged flesh hooks, placed under command will be hung and will seize those about whom they receive command, some people being lacerated and escaping and others being thrown violently into Hell.'' Abu Hurairah added: By Him in Whose Hand Abu Hurairah's soul is, the pit of Jahannam (Hell) is seventy years in depth.\n</p>\n<p>\n<b>[Muslim]</b>.</p>","grades":[]},{"lang":"ar","chapterNumber":"25","chapterTitle":"- باب الأمر بأداء الأمانة","urn":1702000,"body":"<p>- وعن حذيفة، وأبي هريرة، رضي الله عنهما ، قالا‏:‏ قال رسول الله، صلى الله عليه وسلم‏:‏ ‏\"‏يجمع الله، تبارك وتعالى الناس، فيقوم المؤمنون حتى تزلف لهم الجنة، فيأتون آدم، صلوات الله عليه، فيقولون‏:‏ يا أبانا استفتح لنا الجنة، فيقول‏:‏ وهل أخرجكم من الجنة إلا خطيئة أبيكم ‏!‏ لست بصاحب ذلك، اذهبوا إلى ابني إبراهيم خليل الله، قال‏:‏ فيأتون إبراهيم، فيقول إبراهيم‏:‏ لست بصاحب ذلك ، اذهبوا إلى موسى الذي كلمه الله تكليمًا، فيأتون موسى، فيقول‏:‏ لست بصاحب ذلك؛ اذهبوا إلى عيسى كلمة الله وروحه‏.‏ فيقول عيسى‏:‏ لست بصاحب ذلك‏.‏ فيأتون محمدًا صلى الله عليه وسلم، فيقوم فيؤذن له، وترسل الأمانة والرحم فتقومان جنبتي الصراط يمينًا وشمالاً، فيمر أولكم كبالبرق‏\"‏ قلت‏:‏ بأبي وأمي، أي شيء كمر البرق‏؟‏ قال‏:‏ “ألم تروا كيف يمر ويرجع في طرفة عين‏؟‏ ثم كمر الريح، ثم كمر الطير، وأشد الرجال تجري بهم أعمالهم، ونبيكم قائم على الصراط يقول‏:‏‏\"‏ رب سلم سلم، حتى تعدز أعمال العباد، حتى يجيء الرجل لا يستطيع السير إلا زحفاً، وفي حافتي الصراط كلاليب معلقة مأمورة بأخذ من أمرت به، فمخدوش ناج، ومكردس في النار‏\"‏ والذي نفس أبي هريرة بيده إن قعر جهنم لسبعون خريفًا‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏</p>","grades":[]}]}
