{"collection":"riyadussalihin","bookNumber":"17","chapterId":"350.00","hadithNumber":"1770","hadith":[{"lang":"en","chapterNumber":"350","chapterTitle":"Undesirability of Intercession in Hudud","urn":1625710,"body":"<p>'Aishah (May Allah be pleased with her) reported: The Quraish were anxious about a woman from Banu Makhzum who had committed theft and asked : \"Who will speak to the Messenger of Allah (ﷺ) about her?\" Then they said: \"No one will be bold enough to do so except Usamah bin Zaid, the (Companion who was) dearly loved by the Messenger of Allah (ﷺ).\" So Usamah (May Allah be pleased with him) spoke to him and the Messenger of Allah (ﷺ) (angrily) said, \"Are you interceding regarding one of the punishments prescribed by Allah?\" He then got up and delivered an address in which he said, \"Indeed what destroyed the people before you was just that when a person of high rank among them committed a theft, they spared him; but if the same crime was done by a poor person they inflicted the prescribed punishment on him. I swear by Allah that if Fatimah daughter of Muhammad should steal, I would have her hand cut off.\"<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/>In another narration 'Aishah (May Allah be pleased with her) said: (Upon hearing the intercession of Usamah), the face of the Messenger of Allah (ﷺ) changed color (because of anger) and he said, \"Do you dare to intercede in matters prescribed by Allah?\" Usamah pleaded: \"O Messenger of Allah! Pray for my forgiveness.\" 'Aishah (May Allah be pleased with her) added: Thereafter the Messenger of Allah (ﷺ) gave orders to have that woman's hand cut off.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"350","chapterTitle":"- باب تحريم الشفاعة في الحدود","urn":1717590,"body":"<p>- وعن عائشة رضي الله عنها، أن قريشًا أهمهم شأن المرأة المخزومية التي سرقت فقالوا‏:‏ من يكلم فيها رسول الله صلى الله عليه وسلم ‏؟‏ فقالوا‏:‏ ومن يجترئ عليه إلا أسامة بن زيد، حب رسول الله صلى الله عليه وسلم ‏:‏، فكلمه أسامة فقال صلى الله عليه وسلم ‏:‏“أتشفع في حد من حدود الله تعالى‏؟‏ “ثم قام فاختطب، ثم قال‏:‏ “إنما أهلك الذين قبلكم أنهم كانوا إذا سرق فيهم الشريف تركوه، وإذا سرق فيهم الضعيف، أقاموا عليه الحد، وايم الله لو أن فاطمة بنت محمد سرقت لقطعت يدها” ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ \nوفي رواية فتلون وجه رسول الله صلى الله عليه وسلم ‏\"‏ فقال‏:‏ ‏\"‏أتشفع في حد من حدود الله‏؟‏‏\"‏ قال أسامة‏:‏ استغفر لي يا رسول الله قال‏:‏ ثم أمر بتلك المرأة فقطعت يدها‏.‏</p>","grades":[]}]}
