{"collection":"riyadussalihin","bookNumber":"17","chapterId":"282.00","hadithNumber":"1606","hadith":[{"lang":"en","chapterNumber":"282","chapterTitle":"Prohibition of Cruelty","urn":1624070,"body":"<p>It has been narrated that Hisham bin Hakim bin Hizam (May Allah be pleased with them) happened to pass by some (non-Arab) farmers of Syria who had been made to stand in the sun, and olive oil was poured on their heads. He said: \"What is the matter?\" He was told that they had been detained for the non-payment of Jizyah. (Another narration says that they were being tortured for not having paid Al-Kharaj). Thereupon Hisham said: \"I bear testimony to the fact that I heard the Messenger of Allah (ﷺ) saying, 'Allah will torment those who torment people in the world.\"' Then he proceeded towards their Amir and reported this Hadith to him. The Amir then issued orders for their release.<br/><br/><b>[Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"282","chapterTitle":"- باب النهي عن تعذيب العبد والدابة والمرأة والولد بغير سبب شرعي أو زائد على قدر الأدب","urn":1715960,"body":"<p>- وعن هشام بن حكيم بن حزام رضي الله عنه أنه مر بالشام على أناس من الأنباط، وقد أقيموا في الشمس، وصُب على رءوسهم الزيت فقال‏:‏ ما هذا‏؟‏ يُعذبون في الخراج وفي رواية‏:‏ حُبسوا في الجزية‏.‏ فقال هشام‏:‏ أشهد لسمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏إن الله يعذب الذين يعذبون الناس في الدنيا‏\"‏ فدخل على الأمير، فحدثه، فأمر بهم فخلوا‏\"‏ ‏(‏‏(‏رواه مسلم‏.‏ ‏\"‏الأنباط‏\"‏ الفلاحون من العجم‏)‏‏)‏‏.‏</p>","grades":[]}]}
