{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"16.00","hadithNumber":"162","hadith":[{"lang":"en","chapterNumber":"16","chapterTitle":"Observing the Sunnah and the manners of its obedience","urn":1601610,"body":"<p>Abu Musa (May Allah be pleased with him) reported: Messenger of Allah (ﷺ) said, \"The similitude of guidance and knowledge with which Allah has sent me is like a rain which has fallen on some ground. A fertile part of earth has absorbed water and brought forth much grass and herbs. Another part, which is solid, held the water and Allah benefits men thereby, who drank and gave others to drink, and used it for irrigation. But some of it has fallen on a portion of sandy land which neither retains the water nor produces herbage. Such is the likeness of the man who understands the religion of Allah and who gets benefit of what Allah has sent me with; he learns and teaches others. It is also the likeness of the man who neither raises his head on that account (meaning he does not benefit from what the Prophet (ﷺ) was sent with) nor accepts Allah's Guidance with which I am sent\".<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"16","chapterTitle":"- باب الأمر بالمحافظة على السنة وآدابهـا","urn":1701610,"body":"<p>- السابع‏:‏ عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏إن مثل ما بعثني الله به من الهدى والعلم كمثل غيث أصاب أرضاً فكانت منها طائفة طيبة، قبلت الماء فأنبتت الكلأ والعشب الكثير، وكان منها أجادب أمسكت الماء، فنفع الله بها الناس فشربوا منها وسقوا وزرعوا‏.‏ وأصاب طائفة منها أخرى ، إنما هي قيعان لا تمسك ماء ولا تنبت كلأ‏.‏ فذلك مثل من فقه في دين الله، ونفعه بما بعثنى الله به، فعلم وعلم، ومثل من لم يرفع بذلك رأساً، ولم يقبل هدى الله الذي أرسلت به‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏\n<br/>\n‏‏ ‏فقه‏ ‏ بضم القاف على المشهور، وقيل‏:‏ بكسرها، أي‏:‏ صار فقيهاً‏.</p>","grades":[]}]}
