{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"56.00","hadithNumber":"520","hadith":[{"lang":"en","chapterNumber":"56","chapterTitle":"Excellence of Simple Living and being Content with Little","urn":1605170,"body":"<p>Anas (May Allah be pleased with him) reported: Abu Talhah (May Allah be pleased with him) said to (to his wife) Umm Sulaim(May Allah be pleased with her), \"I noticed some weakness in the voice of Messenger of Allah (ﷺ) and I feel it was due to hunger. Have you got any food?\" She said, \"Yes.\" So she brought out barley loaves, took off her head covering, in a part of which she wrapped these loaves and then put them beneath my mantle and covered me with a part of it. She then sent me to Messenger of Allah (ﷺ). I set forth and found Messenger of Allah (ﷺ) sitting in the mosque in the company of some people. I stood near them whereupon Messenger of Allah (ﷺ) asked, \"Has Abu Talhah sent you?\" I said, \"Yes.\" Thereupon he said to those who were with him to get up (and follow him). He went forth and so did I, ahead of them until I came to Abu Talhah and informed him. Abu Talhah said, \"O Umm Sulaim, here comes Messenger of Allah (ﷺ) along with the people and we do not have enough (food) to feed them.\" She said, \"Allah and His Messenger know better.\" Abu Talhah went out (to receive him) until he met Messenger of Allah (ﷺ), and he came forward along with him until they both (Messenger of Allah (ﷺ) and Abu Talhah (May Allah be pleased with him) came in. Then Messenger of Allah (ﷺ) said, \"O Umm Sulaim, bring forth what you have with you.\" So she brought the bread. Messenger of Allah (ﷺ) commanded that the bread be broken into small pieces and after Umm Sulaim (May Allah be pleased with her) had squeezed clarified butter out of a butter container and made it just like soup. Messenger of Allah (ﷺ) recited over it what Allah wished him to recite. He then said, \"Allow ten guests to come in.\" They ate until they had their fill. They then went out. He (Messenger of Allah (ﷺ)) again said, \"Allow ten (more to come in)\", and he (the host) ushered them in. They ate to their fill. Then they went out. He (ﷺ) again said, \"Allow ten (more),\" until all the people ate to their fill. They were seventy or eighty persons.<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/>Another narration is: Anas said: When all had eaten, the remaining food was collected. It was as much as there was in the beginning.<br/><br/>Yet another narration is: Anas said: The groups of ten people ate by turn. After eighty persons had eaten, Messenger of Allah (ﷺ) and the family of that house ate, and there was still a quantity left over.<br/><br/>Another narration is: Anas (May Allah be pleased with him) said: I visited Messenger of Allah (ﷺ) one day, and found him sitting in the company of his Companions, with a belt tied over his waist. I asked, \"Why has Messenger of Allah (ﷺ) tied the belt on his waist?\" I was told, \"Due to hunger.\" I went to Abu Talhah (May Allah be pleased with him) the husband of Umm Sulaim (May Allah be pleased with her) and said, \"O father, I have seen Messenger of Allah (ﷺ) with a belt tied over his waist. I asked one of his Companions about the reason of it and he said that it was on account of severe hunger.\" Abu Talhah (May Allah be pleased with him) went to my mother and asked, \"Have you got anything?\" She said, \"Yes. I have a piece of bread and some dry dates. Were Messenger of Allah (ﷺ) to come alone, we could feed him his fill, but if he comes along with others, there would not be enough food.\" Anas then narrated the Hadith in full.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"56","chapterTitle":"-باب فضل الجوع وخشونة العيش والإقتصار على القليل من المأكول والمشروب والملبوس وغيرها من حظوظ النفس وترك الشهوات","urn":1705160,"body":"<p>- وعن أنس رضي الله عنه قال‏:‏ قال أبو طلحة لأم سليم‏:‏ قد سمعت صوت رسول الله صلى الله عليه وسلم ضعيفاً أعرف فيه الجوع، فهل عندك من شيء‏؟‏ فقالت‏:‏ نعم، فأخرجت أقراصاً من شعير، ثم أخذت خماراً لها، فلفت الخبز ببعضه، ثم دسته تحت ثوبي وردتني ببعضه، ثم أرسلتني إلى رسول الله صلى الله عليه وسلم فذهبت به، فوجدت رسول الله صلى الله عليه وسلم جالساً في المسجد، ومعه الناس، فقمت عليهم، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏أرسلك أبو طلحة‏؟‏‏\"‏ فقلت‏:‏ نعم، فقال‏:‏ ‏\"‏ألطعام‏\"‏ فقلت‏:‏ نعم، فقال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏قوموا‏\"‏ فانطلقوا بين أيديهم حتى جئت أبا طلحة فأخبرته، فقال أبو طلحة‏:‏ يا أم سليم‏:‏ قد جاء رسول الله بالناس وليس عندنا ما نطعمهم‏؟‏ فقالت‏:‏ الله ورسوله أعلم‏.‏ فانطلق أبو طلحة حتى لقي رسول الله صلى الله عليه وسلم فأقبل رسول الله صلى الله عليه وسلم معه حتى دخلا، فقال رسول الله صلى الله عليه وسلم‏:‏ “هلمى ما عندك يا أم سليم‏\"‏ فأتت بذلك الخبز، فأمر به رسول الله صلى الله عليه وسلم ففت وعصرت عليه أم سليم عكة فآدمته، ثم قال فيه رسول الله صلى الله عليه وسلم ما شاء الله أن يقول، ثم قال‏:‏ ‏\"‏ائذن لعشرة‏\"‏ فأذن لهم، فأكلوا حتى شبعوا ثم خرجوا، ثم قال‏:‏ ‏\"‏ائذن لعشرة‏\"‏ فأذن لهم، فأكلوا حتى شبعوا، ثم خرجوا، ثم قال‏:‏ ‏\"‏ائذن لعشرة‏\"‏ فأذن لهم حتى أكل القوم كلهم وشبعوا، والقوم سبعون رجلاً أو ثمانون‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏\n<br/>\n وفي رواية‏:‏ فما زال يدخل عشرة ويخرج عشرة، حتى لم يبق منهم أحد إلا دخل، فأكل حتى شبع، ثم هيأها فإذا هي مثلها حين اكلوا منها‏.‏\n<br/>\nوفي رواية‏:‏ فأكلوا عشرة عشرة، حتى فعل ذلك بثمانين رجلا، ثم أكل النبي صلى الله عليه وسلم بعد ذلك وأهل البيت، وتركوا سؤراً‏.‏\n<br/>\nوفي رواية‏:‏ ثم أفضلوا ما بلغوا جيرانهم‏.‏\n<br/>\nوفي رواية عن أنس قال‏:‏ جئت رسول الله صلى الله عليه وسلم يوماً، فوجدته جالساً مع أصحابه، وقد عصب بطنه بعصابة، فقلت لبعض أصحابه‏:‏ لم عصب رسول الله صلى الله عليه وسلم بطنه‏؟‏ فقالوا‏:‏ من الجوع، فذهبت إلى أبي طلحة، وهو زوج أم سليم بنت ملحان، فقلت‏:‏ يا أبتاه، قد رأيت رسول الله صلى الله عليه وسلم عصب بطنه بعصابة، فسألت بعض أصحابه، فقالوا‏:‏ من الجوع‏.‏ فدخل أبو طلحة على أمي فقال‏:‏ هل من شيء ‏؟‏ قالت‏:‏ نعم عندي كسر من خبز وتمرات، فإن جاءنا رسول الله صلى الله عليه وسلم وحده أشبعناه وإن جاء آخر معه قل عنهم، وذكر تمام الحديث‏.‏</p>","grades":[]}]}
