{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"56.00","hadithNumber":"496","hadith":[{"lang":"en","chapterNumber":"56","chapterTitle":"Excellence of Simple Living and being Content with Little","urn":1604930,"body":"<p>Abu Hurairah (May Allah be pleased with him) reported: Messenger of Allah (ﷺ) went out (of his house) one day, or one night, and there he met Abu Bakr and 'Umar (May Allah be pleased with them) also. He (ﷺ) said, \"What made you leave your houses at this hour?\" They said, \"It is hunger, O Messenger of Allah.\" He said, \"By Him in Whose Hands my soul is, what made you leave, made me also leave, so come along!\" And he went along with them to a man from the Ansar, but they did not find him in his house. When the wife of that man saw the Prophet, she said, \"You are most welcome.\" Messenger of Allah (ﷺ) said to her, \"Where is so-and-so?\" She said, \"He went to fetch some fresh water for us.\" In the meantime, the Ansari came back, saw Messenger of Allah (ﷺ) and his two companions and said: \"Praise be to Allah, today no one has more honourable guests than I.\" He then went out and brought them a bunch of date fruit, having dates, some still green, some ripe, and some fully ripe, and requested them to eat from it. He then took his knife (to slaughter a sheep). Messenger of Allah (ﷺ) said to him, \"Do not kill a milch sheep.\" So he slaughtered a sheep for them. After they had eaten and drunk to their fill, Messenger of Allah (ﷺ) said to Abu Bakr and 'Umar (May Allah be pleased with them), \"By Him in Whose Hand my soul is, you will certainly be questioned about this treat on the Day of Resurrection. Hunger brought you out of your homes, and you do not return to your homes till you have been blessed with this treat.\"<br/><br/><b>[Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"56","chapterTitle":"-باب فضل الجوع وخشونة العيش والإقتصار على القليل من المأكول والمشروب والملبوس وغيرها من حظوظ النفس وترك الشهوات","urn":1704920,"body":"<p>- وعن أبي هريرة رضي الله عنه قال‏:‏ خرج رسول الله صلى الله عليه وسلم ذات يوم أو ليلة، فإذا هو بأبي بكر وعمر رضي الله عنهما، فقال‏:‏ ‏\"‏ ما أخرجكما من بيوتكما هذه الساعة‏؟‏” قالا‏:‏ الجوع يا رسول الله‏.‏ قال‏:‏ ‏\"‏ وأنا، والذي نفسي بيده، لأخرجني الذي أخرجكما‏.‏ قوما‏\"‏ فقاما معه، فأتى رجلا من الأنصار، فإذا هو ليس في بيته، فلما رأته المرأة قالت‏:‏ مرحباً وأهلا، فقال لها رسول الله صلى الله عليه وسلم ‏\"‏أين فلان‏؟‏‏\"‏ قالت ذهب يستعذب لنا الماء، إذ جاء الأنصاري، فنظر إلى رسول الله صلى الله عليه وسلم وصاحبيه، ثم قال‏:‏ الحمد الله، ما أحد اليوم أكرم أضيافاً مني‏.‏ فانطلق فجاءهم بعذق فيه بسر وتمر ورطب، فقال‏:‏ كلوا وأخذ المدية فقال رسول الله صلى الله عليه وسلم ‏\"‏ إياك والحلوب‏\"‏ فذبح لهم فأكلوا من الشاة ومن ذلك العذق وشربوا فلما أن شبعوا ورووا قال رسول الله صلى الله عليه وسلم لأبي بكر وعمر رضي الله عنهما‏:‏ ‏\"‏ والذي نفسي بيده، لتسألن عن هذا النعيم يوم القيامة، أخرجكم من بيوتكم الجوع، ثم لم ترجعوا حتى أصابكم هذا النعيم‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏\n<br/>\n‏‏(‏‏(‏قولها‏:‏ ‏ ‏ يستعذب‏ ‏ أي‏:‏ يطلب الماء العذب، وهو الطيب‏.‏ و ‏ ‏العذق‏ ‏ بكسر العين وإسكان الذال المعجمة‏:‏ وهو الكباسة، وهي الغضن‏.‏ و‏ ‏ المدية‏ ‏ بضم الميم وكسرها‏:‏ هي السكين‏.‏ و ‏ ‏ الحلوب‏ ‏ ذات اللبن‏.‏ والسؤال عن الأنصاري الذي أتوه هو أبو الهيثم بن التيهان رضي الله عنه، كذا جاء مبيناً في رواية الترمذي وغيره‏)‏‏)‏‏.‏</p>","grades":[]}]}
