{"collection":"riyadussalihin","bookNumber":"2","chapterId":"107.00","hadithNumber":"744","hadith":[{"lang":"en","chapterNumber":"107","chapterTitle":"Eating from the Side of the Vessel","urn":1607240,"body":"<p>'Abdullah bin Busr (May Allah be pleased with him) reported: The Prophet (ﷺ) had a large bowl called Al-Gharra', which would be carried by four men. One day, when the Companions finished their Duha (forenoon optional) prayer, Al-Gharra' was brought full of sopped bread, meat and broth, and they sat down around it. When their number increased, Messenger of Allah (ﷺ) sat down on his knees and rested on the soles of his feet. A bedouin said to him: \"What sort of sitting is that?\" Thereupon Messenger of Allah (ﷺ) said, \"Verily, Allah has made me a courteous slave not a fierce tyrant.\" Then he said, \"Eat from the sides of the bowl and leave the central part of it so that your food will be blessed.\"<br/><br/><b>[Abu Dawud]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"107","chapterTitle":"- باب الأمر بالأكل من جانب القصعة والنهى عن الأكل من وسطها","urn":1707390,"body":"<p>- وعن عبد الله بن بشر رضى الله عنه قال‏:‏ كان للنبي صلى الله عليه وسلم قصعة يقال لها‏:‏ الغراء، يحملها أربعة رجال، فلما أضحوا وسجدوا الضحى أتى بتلك القصعة، يعنى وقد ثرد فيها، فالتقوا عليه ، فلما كثروا جثا رسول الله صلى الله عليه وسلم‏.‏فقال أعرابي ‏:‏ ما هذه الجلسة‏؟‏ قال رسول الله صلى الله عليه وسلم ‏:‏ إن الله جعلني عبداً كريماً، ولم يجعلني جباراً عنيداً، ثم قال رسول الله صلى الله عليه وسلم ‏:‏‏\"‏كلوا من حواليها، ودعوا ذروتها يبارك فيها‏\"‏ .‏((رواه أبو داود))</p>","grades":[]}]}
