{"collection":"riyadussalihin","bookNumber":"15","chapterId":"247.00","hadithNumber":"1450","hadith":[{"lang":"en","chapterNumber":"247","chapterTitle":"The Excellence of Gathering in which Allah is Remembered","urn":1613160,"body":"<p>Abu Sa'id Al-Khudri (May Allah be pleased with him) reported: Mu'awiyah (May Allah be pleased with him) came to an assembly in the mosque and asked them: \"What has made you sit together?\" They replied, \"We are sitting here to remember Allah.\" He said, \"I adjure you by Allah to tell me whether nothing else has made you to sit together.\" They replied: \"By Allah! We are sitting only to remember Allah.\" Then he said, \"I did not adjure you because I suspected you. No one of my rank in the eyes of the Messenger of Allah (ﷺ) is the narrator of so few traditions as I am. The fact is that the Messenger of Allah (ﷺ) went out to a circle of his Companions and said, 'What has made you sit there?' When they replied that they are sitting together to remember Allah and to praise Him for guiding them to Islam and bestowing favours on them, he (ﷺ) said, 'I adjure you by Allah to tell me that nothing else has made you sit together.' On their reply that there was certainly no other purpose, he (ﷺ) said, 'I did not adjure you because I suspected you, but Jibril (Gabriel) came to me and told me that Allah was talking proudly of you to the angels.\"'<br/><br/><b>[Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"247","chapterTitle":"- باب فضل حلق الذكر والندب إلى ملازمتها والنهي عن مفارقتها لغير عذر","urn":1714400,"body":"<p>- وعن أبي سعيد الخدري رضي الله عنه قال‏:‏ خرج معاوية رضي الله عنه على حلقة في المسجد، فقال‏:‏ ما أجلسكم‏؟‏ قالوا‏:‏ جلسنا نذكر الله‏.‏ قال‏:‏ آلله ما أجلسكم إلا ذاك‏؟‏ قالوا‏:‏ ما أجلسنا إلا ذاك، قال‏:‏ أما إني لم أستحلفكم تهمة لكم، وما كان أحد بمنزلتي من رسول الله صلى الله عليه وسلم أقل حديثًا مني‏:‏ إن رسول الله صلى الله عليه وسلم خرج على حلقة من أصحابه فقال‏:‏ ‏\"‏ما أجلسكم‏؟‏‏\"‏ قالوا‏:‏ جلسنا نذكر الله، ونحمده على ما هدانا للإسلام، ومنَّ به علينا‏.‏ قال‏:‏ ‏\"‏آلله ما أجلسكم إلا ذاك‏؟‏‏\"‏ قالوا‏:‏ والله ما أجلسنا إلا ذلك‏\"‏‏.‏ قال‏:‏ ‏\"‏أما إني لم أستحلفكم تهمة لكم، ولكنه أتاني جبريل فأخبرني أن الله يباهي بكم الملائكة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏</p>","grades":[]}]}
