{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"44.00","hadithNumber":"351","hadith":[{"lang":"en","chapterNumber":"44","chapterTitle":"Revering the Scholars and Elders, Preferring them to others and raising their Status","urn":1603470,"body":"<p>Sahl bin Abu Hathmah Al-Ansari (May Allah be pleased with him) reported: 'Abdullah bin Sahl and Muhaiyisah bin Mas'ud (May Allah be pleased with them) went to Khaibar during the period of the truce (after its conquest) and they separated to perform their duties. When Muhaiyisah returned to `Abdullah bin Sahl, he found him murdered, drenched in his blood. So he buried him and returned to Al-Madinah. Then `Abdur-Rahman bin Sahl, Huwaiyisah and Muhaiyisah, the two sons of Mas`ud went to Messenger of Allah (ﷺ) and spoke about the case of their (murdered) friend. `Abdur-Rahman, who was the youngest of them all, started talking. Messenger of Allah (ﷺ) said, \"Let those older than you speak first.\" So he stopped talking and the (other two) spoke about the case of their (murdered) friend. Messenger of Allah (ﷺ) said, \"Will you take an oath whereby you will have the right to receive the blood money of your murdered man?\" And mentioned the rest of the Hadith. [Al-Bukhari and Muslim].</p>","grades":[]},{"lang":"ar","chapterNumber":"44","chapterTitle":"- باب توقير العلماء والكبار وأهل الفضل وتقديمهم على غيرهم، ورفع مجالسهم، وإظهار مرتبتهم","urn":1703470,"body":"<p>- وعن أبي يحيى وقيل‏:‏ أبي محمد سهل بن أبي حَثْمة -بفتح الحاء المهملة وإسكان الثاء المثلثة -الأنصاري رضي الله عنه قال‏:‏ انطلق عبد الله ابن سهل ومحيصة بن مسعود إلى خيبر وهي صلح، فتفرقا، فأتى محيصة إلى عبد الله بن سهل وهو يتشحط في دمه قتيلاً، فدفنه، ثم قدم المدينة فانطلق عبد الرحمن بن سهل ومحيصة وحويصة ابنا مسعود إلى النبي صلى الله عليه وسلم، فذهب عبد الرحمن يتكلم فقال‏:‏ ‏\"‏ كبر كبر‏\"‏ وهو أحدث القوم، فسكت، فتكلما فقال‏:‏ ‏\"‏أتحلفون وتستحقون قاتلكم‏؟‏ وذكر تمام الحديث‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏</p>","grades":[]}]}
